
//uasoft Леонид 30.08.2013 16:30:36

Процедура ПередЗаписью(Отказ)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//... проверим заполнение
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен реквизит 'Наименование'!",Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Регион) Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен реквизит 'Регион'!",Отказ);
		
	КонецЕсли;
	
	
КонецПроцедуры
 //...uasoft Леонид 30.08.2013 17:18:01