Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;

Перем мЭтоНеНовый;

// Обработчик события элемента ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НоменклатураГТД     = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
	
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;

	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, НСтр("ru='базовая единица';uk='базова одиниця'"));
			#КонецЕсли
			Отказ = Истина;
		Иначе
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			   И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				ТекстСообщения = НСтр("ru='У единицы хранения остатков номенклатуры ""';uk='В одиниці зберігання залишків номенклатури ""'") + СокрЛП(Ссылка) + НСтр("ru='"" неверно указан владелец!';uk='"" невірно вказаний власник!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;

		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		   И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			ТекстСообщения = НСтр("ru='У единицы для отчетов номенклатуры ""';uk='У одиниці для звітів номенклатури ""'") + СокрЛП(Ссылка) + НСтр("ru='"" неверно указан владелец!';uk='"" невірно вказаний власник!'");
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		Если мЭтоНеНовый Тогда
			СуществуютСсылки = Неопределено;

			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = НСтр("ru='Единица ""';uk='Одиниця ""'") + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + НСтр("ru='"" является единицей хранения остатков для ""';uk='"" є одиницею зберігання залишків для ""'") + Наименование + НСтр("ru='"""
"и уже участвует в товародвижении. "
"Изменить эту единицу уже нельзя!';uk='"""
"і вже бере участь у русі товарів. "
"Змінити цю одиницю вже не можна!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
			   И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = НСтр("ru='Номенклатура ""';uk='Номенклатура ""'") + СокрЛП(Ссылка) + НСтр("ru='"" участвует в товародвижении."
"Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!';uk='"" бере участь у русі товарів."
"Не можна змінити тип номенклатури (Послуга, товар, набір-комплект), якщо позиція номенклатури бере участь у русі товарів!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				ТекстСообщения = НСтр("ru='Номенклатура ""';uk='Номенклатура ""'") + СокрЛП(Ссылка) + НСтр("ru='"" участвует в товародвижении."
"признак учета по сериям не может быть изменен!';uk='"" бере участь у русі товарів."
"ознака обліку за серіями не може бути змінена!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, НСтр("ru='вид номенклатуры';uk='вид номенклатури'"));
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	ЕстьШК = ПроверитьНаНаличиеШК();
	
	//WMS ==== Запись карточки ==== WMS	
	Если Константы.WMSВыгружатьСправочники.Получить() Тогда
		Если Не ЭтоГруппа Тогда 
			//Если ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар И ЕстьШК Тогда
			Если ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда 
				WMSОбменыИнформацией.ВыгрузитьТоварыВLogisticonWMS(Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//WMS ==== Запись карточки ==== WMS	
	
КонецПроцедуры

Функция ПроверитьНаНаличиеШК()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод,
	               |	Штрихкоды.Владелец
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Владелец = &Владелец";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец",Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
