#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой инвентарной карточки ОС (форма ОЗ-6)
// Возвращаемое значение:
// Табличный документ - печатная форма инвентарной карточки ОС
Функция ПечатьОЗ6()
	
	Макет                       = ПолучитьМакет("ОЗ6");
	Шапка						= Макет.ПолучитьОбласть("Шапка");
	ШапкаМодернизацииИРемонта	= Макет.ПолучитьОбласть("ШапкаМодернизацииИРемонта");
	СтрокаМодернизацииИРемонта 	= Макет.ПолучитьОбласть("СтрокаМодернизацииИРемонта");
	Подвал						= Макет.ПолучитьОбласть("Подвал");

	ТабДок = Новый ТабличныйДокумент();
	Организация      = Неопределено;
	ДатаСведений     = КонецДня(РабочаяДата);
	
	cВидаУчета   = "Бухгалтерський";
	ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета").Наименование;
	ВидУчета 	 = "Бух";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"    , ДатаСведений);
	Запрос.УстановитьПараметр("СостояниеВвода"  , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Запрос.УстановитьПараметр("СостояниеВыбытия", Перечисления.СостоянияОС.СнятоСУчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОС.Организация                         КАК Организация,
	|	ПервоначальныеСведенияОС.Организация.НаименованиеПолное      КАК ОрганизацияНаименованиеПолное,
	|	ПервоначальныеСведенияОС.Организация.Наименование            КАК ОрганизацияНаименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеПолное,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Наименование       КАК Наименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Модель             КАК Модель,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер                    КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Изготовитель       КАК ИзготовительОС,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ДатаВыпуска        КАК ДатаВыпуска,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость             КАК ПервоначальнаяСтоимость,
	|	ВводВЭксплуатацию.ДатаСостояния                              КАК ДокументВводаВЭксплуатациюДата,
	|	ВводВЭксплуатацию.НомерДокумента                             КАК ДокументВводаВЭксплуатациюНомер,
	|	КодыОрганизации.КодПоЕДРПОУ                                  КАК ЕДРПОУ,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.Местонахождение)                 КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.СчетУчета)                       КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.СчетНачисленияАмортизации)       КАК СчетАмортизации,
	|	ПеремещенияОС.ДатаВыбытия                                    КАК ДокументВыбытияДата,
	|	ПеремещенияОС.НомерДокумента                                 КАК ДокументВыбытияНомер,
	|	ПеремещенияОС.Период                                         КАК Период
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|	                &ДатаСведений, 
	|	                ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ВводВЭксплуатацию.Организация
	|			И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)
	|			И (ВводВЭксплуатацию.ДатаСостояния <= &ДатаСведений)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСведений, ) КАК КодыОрганизации
	|		ПО ПервоначальныеСведенияОС.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				Перемещения.Организация КАК Организация,
	|				Перемещения.ОсновноеСредство КАК ОсновноеСредство,
	|				Перемещения.Местонахождение КАК Местонахождение,
	|				Перемещения.Период КАК Период,
	|				ЕСТЬNULL(Перемещения.ДатаВыбытия, СостоянияОС.ДатаСостояния) КАК ДатаВыбытия,
	|				ВЫБОР
	|					КОГДА Перемещения.ДатаВыбытия ЕСТЬ NULL 
	|						ТОГДА СостоянияОС.НомерДокумента
	|					ИНАЧЕ МестонахождениеОС.Регистратор.Номер
	|				КОНЕЦ КАК НомерДокумента,
	|				СчетаУчетаОС.СчетУчета КАК СчетУчета,
	|				СчетаУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МестонахождениеОС.Организация КАК Организация,
	|					МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|					МестонахождениеОС.Местонахождение КАК Местонахождение,
	|					МестонахождениеОС.Период КАК Период,
	|					МИНИМУМ(МестонахождениеОС1.Период) КАК ДатаВыбытия,
	|					МАКСИМУМ(СчетаУчетаОС.Период) КАК ДатаСчета
	|				ИЗ
	|					РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|						ЛЕВОЕ СОЕДИНЕНИЕ 
	|							РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС1
	|						ПО МестонахождениеОС.Период < МестонахождениеОС1.Период
	|							И МестонахождениеОС.Организация = МестонахождениеОС1.Организация
	|							И МестонахождениеОС.ОсновноеСредство = МестонахождениеОС1.ОсновноеСредство
	|							И (МестонахождениеОС1.Период <= &ДатаСведений)
	|						ЛЕВОЕ СОЕДИНЕНИЕ 
	|							РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|						ПО МестонахождениеОС.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|							И МестонахождениеОС.Организация = СчетаУчетаОС.Организация
	|							И МестонахождениеОС.Период >= СчетаУчетаОС.Период
	|							И (СчетаУчетаОС.Период <= &ДатаСведений)
	|				ГДЕ
	|					МестонахождениеОС.ОсновноеСредство = &ОсновноеСредство
	|					И МестонахождениеОС.Период <= &ДатаСведений
	|			
	|				СГРУППИРОВАТЬ ПО
	|					МестонахождениеОС.Местонахождение,
	|					МестонахождениеОС.Период,
	|					МестонахождениеОС.Организация,
	|					МестонахождениеОС.ОсновноеСредство) КАК Перемещения
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|				ПО Перемещения.ДатаВыбытия = МестонахождениеОС.Период
	|					И Перемещения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|					И Перемещения.Организация = МестонахождениеОС.Организация
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|				ПО Перемещения.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|					И Перемещения.Организация = СостоянияОС.Организация
	|					И (Перемещения.ДатаВыбытия ЕСТЬ NULL )
	|					И (СостоянияОС.Состояние = &СостояниеВыбытия)
	|					И (СостоянияОС.ДатаСостояния <= &ДатаСведений)
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|				ПО Перемещения.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|					И Перемещения.Организация = СчетаУчетаОС.Организация
	|					И Перемещения.ДатаСчета = СчетаУчетаОС.Период) КАК ПеремещенияОС
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ПеремещенияОС.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ПеремещенияОС.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещенияОС.Период";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		СведенияОбОС = Результат.Выбрать();
		ПерваяСтрока = Истина;
		
		Пока СведенияОбОС.Следующий() Цикл
		
			Если ПерваяСтрока Тогда
				
				Шапка.Параметры.Заполнить(СведенияОбОС);
				Шапка.Параметры.НаименованиеОС          = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.НаименованиеПолное),
				СведенияОбОС.Наименование, СведенияОбОС.НаименованиеПолное);
				Шапка.Параметры.ОрганизацияНаименование = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.ОрганизацияНаименованиеПолное),
				СведенияОбОС.ОрганизацияНаименование, СведенияОбОС.ОрганизацияНаименованиеПолное);
				
				СтрокаМодернизацииИРемонта.Параметры.ИнвентарныйНомер = СведенияОбОС.ИнвентарныйНомер;
				Организация                                           = СведенияОбОС.Организация;
				
				ПерваяСтрока = Ложь;
				
				Шапка.Параметры.cВидаУчета = cВидаУчета;
				
				ТабДок.Вывести(Шапка);
				
				СтрокаПеремещения = Макет.ПолучитьОбласть("СтрокаПеремещения");
				СтрокаПеремещения.Параметры.Заполнить(СведенияОбОС);
				
				ТабДок.Вывести(СтрокаПеремещения);
				
			Иначе
				
				СтрокаПеремещения = Макет.ПолучитьОбласть("СтрокаПеремещения");
				СтрокаПеремещения.Параметры.Заполнить(СведенияОбОС);
				
				ТабДок.Вывести(СтрокаПеремещения);
				
			КонецЕсли;	
		
		КонецЦикла;
		
		ПодвалПеремещения = Макет.ПолучитьОбласть("ПодвалПеремещения");
		ТабДок.Вывести(ПодвалПеремещения);
		
	Иначе
		
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На момент печати основное средство <%1> не принималось к учету."
"Нельзя сформировать инвентарную карточку объекта!';uk=""На момент друку основний засіб <%1> не приймався до обліку."
"Не можна сформувати інвентарну картку об'єкта!"""), Наименование),СтатусСообщения.Внимание);
		Возврат Неопределено;
		
	КонецЕсли;
	

	// Модернизация ОС и ремонт
	ТаблицаМодернизаций = Новый ТаблицаЗначений;
	ТаблицаМодернизаций.Колонки.Добавить("Дата");
	ТаблицаМодернизаций.Колонки.Добавить("Номер");
	ТаблицаМодернизаций.Колонки.Добавить("Сумма");
	
	ТаблицаРемонтов = Новый ТаблицаЗначений;
	ТаблицаРемонтов.Колонки.Добавить("Дата");
	ТаблицаРемонтов.Колонки.Добавить("Номер");
	ТаблицаРемонтов.Колонки.Добавить("Сумма");
	
	ШапкаМодернизацииИРемонта.Параметры.cВидаУчета = cВидаУчета;
	ТабДок.Вывести(ШапкаМодернизацииИРемонта);
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ОсновноеСредство"   , Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"       , ДатаСведений);
	Запрос.УстановитьПараметр("УсловиеМодернизаций", Перечисления.ВидыСобытийОС.Модернизация);
	Запрос.УстановитьПараметр("УсловиеРемонтов"    , Перечисления.ВидыСобытийОС.Ремонт);
	Запрос.УстановитьПараметр("ВидОперацииОС"      , Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР КОГДА ОперацииОС.Событие.ВидСобытияОС = (&УсловиеМодернизаций) 
	|		  ТОГДА ОперацииОС.СуммаЗатратБУ ИНАЧЕ 0 КОНЕЦ) КАК СуммаЗатратМодернизаций,
	|	СУММА(ВЫБОР КОГДА ОперацииОС.Событие.ВидСобытияОС = (&УсловиеРемонтов) 
	|		  ТОГДА ОперацииОС.СуммаЗатратБУ ИНАЧЕ 0 КОНЕЦ) КАК СуммаЗатратРемонтов,
	|	ОперацииОС.Регистратор       КАК Регистратор,
	|	ОперацииОС.Период            КАК Период,
	|	ОперацииОС.Событие           КАК Операция,
	|	ОперацииОС.НомерДокумента    КАК НомерДокумента,
	|	ОперацииОС.НазваниеДокумента КАК НазваниеДокумента
	|ИЗ
	|	РегистрСведений.СобытияОСОрганизаций КАК ОперацииОС
	|
	|ГДЕ
	|	ОперацииОС.Событие.ВидСобытияОС <> &ВидОперацииОС
	|	И ОперацииОС.Период < &ДатаСведений
	|	И ОперацииОС.ОсновноеСредство = &ОсновноеСредство
	|	И ОперацииОС.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииОС.Период,
	|	ОперацииОС.Регистратор,
	|	ОперацииОС.Событие,
	|	ОперацииОС.НомерДокумента,
	|	ОперацииОС.НазваниеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор";
	Результат = Запрос.Выполнить();
	
	
	СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкам;
	ВыборкаРегистраторов = Результат.Выбрать(СпособВыборки);
	
	Пока ВыборкаРегистраторов.Следующий() Цикл
		
		СуммаМодернизаций = ВыборкаРегистраторов.СуммаЗатратМодернизаций;
		СуммаРемонтов     = ВыборкаРегистраторов.СуммаЗатратРемонтов;
		
		Если СуммаМодернизаций <> 0 Тогда		
			
			СтрокаТаблицыМодернизаций = ТаблицаМодернизаций.Добавить();
			СтрокаТаблицыМодернизаций.Номер = ВыборкаРегистраторов.НомерДокумента;
			СтрокаТаблицыМодернизаций.Дата  = ВыборкаРегистраторов.Период;
			СтрокаТаблицыМодернизаций.Сумма = СуммаМодернизаций;
			
		КонецЕсли;
		
		Если СуммаРемонтов <> 0 Тогда		
			
			СтрокаТаблицыРемонтов = ТаблицаРемонтов.Добавить();
			СтрокаТаблицыРемонтов.Номер = ВыборкаРегистраторов.НомерДокумента;
			СтрокаТаблицыРемонтов.Дата  = ВыборкаРегистраторов.Период;
			СтрокаТаблицыРемонтов.Сумма = СуммаРемонтов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСтрокМодернизации = ТаблицаМодернизаций.Количество();
	КоличествоСтрокРемонтов     = ТаблицаРемонтов.Количество();
	КоличествоСтрок             = Макс(КоличествоСтрокМодернизации, 
	                                   Окр(КоличествоСтрокРемонтов / 2, 0, РежимОкругления.Окр15как20));
	СчетСтрокРемонтов           = 0;
	
	Для СчетСтрок = 0 По КоличествоСтрок-1 Цикл
		
		// строка модернизации
		Если СчетСтрок < КоличествоСтрокМодернизации Тогда
			
			СтрокаТаблицы = ТаблицаМодернизаций.Получить(СчетСтрок);
			СтрокаМодернизацииИРемонта.Параметры.ДатаМодернизации  = СтрокаТаблицы.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерМодернизации = СтрокаТаблицы.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаМодернизации = СтрокаТаблицы.Сумма; 
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаМодернизации  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерМодернизации = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаМодернизации = ""; 
			
		КонецЕсли;
		
		// первая подстрока ремонта
		Если СчетСтрокРемонтов < КоличествоСтрокРемонтов Тогда
			
			СтрокаМодернизации = ТаблицаРемонтов.Получить(СчетСтрокРемонтов);			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта  = СтрокаМодернизации.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта = СтрокаМодернизации.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта = СтрокаМодернизации.Сумма;
			СчетСтрокРемонтов = СчетСтрокРемонтов + 1;
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта = "";
			
		КонецЕсли;
		
		// вторая подстрока ремонта
		Если СчетСтрокРемонтов < КоличествоСтрокРемонтов Тогда
			
			СтрокаМодернизации = ТаблицаРемонтов.Получить(СчетСтрокРемонтов);
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта1  = СтрокаМодернизации.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта1 = СтрокаМодернизации.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта1 = СтрокаМодернизации.Сумма;
			СчетСтрокРемонтов = СчетСтрокРемонтов + 1;
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта1  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта1 = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта1 = "";
			
		КонецЕсли;
		
		ТабДок.Вывести(СтрокаМодернизацииИРемонта);		
		
	КонецЦикла;
	
	Подвал.Параметры.ДатаЗаполнения = ДатаСведений;
	ТабДок.Вывести(Подвал);		
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева     = 5;
	ТабДок.ПолеСправа    = 5;
	ТабДок.ПолеСверху    = 0;
	ТабДок.ПолеСнизу     = 0;
	ТабДок.ОбластьПечати = ТабДок.Область(2, 2, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);
	ТабДок.ИмяПараметровПечати = "КарточкаОЗ6";
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, , , НСтр("ru='Инвентарная карточка ОС (Форма ОЗ-6)';uk='Інвентарна картка ОЗ (Форма ОЗ-6)'"));
	
КонецФункции // ПечатьОС6_2003() 

// Функция формирует табличный документ с печатной формой инвентарной карточки ОС (2016 р.)
// Возвращаемое значение:
// Табличный документ - печатная форма инвентарной карточки ОС
Функция ПечатьИнвКарточка_2016()
	
	Макет                       = ПолучитьМакет("ПФ_ИнвКарточкаБюдж_2016");
	Шапка						= Макет.ПолучитьОбласть("Шапка");
	СтрокаХарактеристики	 	= Макет.ПолучитьОбласть("ХарактеристикиСтрока");
	ШапкаИзмененияСтоимости		= Макет.ПолучитьОбласть("ИзмененияСтоимостиШапка");
	СтрокаИзмененияСтоимости	= Макет.ПолучитьОбласть("ИзмененияСтоимостиСтрока");
	Подвал						= Макет.ПолучитьОбласть("Подвал");
	Шапка2						= Макет.ПолучитьОбласть("Шапка2");
	СтрокаАмортизации	 		= Макет.ПолучитьОбласть("АмортизацииСтрока");
	ШапкаДвиженияОбъекта		= Макет.ПолучитьОбласть("ДвиженияОбъектаШапка");
	ДвиженияОбъектаСтрока	 	= Макет.ПолучитьОбласть("ДвиженияОбъектаСтрока");
	Подвал2						= Макет.ПолучитьОбласть("Подвал2");
	
	ТабДок = Новый ТабличныйДокумент();
	Организация      = Неопределено;
	ДатаСведений     = КонецДня(РабочаяДата);
	
	cВидаУчета   = "Бухгалтерський";
	ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета").Наименование;
	ВидУчета 	 = "Бух";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"    , ДатаСведений);
	Запрос.УстановитьПараметр("СостояниеВвода"  , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Запрос.УстановитьПараметр("СостояниеВыбытия", Перечисления.СостоянияОС.СнятоСУчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОС.Организация КАК Организация,
	|	ПервоначальныеСведенияОС.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПервоначальныеСведенияОС.Организация.Наименование КАК ОрганизацияНаименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеПолное,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Наименование КАК Наименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Модель КАК Модель,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Изготовитель КАК ИзготовительОС,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НомерПаспорта КАК НомерПаспорта,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ДатаВыпуска КАК ДатаВыпуска,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ВводВЭксплуатацию.ДатаСостояния КАК ДокументВводаВЭксплуатациюДата,
	|	ВводВЭксплуатацию.НомерДокумента КАК ДокументВводаВЭксплуатациюНомер,
	|	КодыОрганизации.КодПоЕДРПОУ КАК ЕДРПОУ,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.Местонахождение) КАК Подразделение,
	|	ПеремещенияОС.СчетУчета КАК СчетУчета,
	|	ПеремещенияОС.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	ПеремещенияОС.ДатаВыбытия КАК ДокументВыбытияДата,
	|	ПеремещенияОС.НомерДокумента КАК ДокументВыбытияНомер,
	|	ПеремещенияОС.Период КАК Период,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокПолезногоИспользования КАК СрокИспользования,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляАмортизации,
	|	ПеремещенияОС.МОЛ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ВводВЭксплуатацию.Организация
	|			И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)
	|			И (ВводВЭксплуатацию.ДатаСостояния <= &ДатаСведений)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСведений, ) КАК КодыОрганизации
	|		ПО ПервоначальныеСведенияОС.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Перемещения.Организация КАК Организация,
	|			Перемещения.ОсновноеСредство КАК ОсновноеСредство,
	|			Перемещения.Местонахождение КАК Местонахождение,
	|			Перемещения.Период КАК Период,
	|			ЕСТЬNULL(Перемещения.ДатаВыбытия, СостоянияОС.ДатаСостояния) КАК ДатаВыбытия,
	|			ВЫБОР
	|				КОГДА Перемещения.ДатаВыбытия ЕСТЬ NULL
	|					ТОГДА СостоянияОС.НомерДокумента
	|				ИНАЧЕ МестонахождениеОС.Регистратор.Номер
	|			КОНЕЦ КАК НомерДокумента,
	|			СчетаУчетаОС.СчетУчета КАК СчетУчета,
	|			СчетаУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	|			Перемещения.МОЛ КАК МОЛ
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МестонахождениеОС.Организация КАК Организация,
	|				МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|				МестонахождениеОС.Местонахождение КАК Местонахождение,
	|				МестонахождениеОС.Период КАК Период,
	|				МИНИМУМ(МестонахождениеОС1.Период) КАК ДатаВыбытия,
	|				МАКСИМУМ(СчетаУчетаОС.Период) КАК ДатаСчета,
	|				МестонахождениеОС.МОЛ КАК МОЛ
	|			ИЗ
	|				РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС1
	|					ПО МестонахождениеОС.Период < МестонахождениеОС1.Период
	|						И МестонахождениеОС.Организация = МестонахождениеОС1.Организация
	|						И МестонахождениеОС.ОсновноеСредство = МестонахождениеОС1.ОсновноеСредство
	|						И (МестонахождениеОС1.Период <= &ДатаСведений)
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|					ПО МестонахождениеОС.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|						И МестонахождениеОС.Организация = СчетаУчетаОС.Организация
	|						И МестонахождениеОС.Период >= СчетаУчетаОС.Период
	|						И (СчетаУчетаОС.Период <= &ДатаСведений)
	|			ГДЕ
	|				МестонахождениеОС.ОсновноеСредство = &ОсновноеСредство
	|				И МестонахождениеОС.Период <= &ДатаСведений
	|			
	|			СГРУППИРОВАТЬ ПО
	|				МестонахождениеОС.Местонахождение,
	|				МестонахождениеОС.Период,
	|				МестонахождениеОС.Организация,
	|				МестонахождениеОС.ОсновноеСредство,
	|				МестонахождениеОС.МОЛ) КАК Перемещения
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|				ПО Перемещения.ДатаВыбытия = МестонахождениеОС.Период
	|					И Перемещения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|					И Перемещения.Организация = МестонахождениеОС.Организация
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|				ПО Перемещения.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|					И Перемещения.Организация = СостоянияОС.Организация
	|					И (Перемещения.ДатаВыбытия ЕСТЬ NULL)
	|					И (СостоянияОС.Состояние = &СостояниеВыбытия)
	|					И (СостоянияОС.ДатаСостояния <= &ДатаСведений)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|				ПО Перемещения.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|					И Перемещения.Организация = СчетаУчетаОС.Организация
	|					И Перемещения.ДатаСчета = СчетаУчетаОС.Период) КАК ПеремещенияОС
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ПеремещенияОС.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ПеремещенияОС.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ПараметрыАмортизацииОСБухгалтерскийУчет.Организация
	|			И (ПараметрыАмортизацииОСБухгалтерскийУчет.Период <= &ДатаСведений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещенияОС.Период";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		СведенияОбОС = Результат.Выбрать();
		ПерваяСтрока = Истина;
		
		Если СведенияОбОС.Следующий() Тогда
			
			Шапка.Параметры.Заполнить(СведенияОбОС);
			Шапка.Параметры.НаименованиеОС          = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.НаименованиеПолное),
			СведенияОбОС.Наименование, СведенияОбОС.НаименованиеПолное);
			Шапка.Параметры.ОрганизацияНаименование = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.ОрганизацияНаименованиеПолное),
			СведенияОбОС.ОрганизацияНаименование, СведенияОбОС.ОрганизацияНаименованиеПолное);
			
			Шапка.Параметры.ЛиквидационнаяСтоимость	= Формат(СведенияОбОС.ЛиквидационнаяСтоимость, "ЧЦ=15; ЧДЦ=2; ЧН=");
			Шапка.Параметры.Модель	 				= СведенияОбОС.НомерПаспорта + ?(ЗначениеЗаполнено(СведенияОбОС.НомерПаспорта) и ЗначениеЗаполнено(СведенияОбОС.Модель),
														", ","") + СведенияОбОС.Модель;
			Шапка.Параметры.ГодВыпуска 				= Формат(СведенияОбОС.ДатаВыпуска, "ДФ=yyyy");
			ДатаВвода                               = Формат(СведенияОбОС.ДокументВводаВЭксплуатациюДата, "ДФ=dd.MM.yyyy");
			Шапка.Параметры.АктВвода 				= ДатаВвода + ", № " + СведенияОбОС.ДокументВводаВЭксплуатациюНомер;
			
			Организация                             = СведенияОбОС.Организация;    
			ПерваяСтрока = Ложь;
			
			ТабДок.Вывести(Шапка); 
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На момент печати основное средство <%1> не принималось к учету."
		"Нельзя сформировать инвентарную карточку объекта!';uk=""На момент друку основний засіб <%1> не приймався до обліку."
		"Не можна сформувати інвентарну картку об'єкта!"""), Наименование),СтатусСообщения.Внимание);
		Возврат Неопределено;
		
	КонецЕсли;
	
	
	//характеристики    
	ТабДок.Вывести(СтрокаХарактеристики);
	
	ТабДок.Вывести(ШапкаИзмененияСтоимости);		
	
	// Модернизация ОС, Переоценка
	ТаблицаМодернизаций = Новый ТаблицаЗначений;
	ТаблицаМодернизаций.Колонки.Добавить("Дата");
	ТаблицаМодернизаций.Колонки.Добавить("Номер");
	ТаблицаМодернизаций.Колонки.Добавить("Сумма");
	
	ТаблицаРемонтов = Новый ТаблицаЗначений;
	ТаблицаРемонтов.Колонки.Добавить("Дата");
	ТаблицаРемонтов.Колонки.Добавить("Номер");
	ТаблицаРемонтов.Колонки.Добавить("Сумма");
	
	спВидОперации = Новый СписокЗначений; 
	спВидОперации.Добавить(Перечисления.ВидыСобытийОС.Модернизация);
	Запрос.УстановитьПараметр("ВидОперации", спВидОперации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетУчета", СведенияОбОС.СчетУчета);
	Запрос.УстановитьПараметр("СчетИзнос", СведенияОбОС.СчетАмортизации);
	Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацииОС.Регистратор КАК Регистратор,
	|	ОперацииОС.Период КАК Период,
	|	ОперацииОС.Событие КАК Операция,
	|	ОперацииОС.НомерДокумента КАК НомерДокумента,
	|	ОперацииОС.Событие.ВидСобытияОС КАК ВидСобытияОС,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаКонечныйОстатокДт, 0) КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИзнос.СуммаКонечныйОстатокКт, 0) КАК Износ,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокПолезногоИспользования КАК СрокИспользования,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляАмортизации
	|ИЗ
	|	РегистрСведений.СобытияОСОрганизаций КАК ОперацииОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|		ПО ОперацииОС.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	|			И ОперацииОС.Организация = ПервоначальныеСведенияОСБухгалтерскийУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|		ПО ОперацииОС.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			И ОперацииОС.Регистратор = ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор
	|			И ОперацииОС.Организация = ПараметрыАмортизацииОСБухгалтерскийУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|				,
	|				&ДатаСведений,
	|				Регистратор,
	|				,
	|				Счет = &СчетУчета,
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстатки
	|		ПО ОперацииОС.Регистратор = ХозрасчетныйОстатки.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|				,
	|				&ДатаСведений,
	|				Регистратор,
	|				,
	|				Счет = &СчетИзнос,
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстаткиИзнос
	|		ПО ОперацииОС.Регистратор = ХозрасчетныйОстаткиИзнос.Регистратор
	|ГДЕ
	|	(ОперацииОС.Событие.ВидСобытияОС В (&ВидОперации)
	|				И ОперацииОС.Регистратор.ВидУлучшения = ЗНАЧЕНИЕ(Перечисление.ВидыУлучшения.Модернизация)
	|				И ОперацииОС.Регистратор ССЫЛКА Документ.МодернизацияОС
	|			ИЛИ ОперацииОС.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|	И ОперацииОС.Период < &ДатаСведений
	|	И ОперацииОС.ОсновноеСредство = &ОсновноеСредство
	|	И ОперацииОС.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииОС.Период,
	|	ОперацииОС.Регистратор,
	|	ОперацииОС.Событие,
	|	ОперацииОС.НомерДокумента,
	|	ОперацииОС.Событие.ВидСобытияОС,
	|	ХозрасчетныйОстатки.СуммаКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИзнос.СуммаКонечныйОстатокКт,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	НПП = 1;
	Пока Выборка.Следующий() Цикл
		
		СтрокаИзмененияСтоимости.Параметры.Заполнить(Выборка);
		СтрокаИзмененияСтоимости.Параметры.Дата = Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		Если Выборка.ВидСобытияОС = Перечисления.ВидыСобытийОС.Модернизация Тогда
			СтрокаИзмененияСтоимости.Параметры.СодержаниеОперации   = НСтр("ru='Модернизация ОС';uk='Модернізація ОЗ'");     
		Иначе
			СтрокаИзмененияСтоимости.Параметры.СодержаниеОперации   = НСтр("ru='Переоценка ОС';uk='Переоцінка ОЗ'");     
		КонецЕсли;
		СтрокаИзмененияСтоимости.Параметры.ЛиквидационнаяСтоимость	= Формат(Выборка.ЛиквидационнаяСтоимость, "ЧЦ=15; ЧДЦ=2; ЧН=");
		СтрокаИзмененияСтоимости.Параметры.НПП 						= НПП;
		ТабДок.Вывести(СтрокаИзмененияСтоимости);
		НПП = НПП +1;
		
	КонецЦикла; 
	Если НПП = 1 Тогда
		ТабДок.Вывести(СтрокаИзмененияСтоимости);
	КонецЕсли;
	
	ТабДок.Вывести(Подвал);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();   
	
	//списание  
	ЗапросСписание = Новый Запрос;
	ЗапросСписание.УстановитьПараметр("ОсновноеСредство", Ссылка);
	ЗапросСписание.УстановитьПараметр("ДатаСведений"    , ДатаСведений);
	ЗапросСписание.УстановитьПараметр("Организация", Организация);
	ЗапросСписание.УстановитьПараметр("СостояниеВыбытия", Перечисления.СостоянияОС.СнятоСУчета);
	ЗапросСписание.Текст = 
	"ВЫБРАТЬ
	|	СостоянияОСОрганизаций.НомерДокумента КАК НомерДокумента,
	|	СостоянияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
	|	СостоянияОСОрганизаций.ДатаСостояния КАК ДатаСостояния,
	|	СобытияОСОрганизаций.Событие.Представление КАК Причина
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	|		ПО СостоянияОСОрганизаций.ОсновноеСредство = СобытияОСОрганизаций.ОсновноеСредство
	|			И СостоянияОСОрганизаций.Регистратор = СобытияОСОрганизаций.Регистратор
	|ГДЕ
	|	СостоянияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
	|	И СостоянияОСОрганизаций.Организация = &Организация
	|	И СостоянияОСОрганизаций.ДатаСостояния <= &ДатаСведений
	|	И СостоянияОСОрганизаций.Состояние = &СостояниеВыбытия"; 
	
	РезультатСписания = ЗапросСписание.Выполнить();  
	ВыборкаСписание = РезультатСписания.Выбрать();
	Если ВыборкаСписание.Следующий() Тогда
		Шапка2.Параметры.ДатаСписания = Формат(ВыборкаСписание.ДатаСостояния, "ДФ=dd.MM.yyyy");
	КонецЕсли; 
	ВыборкаСписание.Сбросить();
	Шапка2.Параметры.ДатаВводаВЭксплуатацию = ДатаВвода;  
	ТабДок.Вывести(Шапка2);  
	
	//Амортизация
	Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросПоАмортизации.ОС КАК ОС,
	|	ЗапросПоАмортизации.Период КАК Период,
	|	ЗапросПоАмортизации.СуммаОборотКт КАК АмортизацияБУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОбороты.Субконто1 КАК ОС,
	|		СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
	|		ХозрасчетныйОбороты.Период КАК Период
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ДатаСведений,
	|				Месяц,
	|				Счет = &СчетИзнос,
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 = &ОсновноеСредство,
	|				КорСчет <> &СчетУчета,
	|				) КАК ХозрасчетныйОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОбороты.Период,
	|		ХозрасчетныйОбороты.Субконто1) КАК ЗапросПоАмортизации
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросПоАмортизации.ОС,
	|	ЗапросПоАмортизации.СуммаОборотКт,
	|	ЗапросПоАмортизации.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ИндексСтроки = 0;
	НомерЗаписи = 0;  
	Пока Выборка.Следующий() Цикл
		
		ИндексСтроки = ИндексСтроки + 1;	
		НомерЗаписи = НомерЗаписи + 1;
		
		Если ИндексСтроки = 4 Тогда 
			ТабДок.Вывести(СтрокаАмортизации);
			ИндексСтроки = 1;		
			СтрокаАмортизации = Макет.ПолучитьОбласть("АмортизацииСтрока");
		КонецЕсли;   
		
		СтрокаАмортизации.Параметры["НПП" + Строка(ИндексСтроки)] = НомерЗаписи;
		СтрокаАмортизации.Параметры["ПериодАмортизации" + Строка(ИндексСтроки)] = Формат(Выборка.Период,"ДФ='MMMM yyyy'");
		СтрокаАмортизации.Параметры["ИспользованоМес" + Строка(ИндексСтроки)] = 1; 
		СтрокаАмортизации.Параметры["Сумма" + Строка(ИндексСтроки)] = Выборка.АмортизацияБУ;	
		
	КонецЦикла;
	
	ТабДок.Вывести(СтрокаАмортизации);
	
	ТабДок.Вывести(ШапкаДвиженияОбъекта);
	
	//внутреннее перемещение
	Запрос.УстановитьПараметр("ОсновноеСредство"   , Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"       , ДатаСведений);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	Запрос.УстановитьПараметр("ВидСобытияОС"       , Перечисления.ВидыСобытийОС.ВнутреннееПеремещение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияОСОрганизаций.Период КАК Период,
	|	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
	|	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК МестоХранения,
	|	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
	|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	|		ПО СобытияОСОрганизаций.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	|			И СобытияОСОрганизаций.Регистратор = МестонахождениеОСБухгалтерскийУчет.Регистратор
	|ГДЕ
	|	СобытияОСОрганизаций.Период < &ДатаСведений
	|	И СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
	|	И СобытияОСОрганизаций.Организация = &Организация
	|	И СобытияОСОрганизаций.Событие.ВидСобытияОС = &ВидСобытияОС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"; 
	
	Результат = Запрос.Выполнить();
	
	НПП = 1;
	ВыборкаПеремещение = Результат.Выбрать();
	Пока ВыборкаПеремещение.Следующий() Цикл
		
		ДвиженияОбъектаСтрока.Параметры.Заполнить(ВыборкаПеремещение);
		ДвиженияОбъектаСтрока.Параметры.Дата 		= Формат(ВыборкаПеремещение.Период, "ДФ=dd.MM.yyyy");
		ДвиженияОбъектаСтрока.Параметры.НПП 		= НПП;
		ТабДок.Вывести(ДвиженияОбъектаСтрока);		
		НПП = НПП +1;
		
	КонецЦикла; 
	
	Если ВыборкаСписание.Следующий() Тогда
		Подвал2.Параметры.Заполнить(ВыборкаСписание); 
		Подвал2.Параметры.ДатаВыбытия	= Формат(ВыборкаСписание.ДатаСостояния, "ДФ=dd.MM.yyyy");
		Подвал2.Параметры.Документ		= СокрЛП(ВыборкаСписание.НазваниеДокумента) + " № " + ВыборкаСписание.НомерДокумента;
	КонецЕсли;
	
	Если НПП = 1 Тогда
		ТабДок.Вывести(ДвиженияОбъектаСтрока);
	КонецЕсли;
	
	Подвал2.Параметры.Дата = Формат(ДатаСведений, "ДЛФ=ДД");
	ТабДок.Вывести(Подвал2);		
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева     = 5;
	ТабДок.ПолеСправа    = 5;
	ТабДок.ПолеСверху    = 0;
	ТабДок.ПолеСнизу     = 0;
	ТабДок.ОбластьПечати = ТабДок.Область(2, 2, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);
	ТабДок.ИмяПараметровПечати = "ИнвКарточкаБюдж";
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, , , НСтр("ru=""Инвентарная карточка учета объекта основных средств"";uk=""Інвентарна картка обліку об’єкта основних засобів"""));
	
КонецФункции  

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура осуществляет печать справочника. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
// Параметры:
//  НазваниеМакета - строка, название макета.
// Возвращаемое значение:
//  Нет.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, ФормаЭлемента = Неопределено) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ6" тогда
		
		ТабДокумент = ПечатьОЗ6();   
		
	ИначеЕсли ИмяМакета = "ИнвКарточкаБюдж" тогда
		
		ТабДокумент = ПечатьИнвКарточка_2016();   
		
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, НСтр("ru='Инвентарная карточка ОС (Форма ОЗ-6)';uk='Інвентарна картка ОЗ (Форма ОЗ-6)'"));

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати справочника.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
		Возврат Новый Структура("ОЗ6, ИнвКарточкаБюдж",
	                        НСтр("ru='Форма ОЗ-6';uk='Форма ОЗ-6'"),                                                                                   
	                        НСтр("ru=""Инвентарная карточка учета объекта основных средств"";uk=""Інвентарна картка обліку об’єкта основних засобів"""));


КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.Наименование;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры
