#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит структуру многостраничных разделов
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ РегламентированныйОтчет,
// хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//  требуется редакция по наименованиям ПолейТабличныхДокументов
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);


мСтруктураВариантыЗаполнения      = Новый Структура;

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);


НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14'");
НоваяФорма.ДатаНачалоДействия = '2015-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-11-30';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14 (в редакции приказа Минфина от 26.09.2016 г. N 841)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14 (у редакції наказу Мінфина від 26.09.2016 р. N 841)'");
НоваяФорма.ДатаНачалоДействия = '2016-12-01';
НоваяФорма.ДатаКонецДействия  = '2017-06-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14 (в редакции приказа Минфина от 26.09.2016 г. N 841, с изменениями согласно приказа Минфина от 24.04.2017 г. №451)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14 (у редакції наказу Мінфіна від 26.09.2016 р. N 841 зі змінами згідно наказу Мінфіну від 24.04.2017 г. №451)'");
НоваяФорма.ДатаНачалоДействия = '2017-07-01';
НоваяФорма.ДатаКонецДействия  = '2019-07-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2019";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказа Минфина от 24.04.2017г. №451 и от 08.05.2019г. №189)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказів Мінфіну від 24.04.2017р. №451 та від 08.05.2019р. №189)'");
НоваяФорма.ДатаНачалоДействия = '2019-08-01';
НоваяФорма.ДатаКонецДействия  = '2021-02-28';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2021";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.15 №14 (в редакции приказа Минфина от 26.09.16г. №841, с изменениями согласно приказа Минфина от 08.12.20г. №747)'; uk = 'Затверджена наказом Мінфіна від 23.01.15 №14 (у редакції наказу Мінфіна від 26.09.16р. №841, зі змінами згідно наказу Мінфіну від 08.12.20р. №747)'");
НоваяФорма.ДатаНачалоДействия = '2021-03-01';
НоваяФорма.ДатаКонецДействия  = '2022-07-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2022";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказа Минфина от 31.05.2022г. №151)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказу Мінфіну від 31.05.2022р. №151)'");
НоваяФорма.ДатаНачалоДействия = '2022-08-01';
НоваяФорма.ДатаКонецДействия  = '2023-10-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2023";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказов Минфина от 28.07.2023г. №414 и от 18.08.2023г. №444)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказів Мінфіну від 28.07.2023р. №414 та від 18.08.2023р. №444)'");
НоваяФорма.ДатаНачалоДействия = '2023-11-01';
НоваяФорма.ДатаКонецДействия  = '2024-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2025";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказа Минфина от 07.11.2024г. №567)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказу Мінфіна від 07.11.2024р. №567)'");
НоваяФорма.ДатаНачалоДействия = '2025-01-01';
НоваяФорма.ДатаКонецДействия  = '2025-04-30';  

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2025Мес5";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказа Минфина от 11.04.2025г. №195)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказу Мінфіна від 11.04.2025р. №195)'");
НоваяФорма.ДатаНачалоДействия = '2025-05-01';
НоваяФорма.ДатаКонецДействия  = '2025-06-30';  

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2025Мес7";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016г. №841, с изменениями согласно приказов Минфина от 05.06.2025 №291, от 24.06.2025 №319)';uk='Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016р. №841, зі змінами згідно наказів Мінфіна від 05.06.2025 №291, від 24.06.2025 №319)'");
НоваяФорма.ДатаНачалоДействия = '2025-07-01';
НоваяФорма.ДатаКонецДействия  = '2026-01-31';  

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2026Мес2";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом Минфина от 23.01.2015 №14 (в редакции приказа Минфина от 26.09.2016 №841, с изменениями согласно приказов Минфина от 05.06.2025 №291, от 24.06.2025 №319, от 07.11.2024 №567)';uk='Затверджена наказом Мінфіна від 23.01.2015 №14 (у редакції наказу Мінфіна від 26.09.2016 №841, зі змінами згідно наказів Мінфіна від 05.06.2025 №291, від 24.06.2025 №319, від 07.11.2024 №567)'");
НоваяФорма.ДатаНачалоДействия = '2026-02-01';
НоваяФорма.ДатаКонецДействия  = Неопределено;

#КонецЕсли
