
// ================ ПРОЦЕДУРЫ ОБМЕНА ДАННЫМИ С СИСТЕМОЙ WMS ========================

// Процедура формирует справочную информацию по товарам в формате Json
//
Процедура ВыгрузитьТоварыВLogisticonWMS(СписокТоваров) Экспорт

	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Код КАК PROD_NR,
	               |	Номенклатура.Наименование КАК PROD_NAME,
	               |	ВЫБОР
	               |		КОГДА Номенклатура.ЕдиницаХраненияОстатков.Наименование ПОДОБНО ""%пак%"" 
				   |			ИЛИ Номенклатура.ЕдиницаХраненияОстатков.Наименование ПОДОБНО ""%туб%""
	               |			ТОГДА ""уп""
	               |		ИНАЧЕ Номенклатура.ЕдиницаХраненияОстатков.Наименование
	               |	КОНЕЦ КАК BASE_UNIT,
	               |	Номенклатура.Артикул КАК PROD_NR_ERP,
	               |	""1"" КАК PART,
	               |	""0"" КАК PIC_PRIORITY,
	               |	ЕСТЬNULL(ШКТовара.Штрихкод, """") КАК EAN,
	               |	0 КАК PRICE,
	               |	"""" КАК INFO,
	               |	ЕСТЬNULL(Номенклатура.Родитель.Код, """") КАК PROD_GROUP
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				Штрихкоды.Владелец КАК Владелец,
	               |				МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	               |				Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |			ИЗ
	               |				РегистрСведений.Штрихкоды КАК Штрихкоды
	               |			ГДЕ
	               |				Штрихкоды.Владелец В ИЕРАРХИИ(&Номенклатура)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Штрихкоды.Владелец,
	               |				Штрихкоды.ХарактеристикаНоменклатуры) КАК ШКХарактеристики
	               |			ПО ХарактеристикиНоменклатуры.Ссылка = ШКХарактеристики.ХарактеристикаНоменклатуры
	               |		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Штрихкоды.Владелец КАК Владелец,
	               |			МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
	               |		ИЗ
	               |			РегистрСведений.Штрихкоды КАК Штрихкоды
	               |		ГДЕ
	               |			Штрихкоды.Владелец В ИЕРАРХИИ(&Номенклатура)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Штрихкоды.Владелец) КАК ШКТовара
	               |		ПО Номенклатура.Ссылка = ШКТовара.Владелец
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура",СписокТоваров);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("items");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатЗапроса.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Если СтрокаКолонка.Имя = "BASE_UNIT" Тогда 
				Если Найти(ЗначениеКолонки,".") <> 0 Тогда 
					ЗначениеКолонки	= СтрЗаменить(ЗначениеКолонки,".","");
				КонецЕсли;
				Если Найти(ЗначениеКолонки,",") <> 0 Тогда 
					ЗначениеКолонки	= СтрЗаменить(ЗначениеКолонки,",","");
				КонецЕсли;
			КонецЕсли;
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда 
					Сообщить("Ошибка записи файла товаров по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJS = ЗаписьJSON.Закрыть();

	ОтправитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLТоваров,СтруктураПодключения.GUID,СтрокаJS,СписокТоваров);	
	
КонецПроцедуры

// Процедура формирует справочную информацию по клиентам в формате Json
//
Процедура ВыгрузитьКлиентовLogisticonWMS(Контрагенты) Экспорт
	
	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Контрагенты.Код КАК FIRM_NR,
	               |	Контрагенты.Наименование КАК NAME,
	               |	""1"" КАК IS_OWNER,
	               |	ЕСТЬNULL(КИАдрес.Адрес,"""") КАК ADDRESS,
	               |	"""" КАК INFO,
	               |	"""" КАК EMAIL,
	               |	ЕСТЬNULL(КИТелефон.Телефон,"""") КАК PHONE,
	               |	"""" КАК IS_INPUT,
	               |	""1"" КАК IS_OUTPUT,
	               |	"""" КАК INFO2
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КонтактнаяИнформация.Объект КАК Объект,
	               |			МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(200))) КАК Адрес
	               |		ИЗ
	               |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ГДЕ
	               |			КонтактнаяИнформация.Объект В(&Контрагенты)
	               |			И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КонтактнаяИнформация.Объект) КАК КИАдрес
	               |		ПО Контрагенты.Ссылка = КИАдрес.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КонтактнаяИнформация.Объект КАК Объект,
	               |			МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(200))) КАК Телефон
	               |		ИЗ
	               |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ГДЕ
	               |			КонтактнаяИнформация.Объект В(&Контрагенты)
	               |			И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КонтактнаяИнформация.Объект) КАК КИТелефон
	               |		ПО Контрагенты.Ссылка = КИТелефон.Объект
	               |ГДЕ
	               |	Контрагенты.Ссылка В(&Контрагенты)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагенты",Контрагенты);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("items");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатЗапроса.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Если СтрокаКолонка.Имя = "PHONE" Тогда 
				ЗначениеКолонки = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ЗначениеКолонки," ",""),Символы.НПП,""),"+",""),"-","");	
				ЗначениеКолонки = СтрЗаменить(СтрЗаменить(ЗначениеКолонки,"(",""),")","");
				ЗначениеКолонки = СтрЗаменить(СтрЗаменить(ЗначениеКолонки,",","")," ","");
				ЗначениеКолонки = СтрЗаменить(СтрЗаменить(ЗначениеКолонки,"Юля",""),"бухгалтерія","");
				ЗначениеКолонки = СокрЛП(ЗначениеКолонки);
			КонецЕсли;
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда
					Сообщить("Ошибка записи файла контрагентов отгрузки по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJS = ЗаписьJSON.Закрыть();
	
	ОтправитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLКонтрагентов,СтруктураПодключения.GUID,СтрокаJS,Контрагенты);
	
КонецПроцедуры

// Процедура выгружает документы приемки в формате Json
//
Процедура ВыгрузитьДокументыПриемкиLogisticonWMS(Регистратор,ДатаДок,СтатусВыгрузки = "") Экспорт

	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();

	ТекстЗапроса = "ВЫБРАТЬ
	               |	""ВТ_"" + ВозвратТоваровОтПокупателя.Номер + ""_"" КАК ORDER_NR,
	               |	ЕСТЬNULL(ВозвратТоваровОтПокупателя.Контрагент.Код, """") КАК FIRM_ID,
	               |	ЕСТЬNULL(ВозвратТоваровОтПокупателя.Контрагент.Наименование, """") КАК FIRM_NAME,
	               |	ВозвратТоваровОтПокупателя.Дата КАК DELIV_DATE,
	               |	""1"" КАК SQ,
	               |	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.Комментарий КАК СТРОКА(200)) КАК INFO,
	               |	"""" КАК DOCK,
	               |	"""" КАК DELIV_POST,
	               |	"""" КАК TRACK_NUMBER
	               |ПОМЕСТИТЬ Основная
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	               |ГДЕ
	               |	ВозвратТоваровОтПокупателя.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ПТ_"" + ПоступлениеТоваровУслуг.Номер + ""_"",
	               |	ЕСТЬNULL(ПоступлениеТоваровУслуг.Контрагент.Код, """"),
	               |	ЕСТЬNULL(ПоступлениеТоваровУслуг.Контрагент.Наименование, """"),
	               |	ПоступлениеТоваровУслуг.Дата,
	               |	""1"",
	               |	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.Комментарий КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	""""
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ОТ_"" + ОприходованиеТоваров.Номер + ""_"",
	               |	""001234567"",
	               |	ЕСТЬNULL(ОприходованиеТоваров.Организация.Наименование, """"),
	               |	ОприходованиеТоваров.Дата,
	               |	""1"",
	               |	ВЫРАЗИТЬ(ОприходованиеТоваров.Комментарий КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	""""
	               |ИЗ
	               |	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	               |ГДЕ
	               |	ОприходованиеТоваров.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Основная.ORDER_NR + &Год КАК ORDER_NR,
	               |	Основная.FIRM_ID КАК FIRM_ID,
	               |	Основная.FIRM_NAME КАК FIRM_NAME,
	               |	Основная.DELIV_DATE КАК DELIV_DATE,
	               |	Основная.SQ КАК SQ,
	               |	Основная.INFO КАК INFO,
	               |	Основная.DOCK КАК DOCK,
	               |	Основная.DELIV_POST КАК DELIV_POST,
	               |	Основная.TRACK_NUMBER КАК TRACK_NUMBER
	               |ИЗ
	               |	Основная КАК Основная";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Регистратор);
	Запрос.УстановитьПараметр("Год",СтрЗаменить(Год(ДатаДок),Символы.НПП,""));
	РезультатШапка = Запрос.Выполнить().Выгрузить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВозвратТоваровОтПокупателяТовары.Количество КАК BU_QUANTITY,
	               |	ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Номенклатура.Код, """") КАК PROD_NR,
	               |	ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.Номенклатура.Наименование, """") КАК PROD_NAME,
	               |	ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры.СерийныйНомер, """") КАК PART_NR,
	               |	"""" КАК INFO,
	               |	ВозвратТоваровОтПокупателяТовары.Цена КАК PRICE
	               |ПОМЕСТИТЬ Основная
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |ГДЕ
	               |	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.Количество,
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.Код, """"),
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.Наименование, """"),
	               |	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.СерияНоменклатуры.СерийныйНомер, """"),
	               |	"""",
	               |	ПоступлениеТоваровУслугТовары.Цена
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОприходованиеТоваровТовары.Количество,
	               |	ЕСТЬNULL(ОприходованиеТоваровТовары.Номенклатура.Код, """"),
	               |	ЕСТЬNULL(ОприходованиеТоваровТовары.Номенклатура.Наименование, """"),
	               |	ЕСТЬNULL(ОприходованиеТоваровТовары.СерияНоменклатуры.СерийныйНомер, """"),
	               |	"""",
	               |	ОприходованиеТоваровТовары.Цена
	               |ИЗ
	               |	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	               |ГДЕ
	               |	ОприходованиеТоваровТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Основная.BU_QUANTITY) КАК BU_QUANTITY,
	               |	Основная.PROD_NR КАК PROD_NR,
	               |	Основная.PROD_NAME КАК PROD_NAME,
	               |	Основная.PART_NR,
	               |	СУММА(Основная.PRICE) КАК PRICE,
	               |	Основная.INFO КАК INFO
	               |ИЗ
	               |	Основная КАК Основная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Основная.INFO,
	               |	Основная.PROD_NR,
	               |	Основная.PROD_NAME,
	               |	Основная.PART_NR";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Регистратор);
	РезультатТЧ = Запрос.Выполнить().Выгрузить();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("header");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатШапка Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатШапка.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Если СтрокаКолонка.Имя = "DELIV_DATE" Тогда 
				Если ЗначениеЗаполнено(СтрокаРезультат[СтрокаКолонка.Имя]) Тогда 
					ЗначениеКолонки = Формат(СтрокаРезультат[СтрокаКолонка.Имя],"ДФ='yyyy-MM-dd HH:mm:ss'");
				КонецЕсли;
			КонецЕсли;
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда
					Сообщить("Ошибка записи файла документа приемки по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("items");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатТЧ Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатТЧ.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда
					Сообщить("Ошибка записи файла документа приемки по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJS = ЗаписьJSON.Закрыть();
	
	ОтветСервера = ОтправитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLДокументовПриемки,СтруктураПодключения.GUID,СтрокаJS,Регистратор,Истина,СтатусВыгрузки);
	
КонецПроцедуры

// Процедура выгружает документы отгрузки в формате Json
//
Процедура ВыгрузитьДокументыОтгрузкиLogisticonWMS(Регистратор,ДатаДок,СтатусВыгрузки = "",ДопЗаказ = Неопределено) Экспорт

	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();

	Приоритет = 0;
	Если ДопЗаказ <> Неопределено Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.ОсновнойЗаказ = &ОсновнойЗаказ";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ОсновнойЗаказ",ДопЗаказ);
		РезультатДопЗаказ = Запрос.Выполнить().Выгрузить();
		
		Приоритет = РезультатДопЗаказ.Количество();
		
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	""ВП_"" + ВозвратТоваровПоставщику.Номер + ""_"" КАК ORDER_NR,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.Код, """") КАК FIRM_ID,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.Наименование, """") КАК FIRM_NAME,
	               |	ВозвратТоваровПоставщику.Дата КАК SHIP_DATE,
	               |	"""" КАК ADDRESS,
	               |	""1"" КАК SQ,
	               |	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.Комментарий КАК СТРОКА(200)) КАК INFO,
	               |	"""" КАК DOCK,
	               |	"""" КАК DELIV_POST,
	               |	"""" КАК TRACK_NUMBER
	               |ПОМЕСТИТЬ Основная
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	               |ГДЕ
	               |	ВозвратТоваровПоставщику.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""РТ_"" + РеализацияТоваровУслуг.Номер + ""_"",
	               |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.Код, """"),
	               |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.Наименование, """"),
	               |	РеализацияТоваровУслуг.Дата,
	               |	"""",
	               |	""1"",
	               |	ВЫРАЗИТЬ(РеализацияТоваровУслуг.Комментарий КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	""""
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""СТ_"" + СписаниеТоваров.Номер + ""_"",
	               |	""001234567"",
	               |	ЕСТЬNULL(СписаниеТоваров.Организация.Наименование, """"),
	               |	СписаниеТоваров.Дата,
	               |	"""",
	               |	""1"",
	               |	ВЫРАЗИТЬ(СписаниеТоваров.Комментарий КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	""""
	               |ИЗ
	               |	Документ.СписаниеТоваров КАК СписаниеТоваров
	               |ГДЕ
	               |	СписаниеТоваров.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""РТ_"" + ЗаказПокупателя.Номер + ""_"",
	               |	ЕСТЬNULL(ЗаказПокупателя.Контрагент.Код, """"),
	               |	ЕСТЬNULL(ЗаказПокупателя.Контрагент.Наименование, """"),
	               |	ЗаказПокупателя.Дата,
	               |	"""",
	               |	""1"",
	               |	ВЫРАЗИТЬ(ЗаказПокупателя.Комментарий КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	""""
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Основная.ORDER_NR + &Год КАК ORDER_NR,
	               |	Основная.FIRM_ID КАК FIRM_ID,
	               |	Основная.FIRM_NAME КАК FIRM_NAME,
	               |	Основная.SHIP_DATE КАК SHIP_DATE,
	               |	Основная.ADDRESS КАК ADDRESS,
	               |	Основная.SQ КАК SQ,
	               |	Основная.INFO КАК INFO,
	               |	"""" КАК INFO1,
	               |	Основная.DOCK КАК DOCK,
	               |	Основная.DELIV_POST КАК DELIV_POST,
	               |	Основная.TRACK_NUMBER КАК TRACK_NUMBER,
	               |	&Приоритет КАК PICK_PRIORITY
	               |ИЗ
	               |	Основная КАК Основная";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Регистратор);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	Запрос.УстановитьПараметр("Год",СтрЗаменить(Год(ДатаДок),Символы.НПП,""));
	РезультатШапка = Запрос.Выполнить().Выгрузить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуТовары.Количество КАК BU_QUANTITY,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Номенклатура.Код, """") КАК PROD_NR,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Номенклатура.Наименование, """") КАК PROD_NAME,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СерийныйНомер, """") КАК PART_NR,
	               |	"""" КАК INFO,
	               |	ВозвратТоваровПоставщикуТовары.Цена КАК PRICE
	               |ПОМЕСТИТЬ Основная
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Количество,
	               |	ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Код, """"),
	               |	ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Наименование, """"),
	               |	ЕСТЬNULL(РеализацияТоваровУслугТовары.СерияНоменклатуры.СерийныйНомер, """"),
	               |	"""",
	               |	РеализацияТоваровУслугТовары.Цена
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеТоваровТовары.Количество,
	               |	ЕСТЬNULL(СписаниеТоваровТовары.Номенклатура.Код, """"),
	               |	ЕСТЬNULL(СписаниеТоваровТовары.Номенклатура.Наименование, """"),
	               |	ЕСТЬNULL(СписаниеТоваровТовары.СерияНоменклатуры.СерийныйНомер, """"),
	               |	"""",
	               |	СписаниеТоваровТовары.Цена
	               |ИЗ
	               |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	               |ГДЕ
	               |	СписаниеТоваровТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Основная.BU_QUANTITY) КАК BU_QUANTITY,
	               |	Основная.PROD_NR КАК PROD_NR,
	               |	Основная.PART_NR,
	               |	Основная.PRICE КАК PRICE,
	               |	Основная.INFO КАК INFO
	               |ИЗ
	               |	Основная КАК Основная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Основная.INFO,
	               |	Основная.PROD_NR,
	               |	Основная.PRICE,
	               |	Основная.PROD_NAME,
	               |	Основная.PART_NR";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Регистратор);
	РезультатТЧ = Запрос.Выполнить().Выгрузить();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("header");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатШапка Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатШапка.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Если СтрокаКолонка.Имя = "FIRM_NAME" Или СтрокаКолонка.Имя = "INFO" Тогда
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки,"+","");	
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки,"\","");
				ЗначениеКолонки = СтрЗаменить(ЗначениеКолонки,"/","");
			КонецЕсли;
			Если СтрокаКолонка.Имя = "SHIP_DATE" Тогда 
				Если ЗначениеЗаполнено(СтрокаРезультат[СтрокаКолонка.Имя]) Тогда 
					ЗначениеКолонки = Формат(СтрокаРезультат[СтрокаКолонка.Имя],"ДФ='yyyy-MM-dd HH:mm:ss'");
				КонецЕсли;
			КонецЕсли;
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда
					Сообщить("Ошибка записи файла документа отгрузки по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("items");
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаРезультат Из РезультатТЧ Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого СтрокаКолонка Из РезультатТЧ.Колонки Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(СтрокаКолонка.Имя);
			ЗначениеКолонки = СтрокаРезультат[СтрокаКолонка.Имя];
			Попытка
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеКолонки);
			Исключение 
				#Если Клиент Тогда
					Сообщить("Ошибка записи файла документа отгрузки по колонке: " + СтрокаКолонка.Имя);
				#КонецЕсли
			КонецПопытки;
		КонецЦикла;	
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJS = ЗаписьJSON.Закрыть();
	
	ОтветСервера = ОтправитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLДокументовОтгрузки,СтруктураПодключения.GUID,СтрокаJS,Регистратор,Истина,СтатусВыгрузки);
	
КонецПроцедуры

// Процедура получает статусы по документам выгруженным в WMS
//
Процедура ПолучитьСтатусыДокументовLogisticonWMS(Регистратор) Экспорт
	
	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();
	
	Если ТипЗнч(Регистратор) = Тип("Массив") Тогда 
		Для Каждого СтрокаРегистратор Из Регистратор Цикл
			ПрефиксДокумента = ПолучитьПрефиксДокумента(СтрокаРегистратор);
			НомерДокумента = ПрефиксДокумента + СтрокаРегистратор.Номер + "_" + СтрЗаменить(Год(СтрокаРегистратор.Дата),Символы.НПП,"");
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
				Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
				СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента);
			Иначе
				СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента);
			КонецЕсли;			
			ЗаписатьСтатусыДокументовWMS(СтрокаРегистратор,СтрокаJS);		
		КонецЦикла;
	Иначе
		ПрефиксДокумента = ПолучитьПрефиксДокумента(Регистратор);
		НомерДокумента = ПрефиксДокумента + Регистратор.Номер + "_" + СтрЗаменить(Год(Регистратор.Дата),Символы.НПП,"");
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
			Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
			СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента);
		Иначе
			СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента);
		КонецЕсли;
		ЗаписатьСтатусыДокументовWMS(Регистратор,СтрокаJS);	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура получает фактический статус по документу выгруженному в WMS
//
Процедура ПолучитьФактическиеСтатусыДокументаLogisticonWMS(Регистратор) Экспорт
	
	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();
	
	Если ТипЗнч(Регистратор) = Тип("Массив") Тогда 
		Для Каждого СтрокаРегистратор Из Регистратор Цикл
			ПрефиксДокумента = ПолучитьПрефиксДокумента(СтрокаРегистратор);
			НомерДокумента = ПрефиксДокумента + СтрокаРегистратор.Номер + "_" + СтрЗаменить(Год(СтрокаРегистратор.Дата),Символы.НПП,"");
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
				Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
				СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента,Истина);
			Иначе
				СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента,Истина);
			КонецЕсли;			
			ЗаписатьСтатусыДокументовWMS(СтрокаРегистратор,СтрокаJS);		
		КонецЦикла;
	Иначе
		ПрефиксДокумента = ПолучитьПрефиксДокумента(Регистратор);
		НомерДокумента = ПрефиксДокумента + Регистратор.Номер + "_" + СтрЗаменить(Год(Регистратор.Дата),Символы.НПП,"");
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
			Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
			СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента,Истина);
		Иначе
			СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента,Истина);
		КонецЕсли;
		ЗаписатьСтатусыДокументовWMS(Регистратор,СтрокаJS);	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура получает фактические статусы по документам выгруженным в WMS
//
Процедура ПолучитьФактическиеСтатусыДокументовLogisticonWMS(НачалоПериода = Неопределено,КонецПериода = Неопределено) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	WMSСтатусыДокументовСрезПервых.Объект
	               |ИЗ
	               |	РегистрСведений.WMSСтатусыДокументов.СрезПервых КАК WMSСтатусыДокументовСрезПервых
	               |ГДЕ
	               |	WMSСтатусыДокументовСрезПервых.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда 
		Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата() - (86400 * 3)));
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		ПолучитьФактическиеСтатусыДокументаLogisticonWMS(СтрокаРезультат.Объект);		
	КонецЦикла;
		
КонецПроцедуры

// Функция получает остатки товаров на текущую дату в WMS
//
Функция ПолучитьТЗОстаткиWMS() Экспорт
	
	СтруктураПодключения = ПолучитьДанныеПодключенияКWMS();
	СтрокаJS = ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОстатков,СтруктураПодключения.GUID,,Истина);
	СтруктураJS = ПолучитьСтруктуруJSON(СтрокаJS);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодТовара");
	ТЗ.Колонки.Добавить("НомерПартии");
	ТЗ.Колонки.Добавить("ДатаИзготовления");
	ТЗ.Колонки.Добавить("СрокГодности");
	ТЗ.Колонки.Добавить("СтатусКачества");
	ТЗ.Колонки.Добавить("КоличествоОстаток");
	ТЗ.Колонки.Добавить("НомерПоПорядку");

	ТЗ.Индексы.Добавить("КодТовара");
	
	Для Каждого СтрокаМассива Из СтруктураJS.items Цикл
		НС = ТЗ.Добавить();
		НС.КодТовара = СтрокаМассива.prod_nr;
		НС.НомерПартии = СтрокаМассива.part_nr;
		НС.ДатаИзготовления = СтрокаМассива.date_prod;
		НС.СрокГодности = СтрокаМассива.date_expire;
		НС.СтатусКачества = СтрокаМассива.sq;
		НС.КоличествоОстаток = СтрокаМассива.qty;
		НС.НомерПоПорядку = СтрокаМассива.rn;
	КонецЦикла;

	Возврат ТЗ;
	
КонецФункции

// Функция перезаписывает документы согласно данным WMS
//
Процедура ПерезаписатьДокументыСогласноWMS(НачалоПериода = Неопределено,КонецПериода = Неопределено) Экспорт
	
	Если Не Константы.WMSКорректироватьДокументы.Получить() Тогда 
		Возврат;	
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	WMSСтатусыДокументовСрезПервых.Объект
	               |ИЗ
	               |	РегистрСведений.WMSСтатусыДокументов.СрезПервых КАК WMSСтатусыДокументовСрезПервых
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.WMSОтгруженныеДокументы КАК WMSОтгруженныеДокументы
	               |		ПО WMSСтатусыДокументовСрезПервых.Объект = WMSОтгруженныеДокументы.Объект
	               |ГДЕ
	               |	WMSСтатусыДокументовСрезПервых.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И WMSОтгруженныеДокументы.Объект ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда
		Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата() - (86400 * 4)));
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		Если Не ЗначениеЗаполнено(СтрокаРезультат.Объект) Тогда 
			Продолжить;	
		КонецЕсли;
		ФиксацияЗакрытыхДокументовWMS(СтрокаРезультат.Объект);	
	КонецЦикла;	
	
КонецПроцедуры

// Процедура изменяет содержимое документа согласно данным WMS
//
Процедура ФиксацияЗакрытыхДокументовWMS(Док) Экспорт
	
	// 1.Получим структуру подключения
	СтруктураПодключения = WMSОбменыИнформацией.ПолучитьДанныеПодключенияКWMS();
	
	// 2.Определим номер документа
	ПрефиксДокумента = WMSОбменыИнформацией.ПолучитьПрефиксДокумента(Док);
	НомерДокумента = ПрефиксДокумента + Док.Номер + "_" + СтрЗаменить(Год(Док.Дата),Символы.НПП,"");
	
	// 3.Получим строку JSON со статусом документа
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента);
	КонецЕсли;

	// 4.Обработка идет только по статусу FI
	Если Найти(СтрокаJS,"FI") = 0 Тогда 
		Возврат;
	КонецЕсли;

	// 5.Получим строку JSON с информацией по собранным товарам
	СтрокаJS = "";
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаПриемки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаОтгрузки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	КонецЕсли;
	
	// 6.Преобразуем строку JSON в СписокЗначений	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJS);
	Результат = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	// 7.Создадим ТЗ для заполнения со списка JSON
	ТЗJSON = Новый ТаблицаЗначений;
	ТЗJSON.Колонки.Добавить("prod_nr");
	ТЗJSON.Колонки.Добавить("part_nr");
	ТЗJSON.Колонки.Добавить("bu_quantity");
	ТЗJSON.Колонки.Добавить("info");
	
	// 8.Заполним данными списка ранее созданную тз
	Попытка
		Попытка
			Для Каждого СтрокаСписка Из Результат.items.items Цикл
				НС = ТЗJSON.Добавить();
				ЗаполнитьЗначенияСвойств(НС,СтрокаСписка);
			КонецЦикла;
		Исключение 
			Если ЗначениеЗаполнено(Результат.items.items.prod_nr) И ЗначениеЗаполнено(Результат.items.items.bu_quantity) Тогда 
				НС = ТЗJSON.Добавить();
				НС.prod_nr = Результат.items.items.prod_nr;
				НС.bu_quantity = Результат.items.items.bu_quantity;
				НС.info = "";
			КонецЕсли;
		КонецПопытки;
	Исключение 
		Возврат;
	КонецПопытки;
	ТЗJSON.Индексы.Добавить("prod_nr");
	
	// 9.Получим данные по товарам документа
	ТЗ = WMSОбменыИнформацией.ПолучитьДанныеПоТоварамДок(Док);  
	ТЗ.Индексы.Добавить("Номенклатура");
	
	ДокОбъект = Док.ПолучитьОбъект();
	ТЗТовары = ДокОбъект.Товары.Выгрузить();
	
	//ДокОбъект.Товары.Очистить();
	
	НЗ = РегистрыСведений.WMSОтгруженныеДокументы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Док);
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Для Каждого СтрокаТЧ Из ТЗТовары Цикл
		
		НСРег = НЗ.Добавить();
		НСРег.Период = ТекущаяДата();
		НСРег.Объект = Док;
		НСРег.Номенклатура = СтрокаТЧ.Номенклатура; 
		НСРег.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
		НСРег.СерияНоменклатуры = СтрокаТЧ.СерияНоменклатуры;
		НСРег.КоличествоДо = СтрокаТЧ.Количество;
		
		// 1.Определим код товара в wms
		КодТовараWMS = "";
		ИскомаяСтрока = ТЗ.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
		Если ИскомаяСтрока = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		КоличествоДо = 0;
		Комментарий = "";
		// 2.Найдем фактически отгруженный товар
		ИскомаяСтрокаФакт = ТЗJSON.Найти(ИскомаяСтрока.part_nr.СерийныйНомер,"part_nr");
		Если ИскомаяСтрокаФакт = Неопределено Тогда 
			ИскомаяСтрокаФакт = ТЗJSON.Найти(ИскомаяСтрока.PROD_NR,"prod_nr");
		КонецЕсли;
		Если ИскомаяСтрокаФакт <> Неопределено Тогда 
			КоличествоДо = СтрокаТЧ.Количество;
			СтрокаТЧ.Количество = ИскомаяСтрокаФакт.bu_quantity;
			Комментарий = ИскомаяСтрокаФакт.info;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.Количество <= 0 Тогда 
			Продолжить;	
		КонецЕсли;
		
		//// 3.Заполним тч товары заказа
		//НС = ДокОбъект.Товары.Добавить();
		//ЗаполнитьЗначенияСвойств(НС,СтрокаТЧ);
		//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НС, ДокОбъект);
		//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НС, ДокОбъект);

		НСРег.КоличествоПосле = СтрокаТЧ.Количество;
		НСРег.ОписаниеСборки = Комментарий;
		
	КонецЦикла;
	
	Если НЗ.Количество() > 0 Тогда 
		НЗ.Записать();
	КонецЕсли;
	
	//Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") 
	//	Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
	//	Попытка
	//		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	Исключение 
	//		Возврат;	
	//	КонецПопытки;
	//КонецЕсли;

КонецПроцедуры

// Процедура изменяет содержимое документа согласно данным WMS
//
Процедура ОбработкаДокументаВWMS(Док) Экспорт
	
	// 1.Получим структуру подключения
	СтруктураПодключения = WMSОбменыИнформацией.ПолучитьДанныеПодключенияКWMS();
	
	// 2.Определим номер документа
	ПрефиксДокумента = WMSОбменыИнформацией.ПолучитьПрефиксДокумента(Док);
	НомерДокумента = ПрефиксДокумента + Док.Номер + "_" + СтрЗаменить(Год(Док.Дата),Символы.НПП,"");
	
	// 3.Получим строку JSON со статусом документа
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента);
	КонецЕсли;

	// 4.Обработка идет только по статусу FI
	Если Найти(СтрокаJS,"FI") = 0 Тогда 
		Возврат;
	КонецЕсли;

	// 5.Получим строку JSON с информацией по собранным товарам
	СтрокаJS = "";
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаПриемки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаОтгрузки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	КонецЕсли;
	
	// 6.Преобразуем строку JSON в СписокЗначений	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJS);
	Результат = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	// 7.Создадим ТЗ для заполнения со списка JSON
	ТЗJSON = Новый ТаблицаЗначений;
	ТЗJSON.Колонки.Добавить("prod_nr");
	ТЗJSON.Колонки.Добавить("bu_quantity");
	ТЗJSON.Колонки.Добавить("info");
	
	// 8.Заполним данными списка ранее созданную тз
	Попытка
		Для Каждого СтрокаСписка Из Результат.items.items Цикл
			НС = ТЗJSON.Добавить();
			ЗаполнитьЗначенияСвойств(НС,СтрокаСписка);
		КонецЦикла;
	Исключение 
		Возврат;
	КонецПопытки;
	ТЗJSON.Индексы.Добавить("prod_nr");
	
	// 9.Получим данные по товарам документа
	ТЗ = WMSОбменыИнформацией.ПолучитьДанныеПоТоварамДок(Док);  
	ТЗ.Индексы.Добавить("Номенклатура");
	
	ДокОбъект = Док.ПолучитьОбъект();
	ТЗТовары = ДокОбъект.Товары.Выгрузить();
	
	ДокОбъект.Товары.Очистить();
	
	НЗ = РегистрыСведений.WMSОтгруженныеДокументы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Док);
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Для Каждого СтрокаТЧ Из ТЗТовары Цикл
		
		НСРег = НЗ.Добавить();
		НСРег.Период = ТекущаяДата();
		НСРег.Объект = Док;
		НСРег.Номенклатура = СтрокаТЧ.Номенклатура; 
		НСРег.ХарактеристикаНоменклатуры = СтрокаТЧ.ХарактеристикаНоменклатуры;
		НСРег.КоличествоДо = СтрокаТЧ.Количество;
		
		// 1.Определим код товара в wms
		КодТовараWMS = "";
		ИскомаяСтрока = ТЗ.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
		Если ИскомаяСтрока = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		КоличествоДо = 0;
		Комментарий = "";
		// 2.Найдем фактически отгруженный товар
		ИскомаяСтрокаФакт = ТЗJSON.Найти(ИскомаяСтрока.PROD_NR,"prod_nr");
		Если ИскомаяСтрокаФакт <> Неопределено Тогда 
			КоличествоДо = СтрокаТЧ.Количество;
			СтрокаТЧ.Количество = ИскомаяСтрокаФакт.bu_quantity;
			Комментарий = ИскомаяСтрокаФакт.info;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.Количество <= 0 Тогда 
			Продолжить;	
		КонецЕсли;
		
		// 3.Заполним тч товары заказа
		НС = ДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,СтрокаТЧ);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НС, ДокОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НС, ДокОбъект);
		 
		НСРег.КоличествоПосле = СтрокаТЧ.Количество;
		НСРег.ОписаниеСборки = Комментарий;
		
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Если НЗ.Количество() > 0 Тогда 
			НЗ.Записать();
		КонецЕсли;
	Исключение 
		Возврат;	
	КонецПопытки;
	
	// Если текущий документ это заказ, тогда нужно изменить расходную накладную по нему
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.Ссылка
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |ГДЕ
		               |	РеализацияТоваровУслуг.Сделка = &Сделка";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Сделка",Док);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			РНОбъект = РезультатЗапроса[0].Ссылка.ПолучитьОбъект();
			ТЗТоварыРН = РНОбъект.Товары.Выгрузить();
			РНОбъект.Товары.Очистить();
			Для Каждого СтрокаТЧ Из ТЗТоварыРН Цикл
				ИскомыеСтроки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаТЧ.Номенклатура,СтрокаТЧ.ХарактеристикаНоменклатуры));
				Для Каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
					НС = РНОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаТЧ);
					НС.Количество = ИскомаяСтрока.Количество;
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НС, РНОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НС, РНОбъект);
				КонецЦикла;
			КонецЦикла;
			Попытка
				РНОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение 
				НЗ = РегистрыСведений.WMSОтгруженныеДокументы.СоздатьНаборЗаписей();
				НЗ.Отбор.Объект.Установить(Док);
				НЗ.Прочитать();
				НЗ.Очистить();
	            НЗ.Записать();
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает документ перемещения согласно данным WMS
//
Процедура СоздатьПеремещенияПоКачествуТовараWMS(НачалоПериодаПарам = "",КонецПериодаПарам = "") Экспорт
	
	// 1.Получим структуру подключения
	СтруктураПодключения = WMSОбменыИнформацией.ПолучитьДанныеПодключенияКWMS();
	
	Если Не ЗначениеЗаполнено(НачалоПериодаПарам) И Не ЗначениеЗаполнено(КонецПериодаПарам) Тогда 
		НачалоПериода = НачалоДня(ТекущаяДата()) - (86400 * 7);
		КонецПериода = КонецДня(ТекущаяДата())+1;
	Иначе
		НачалоПериода = НачалоПериодаПарам;
		КонецПериода = КонецПериодаПарам;	
	КонецЕсли;
	
	НачПериода = Формат(НачалоПериода,"ДФ=dd-MM-yyyy");
	КонПериода = Формат(КонецПериода,"ДФ=dd-MM-yyyy");
		
	URLСтатусОстатков = "/ords/project/whs-services/sq_changes/" + СтруктураПодключения.GUID + "/" + НачПериода + "/" + КонПериода;
	СтрокаJS = ПолучитьДанныеМетодомGet(СтруктураПодключения.АдресСервера,URLСтатусОстатков);	
	СтруктураJS = WMSОбменыИнформацией.ПолучитьСтруктуруJSON(СтрокаJS);
	
	КоличествоСтрок = 0;
	Попытка
		КоличествоСтрок = СтруктураJS.items.Количество();
	Исключение 		
	КонецПопытки;
	
	Если КоличествоСтрок = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТЗJSON = ПолучитьТЗСоСтруктурыJSON(СтруктураJS);
	ТЗJSON.Индексы.Добавить("oper_date");
	
	ТЗСклады = ПолучитьСкладыWMS();
	
	ТЗТовары = ПолучитьТовары();
	ТЗТовары.Индексы.Добавить("КодНоменклатуры,СерийныйНомер");
	
	ТЗПеремещения = ПолучитьПеремещенияТоваровПоКачеству(НачалоПериода,КонецПериода);
	ТЗПеремещения.Индексы.Добавить("ДатаТранзакцииWMS");
	
	ТЗ = ТЗJSON.Скопировать();
	ТЗ.Свернуть("oper_date,sq_from,sq_to");
	
	ОсновнаяОрганизация = СПравочники.Организации.НайтиПоКоду("000000001");
	Для Каждого СтрокаСтруктуры Из ТЗ Цикл
		
		// 1.Найдем ранее созданные перемещения по полю oper_date
		ИскомаяСтрока = ТЗПеремещения.Найти(СокрЛП(СтрокаСтруктуры.oper_date),"ДатаТранзакцииWMS");
		Если ИскомаяСтрока <> Неопределено Тогда 
			Продолжить;	
		КонецЕсли;
		
		// 2.Создадим новый документ перемещения
		ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
		ДокОбъект.Организация = ОсновнаяОрганизация;
		ДокОбъект.ДатаТранзакцииWMS = СокрЛП(СтрокаСтруктуры.oper_date);
		ДокОбъект.СозданWMS = Истина;
		ДокОбъект.ОтражатьВУправленческомУчете = Истина;
		ДокОбъект.ОтражатьВБухгалтерскомУчете = Истина;
		ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Комментарий = "Создан системой WMS";
				
		ИскомаяСтрока = ТЗСклады.Найти(Строка(СтрокаСтруктуры.sq_from),"WMSСтатусы");
		Если ИскомаяСтрока <> Неопределено Тогда 
			ДокОбъект.СкладОтправитель = ИскомаяСтрока.Склад;
		КонецЕсли;
		
		ИскомаяСтрока = ТЗСклады.Найти(Строка(СтрокаСтруктуры.sq_to),"WMSСтатусы");
		Если ИскомаяСтрока <> Неопределено Тогда
			ДокОбъект.СкладПолучатель = ИскомаяСтрока.Склад;
		КонецЕсли;
		
		// 3.Заполним товарами	
		ИскомыеСтроки = ТЗJSON.НайтиСтроки(Новый Структура("oper_date,sq_from,sq_to",СтрокаСтруктуры.oper_date,СтрокаСтруктуры.sq_from,СтрокаСтруктуры.sq_to));
		Для Каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
			
			ИскСтроки = ТЗТовары.НайтиСтроки(Новый Структура("КодНоменклатуры,СерийныйНомер",ИскомаяСтрока.prod_nr,ИскомаяСтрока.part_nr));
			Если ИскомыеСтроки.Количество() = 0 Тогда 
				Продолжить;	
			КонецЕсли;

			НС = ДокОбъект.Товары.Добавить();
			НС.Номенклатура = ИскСтроки[0].Номенклатура;
			НС.СерияНоменклатуры = ИскСтроки[0].СерияНоменклатуры;
			НС.Количество = ИскомаяСтрока.qty;
			НС.КоличествоМест = ИскомаяСтрока.qty;
			НС.ЕдиницаИзмерения = НС.Номенклатура.ЕдиницаХраненияОстатков;
			НС.ЕдиницаИзмеренияМест = НС.ЕдиницаИзмерения;
			НС.Коэффициент = НС.ЕдиницаИзмерения.Коэффициент;
			НС.Качество = Справочники.Качество.Новый;
			
			//заполняем счета учета по умолчанию для склада
			ДокОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НС, "Товары", Истина, Истина);
			
		КонецЦикла;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция создает перемещения согласно данным WMS
//
Процедура СоздатьПеремещенияСогласноWMS(НачПериода = Неопределено,КонПериода = Неопределено) Экспорт
	
	Если Не Константы.WMSСоздаватьПеремещениеПоСтатусам.Получить() Тогда 
		Возврат;	
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	Склады.WMSСтатусы
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	Склады.WMSСтатусы <> """"";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ТЗСклады = Запрос.Выполнить().Выгрузить();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	WMSСтатусыДокументовСрезПервых.Объект,
	               |	WMSСтатусыДокументовСрезПервых.Обработан
	               |ИЗ
	               |	РегистрСведений.WMSСтатусыДокументов.СрезПервых КАК WMSСтатусыДокументовСрезПервых
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.WMSОтгруженныеДокументы КАК WMSОтгруженныеДокументы
	               |		ПО WMSСтатусыДокументовСрезПервых.Объект = WMSОтгруженныеДокументы.Объект
	               |ГДЕ
	               |	WMSСтатусыДокументовСрезПервых.Объект.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				   //|	И WMSОтгруженныеДокументы.Объект ЕСТЬ NULL
	               |	И НЕ WMSСтатусыДокументовСрезПервых.Обработан";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Если НачПериода <> Неопределено И КонПериода <> Неопределено Тогда
		Запрос.УстановитьПараметр("НачалоПериода",НачПериода);
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонПериода));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата() - (86400 * 7)));
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		Если Не ЗначениеЗаполнено(СтрокаРезультат.Объект) Тогда 
			Продолжить;	
		КонецЕсли;
		ДокументОбработан = Ложь;
		ОбработатьДокумент(СтрокаРезультат.Объект,ТЗСклады,ДокументОбработан);	
		Если ДокументОбработан Тогда
			НЗ = РегистрыСведений.WMSСтатусыДокументов.СоздатьНаборЗаписей();
			НЗ.Отбор.Объект.Установить(СтрокаРезультат.Объект);
			НЗ.Прочитать();
			Для Каждого СтрокаНЗ Из НЗ Цикл
				СтрокаНЗ.Обработан = Истина;	
			КонецЦикла;
			НЗ.Записать();
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Процедура обрабатывает содержимое документа согласно данным WMS
//
Процедура ОбработатьДокумент(Док,ТЗСклады,ДокументОбработан=Ложь) Экспорт
	
	// 1.Получим структуру подключения
	СтруктураПодключения = WMSОбменыИнформацией.ПолучитьДанныеПодключенияКWMS();
	
	// 2.Определим номер документа
	ПрефиксДокумента = WMSОбменыИнформацией.ПолучитьПрефиксДокумента(Док);
	НомерДокумента = ПрефиксДокумента + Док.Номер + "_" + СтрЗаменить(Год(Док.Дата),Символы.НПП,"");
	
	// 3.Получим строку JSON со статусом документа
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусПриемки,СтруктураПодключения.GUID,НомерДокумента);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLСтатусОтгрузки,СтруктураПодключения.GUID,НомерДокумента);
	КонецЕсли;

	// 4.Обработка идет только по статусу FI
	Если Найти(СтрокаJS,"FI") = 0 Тогда 
		Возврат;
	КонецЕсли;

	СкладДокумента = Справочники.Склады.ПустаяСсылка();
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		СкладДокумента = Док.СкладОрдер;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкладДокумента) Тогда 
		Возврат;	
	КонецЕсли;
	
	// 5.Получим строку JSON с информацией по собранным товарам
	СтрокаJS = "";
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		Или ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаПриемки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	Иначе
		СтрокаJS = WMSОбменыИнформацией.ПолучитьДанныеJSON(СтруктураПодключения.АдресСервера,СтруктураПодключения.URLФактаОтгрузки,СтруктураПодключения.GUID,НомерДокумента,Истина);
	КонецЕсли;
	
	// 6.Преобразуем строку JSON в СписокЗначений	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJS);
	Результат = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	// 7.Создадим ТЗ для заполнения со списка JSON
	ТЗJSON = Новый ТаблицаЗначений;
	ТЗJSON.Колонки.Добавить("prod_nr");
	ТЗJSON.Колонки.Добавить("part_nr");
	ТЗJSON.Колонки.Добавить("bu_quantity");
	ТЗJSON.Колонки.Добавить("info");
	ТЗJSON.Колонки.Добавить("sq");
	ТЗJSON.Колонки.Добавить("Склад");
	
	ПустойСклад = Справочники.Склады.ПустаяСсылка();
	
	// 8.Заполним данными списка ранее созданную тз
	Попытка
		Попытка
			Для Каждого СтрокаСписка Из Результат.items.items Цикл
				НС = ТЗJSON.Добавить();
				ЗаполнитьЗначенияСвойств(НС,СтрокаСписка);
				НС.Склад = ПустойСклад;
				ИскомаяСтрока = ТЗСклады.Найти(Строка(СтрокаСписка.sq),"WMSСтатусы");
				Если ИскомаяСтрока <> Неопределено Тогда 
					НС.Склад = ИскомаяСтрока.Склад;	
				КонецЕсли;
			КонецЦикла;
		Исключение 
			Если ЗначениеЗаполнено(Результат.items.items.prod_nr) И ЗначениеЗаполнено(Результат.items.items.bu_quantity) Тогда 
				НС = ТЗJSON.Добавить();
				НС.prod_nr = Результат.items.items.prod_nr;
				НС.bu_quantity = Результат.items.items.bu_quantity;
				НС.part_nr = Результат.items.items.part_nr;
				НС.info = "";
				НС.sq = Результат.items.items.sq;
				НС.Склад = ПустойСклад;
				ИскомаяСтрока = ТЗСклады.Найти(Строка(Результат.items.items.sq),"WMSСтатусы");
				Если ИскомаяСтрока <> Неопределено Тогда 
					НС.Склад = ИскомаяСтрока.Склад;	
				КонецЕсли;
			КонецЕсли;
		КонецПопытки;
	Исключение 
		Возврат;
	КонецПопытки;
	ТЗJSON.Индексы.Добавить("prod_nr");
	
	// 9.Получим данные по товарам документа
	ТЗ = WMSОбменыИнформацией.ПолучитьДанныеПоТоварамДляПеремещения(Док);  
	ТЗ.Индексы.Добавить("Номенклатура");
	
	ДокОбъект = Док.ПолучитьОбъект();
	ТЗТовары = ДокОбъект.Товары.Выгрузить();
	
	ТЗКачество = ТЗJSON.Скопировать();
	ТЗКачество.Свернуть("sq,Склад");
		
	Для Каждого СтрокаТЗ Из ТЗКачество Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Склад) Тогда 
			Продолжить;	
		КонецЕсли;
		
		ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
		// Заполнение шапки
		ДокОбъект.ОтражатьВУправленческомУчете = Док.ОтражатьВУправленческомУчете;
		ДокОбъект.ОтражатьВБухгалтерскомУчете  = Док.ОтражатьВБухгалтерскомУчете;		
		ДокОбъект.Организация                  = Док.Организация;
		ДокОбъект.Ответственный                = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Подразделение                = Док.Подразделение;
		ДокОбъект.Комментарий                  = Док.Комментарий;
		ДокОбъект.ДокументОснование			   = Док;
		ДокОбъект.СкладОтправитель 			   = СкладДокумента;
		ДокОбъект.СкладПолучатель 			   = СтрокаТЗ.Склад;
		ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;		
		ДокОбъект.Дата = Док.Дата + 1;
		
		ИскомыеСтроки = ТЗJSON.НайтиСтроки(Новый Структура("sq",СтрокаТЗ.sq));
		Для Каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
			
			ИскомыеСтрокиТовар = ТЗ.НайтиСтроки(Новый Структура("КодТовара,НомерПартии",ИскомаяСтрока.prod_nr,ИскомаяСтрока.part_nr));
			Если ИскомыеСтрокиТовар.Количество() = 0 Тогда 
				НомерПартииПреобразованный = ПреобразоватьНомерПартииАнгл(ИскомаяСтрока.part_nr);
				ИскомыеСтрокиТовар = ТЗ.НайтиСтроки(Новый Структура("КодТовара,НомерПартии",ИскомаяСтрока.prod_nr,НомерПартииПреобразованный));
				Если ИскомыеСтрокиТовар.Количество() = 0 Тогда
					НомерПартииПреобразованный = ПреобразоватьНомерПартииРус(НомерПартииПреобразованный);
					ИскомыеСтрокиТовар = ТЗ.НайтиСтроки(Новый Структура("КодТовара,НомерПартии",ИскомаяСтрока.prod_nr,НомерПартииПреобразованный));
					Если ИскомыеСтрокиТовар.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НС = ДокОбъект.Товары.Добавить();
			НС.Номенклатура = ИскомыеСтрокиТовар[0].Номенклатура;
			НС.Количество = ИскомаяСтрока.bu_quantity;
			НС.ХарактеристикаНоменклатуры = ИскомыеСтрокиТовар[0].ХарактеристикаНоменклатуры;
			НС.СерияНоменклатуры 		  = ИскомыеСтрокиТовар[0].СерияНоменклатуры;
			НС.ЕдиницаИзмерения           = ИскомыеСтрокиТовар[0].ЕдиницаИзмерения;
			НС.ЕдиницаИзмеренияМест       = ИскомыеСтрокиТовар[0].ЕдиницаИзмеренияМест;
			НС.КоличествоМест             = ИскомыеСтрокиТовар[0].КоличествоМест;
			НС.Коэффициент                = ИскомыеСтрокиТовар[0].Коэффициент;
 			НС.Качество                   = ИскомыеСтрокиТовар[0].Качество;
			
			//заполняем счета учета по умолчанию для склада
			ДокОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НС, "Товары", Истина, Истина);
			
			НС.НалоговоеНазначение		   = ИскомыеСтрокиТовар[0].НалоговоеНазначение;			
			НС.СчетУчетаБУ				   = ИскомыеСтрокиТовар[0].СчетУчетаБУ;	
				
		КонецЦикла;
		
		ДокОбъект.ЗаполнитьРозничнуюЦену();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);

		ДокументОбработан = Истина;
		
	КонецЦикла;
		
КонецПроцедуры

// ================== ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ===========================

// Функция получает данные подключения к WMS
//
Функция ПолучитьДанныеПодключенияКWMS() Экспорт
	
	СтруктураПодключения = Новый Структура;
	СтруктураПодключения.Вставить("АдресСервера",			Константы.WMSАдресСервера.Получить());
	СтруктураПодключения.Вставить("GUID",					Константы.WMSGUID.Получить());
	СтруктураПодключения.Вставить("URLТоваров",				Константы.WMSURLТоваров.Получить());
	СтруктураПодключения.Вставить("URLКонтрагентов",		Константы.WMSURLКонтрагентов.Получить());
	СтруктураПодключения.Вставить("URLДокументовПриемки",	Константы.WMSURLДокументовПриемки.Получить());
	СтруктураПодключения.Вставить("URLДокументовОтгрузки",	Константы.WMSURLДокументовОтгрузки.Получить());
	СтруктураПодключения.Вставить("URLФактаПриемки",		Константы.WMSURLФактаПриемки.Получить());
	СтруктураПодключения.Вставить("URLФактаОтгрузки",		Константы.WMSURLФактаОтгрузки.Получить());
	СтруктураПодключения.Вставить("URLСтатусПриемки",		Константы.WMSURLСтатусПриемки.Получить());
	СтруктураПодключения.Вставить("URLСтатусОтгрузки",		Константы.WMSURLСтатусОтгрузки.Получить());
	СтруктураПодключения.Вставить("URLСтатусОстатков",		Константы.WMSURLСтатусОстатков.Получить());
	
	Возврат СтруктураПодключения;

КонецФункции

// Функция отправляет Json данные методом Post
//
Функция ОтправитьДанныеJSON(Адрес,Url,Guid,СтрокаJS,Объект,ЭтоДокумент = Ложь,СтатусВыгрузки = "") Экспорт
	
	Попытка
        ssl = Новый ЗащищенноеСоединениеOpenSSL();
        HTTPСоединение = Новый HTTPСоединение(Адрес,,,,,,ssl);
    Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось соединиться с " + Адрес);
		#КонецЕсли
        Возврат Неопределено;
    КонецПопытки;
	
	//создаем запрос данных методом POST
	ЗапросPOST = Новый HTTPЗапрос(Url + Guid);
	ЗапросPOST.Заголовки.Вставить("Content-Type", "application/json");
	ЗапросPOST.УстановитьТелоИзСтроки(СтрокаJS,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Попытка
		
		ФайлОтвета = ПолучитьИмяВременногоФайла();
		HTTPСоединение.ОтправитьДляОбработки(ЗапросPOST, ФайлОтвета);
		ТекстовыйФайлОтвет = Новый ТекстовыйДокумент;
		ТекстовыйФайлОтвет.Прочитать(ФайлОтвета,КодировкаТекста.UTF8);
		ОтветСервера = ТекстовыйФайлОтвет.ПолучитьТекст();
		
		СтатусВыгрузки = ОтветСервера; 
		
		Если ТипЗнч(Объект) = Тип("Массив") Тогда 
			Для Каждого СтрокаОбъекта Из Объект Цикл
				ЗаписатьИнформациюПоВыгрузкеОбъекта(СтрокаОбъекта,СтрокаJS,ОтветСервера,ЭтоДокумент);		
			КонецЦикла;
		Иначе
			ЗаписатьИнформациюПоВыгрузкеОбъекта(Объект,СтрокаJS,ОтветСервера,ЭтоДокумент);	
		КонецЕсли;
				
	Исключение
		#Если Клиент Тогда 
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;	
		
КонецФункции

// Функция получает Json данные методом Get
//
Функция ПолучитьДанныеJSON(Адрес,Url,Guid,НомерДокумента = "",ЭтоФакт = Ложь) Экспорт
	
	Попытка
	    ssl = Новый ЗащищенноеСоединениеOpenSSL();
	    HTTPСоединение = Новый HTTPСоединение(Адрес,,,,,,ssl);
	Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось соединиться с " + Адрес);
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	Если НомерДокумента = "" Тогда
		ЗапросUrl = Url + Guid;
	Иначе
		ЗапросUrl = Url + Guid + "/" + СокрЛП(НомерДокумента);
	КонецЕсли;
	Запрос = Новый HTTPЗапрос(ЗапросUrl);
	ФайлОтвета = ПолучитьИмяВременногоФайла();
	Ответ = HTTPСоединение.Получить(Запрос, ФайлОтвета);
	ТекстовыйФайлОтвет = Новый ТекстовыйДокумент;
	ТекстовыйФайлОтвет.Прочитать(ФайлОтвета,КодировкаТекста.UTF8);
	ОтветСервера = ТекстовыйФайлОтвет.ПолучитьТекст();	
	
	Если Не ЭтоФакт Тогда 
		Если Ответ.КодСостояния = 200 И Найти(ОтветСервера,"status") <> 0 Тогда 
			Возврат Сред(ОтветСервера,Найти(ОтветСервера,"status")+9,2); 
		ИначеЕсли Ответ.КодСостояния = 200 И Найти(ОтветСервера,"c_order_nr") <> 0 Тогда 
			Возврат "Документ выгружен успешно";	
		Иначе
			Возврат "Документ не выгружен";
		КонецЕсли;
	Иначе
		Возврат ОтветСервера;	
	КонецЕсли;
	
КонецФункции

// Функция получает префикс документа 
//
Функция ПолучитьПрефиксДокумента(СтрокаРегистратор) Экспорт
	
	Если ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		Возврат "ПТ_";
	ИначеЕсли ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		Возврат "ОТ_";
	ИначеЕсли ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		Возврат "ВТ_";
	ИначеЕсли ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		Или ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат "РТ_";
	ИначеЕсли ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Возврат "ВП_";
	ИначеЕсли ТипЗнч(СтрокаРегистратор) = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		Возврат "СТ_";
	КонецЕсли;
	
КонецФункции

// Процедура записи информации по выгрузке объектов в WMS
//
Процедура ЗаписатьИнформациюПоВыгрузкеОбъекта(Объект,СтрокаJS,ОтветСервера,ЭтоДокумент)
	
	НЗ = РегистрыСведений.WMSВыгруженныеОбъекты.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Объект);
	НЗ.Прочитать();
	Если НЗ.Количество() = 0 Тогда 
		НС = НЗ.Добавить();
		НС.Период = ТекущаяДата();
		НС.Объект = Объект;
		НС.ДатаВыгрузки = ТекущаяДата();
		Попытка
			НС.СтрокаJSON = СтрокаJS;
		Исключение КонецПопытки;
		НС.СтатусОтправки = ОтветСервера;
	КонецЕсли;
	НЗ.Записать();
	
	Если ЭтоДокумент Тогда 
		НЗ = РегистрыСведений.WMSСтатусыДокументов.СоздатьНаборЗаписей();
		НЗ.Отбор.Объект.Установить(Объект);
		НЗ.Прочитать();
		Если НЗ.Количество() > 0 Тогда 
			Возврат;
		Иначе
			НС = НЗ.Добавить();
			НС.Период = ТекущаяДата();
			НС.Объект = Объект;
			НС.СтатусПриОтправке = ОтветСервера;
		КонецЕсли;
		НЗ.Записать();		
	КонецЕсли;
	
КонецПроцедуры

// Процедура записи информации по статусам документов в WMS
//
Процедура ЗаписатьСтатусыДокументовWMS(Объект,СтрокаJS) Экспорт
	
	Если СтрДлина(СтрокаJS) > 5000 Тогда 
		Возврат;	
	КонецЕсли;
	
	НЗ = РегистрыСведений.WMSСтатусыДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Объект);
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда 
		НЗ[0].ТекущийСтатусWMS = СтрокаJS;
		Если Найти(СтрокаJS,"FI") > 0 Тогда 
			НЗ[0].ОписаниеСтатуса = "(Finished) - замовлення закрито в системі WMS";
		ИначеЕсли Найти(СтрокаJS,"OK") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "(Okay) - замовлення передано на склад";
		ИначеЕсли Найти(СтрокаJS,"AC") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "(Active) - замовлення активовано на збірку";
		ИначеЕсли Найти(СтрокаJS,"PC") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "(Picked) - замовлення зібрано комплектувальником і доставлено до місця видачі клієнтам";
		ИначеЕсли Найти(СтрокаJS,"PICK") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "(Pick) - замовлення в процесі збірки";
		ИначеЕсли Найти(СтрокаJS,"DL") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "замовлення доставлено";
		ИначеЕсли Найти(СтрокаJS,"SH") > 0 Тогда
			НЗ[0].ОписаниеСтатуса = "замовлення відвантажено в маршруті";
		КонецЕсли;
		НЗ.Записать();
	КонецЕсли;		
	
Конецпроцедуры

// Функция получает данные по товарам документа
//
Функция ПолучитьДанныеПоТоварамДляПеремещения(Док) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Док.Количество КАК BU_QUANTITY,
				   |	Док.Номенклатура КАК Номенклатура,
				   |	Док.СерияНоменклатуры КАК СерияНоменклатуры,
				   |	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				   |	Док.СерияНоменклатуры КАК part_nr,
				   |	Док.Номенклатура.Код КАК КодТовара,
				   |	Док.СерияНоменклатуры.СерийныйНомер КАК НомерПартии,
				   |	Док.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				   |	Док.Коэффициент КАК Коэффициент,
				   |	Док.Качество КАК Качество,
				   |	Док.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
				   |	Док.КоличествоМест КАК КоличествоМест,
				   |	Док.НалоговоеНазначение КАК НалоговоеНазначение,
				   |	Док.СчетУчетаБУ КАК СчетУчетаБУ,
	               |	ВЫБОР
	               |		КОГДА Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Док.Номенклатура.Код, """")
	               |		ИНАЧЕ ЕСТЬNULL(Док.Номенклатура.Код, """") + ""_"" + (ВЫРАЗИТЬ(Док.ХарактеристикаНоменклатуры.Наименование КАК СТРОКА(200)))
	               |	КОНЕЦ КАК PROD_NR,
	               |	ВЫБОР
	               |		КОГДА Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Док.Номенклатура.Наименование, """")
	               |		ИНАЧЕ ЕСТЬNULL(Док.Номенклатура.Наименование, """") + ""_"" + (ВЫРАЗИТЬ(Док.ХарактеристикаНоменклатуры.Наименование КАК СТРОКА(200)))
	               |	КОНЕЦ КАК PROD_NAME
	               |ИЗ
	               |	Документ.ИмяДок.Товары КАК Док
	               |ГДЕ
	               |	Док.Ссылка = &Ссылка";
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ЗаказПокупателя");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","РеализацияТоваровУслуг");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ВозвратТоваровОтПокупателя");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ВозвратТоваровПоставщику");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ПоступлениеТоваровУслуг");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ОприходованиеТоваров");
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","СписаниеТоваров");
	КонецЕсли;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Док);	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из РезультатЗапроса Цикл
		СтрокаРезультат.НомерПартии = СокрЛП(СтрокаРезультат.НомерПартии);		
	КонецЦикла;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция получает данные по товарам документа
//
Функция ПолучитьДанныеПоТоварамДок(Док) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Док.Количество КАК BU_QUANTITY,
				   |	Док.Номенклатура КАК Номенклатура,
				   |	Док.СерияНоменклатуры КАК part_nr,
	               |	ВЫБОР
	               |		КОГДА Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Док.Номенклатура.Код, """")
	               |		ИНАЧЕ ЕСТЬNULL(Док.Номенклатура.Код, """") + ""_"" + (ВЫРАЗИТЬ(Док.ХарактеристикаНоменклатуры.Наименование КАК СТРОКА(200)))
	               |	КОНЕЦ КАК PROD_NR,
	               |	ВЫБОР
	               |		КОГДА Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(Док.Номенклатура.Наименование, """")
	               |		ИНАЧЕ ЕСТЬNULL(Док.Номенклатура.Наименование, """") + ""_"" + (ВЫРАЗИТЬ(Док.ХарактеристикаНоменклатуры.Наименование КАК СТРОКА(200)))
	               |	КОНЕЦ КАК PROD_NAME
	               |ИЗ
	               |	Документ.ИмяДок.Товары КАК Док
	               |ГДЕ
	               |	Док.Ссылка = &Ссылка";
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ЗаказПокупателя");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","РеализацияТоваровУслуг");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ВозвратТоваровОтПокупателя");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ВозвратТоваровПоставщику");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ПоступлениеТоваровУслуг");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","ОприходованиеТоваров");
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяДок","СписаниеТоваров");
	КонецЕсли;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Док);	
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Создаем объект ЧтениеJSON на основе текста объекта
//
Функция ПолучитьСтруктуруJSON(ТекстJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	
	Возврат Структура;
	
КонецФункции

// Рекурсивная процедура  для возврата объекта типа Структура
//
Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции 

// В случае использования массивов в JSON-объекте используем третью процедуру
//
Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции

// Функция получает Json данные методом Get
//
Функция ПолучитьДанныеМетодомGet(Адрес,Url) Экспорт
	
	Попытка
	    ssl = Новый ЗащищенноеСоединениеOpenSSL();
	    HTTPСоединение = Новый HTTPСоединение(Адрес,,,,,,ssl);
	Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось соединиться с " + Адрес);
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	ЗапросUrl = Url;
	Запрос = Новый HTTPЗапрос(ЗапросUrl);
	Результат = HTTPСоединение.Получить(Запрос);
	ОтветСервера = Результат.ПолучитьТелоКакСтроку();
	
	Возврат ОтветСервера;
	
КонецФункции

// Функция получает таблицу значений на основании структуры Json
//
Функция ПолучитьТЗСоСтруктурыJSON(СтруктураJS)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("oper_date");
	ТЗ.Колонки.Добавить("prod_nr");
	ТЗ.Колонки.Добавить("qty");
	ТЗ.Колонки.Добавить("sq_from");
	ТЗ.Колонки.Добавить("sq_name_from");
	ТЗ.Колонки.Добавить("sq_to");
	ТЗ.Колонки.Добавить("sq_name_to");
	ТЗ.Колонки.Добавить("date_prod");
	ТЗ.Колонки.Добавить("date_expire");
	ТЗ.Колонки.Добавить("part_nr");
	
	Для Каждого СтрокаСтруктуры Из СтруктураJS.items Цикл
		НС = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НС,СтрокаСтруктуры);		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

// Функция получает склады
//
Функция ПолучитьСкладыWMS()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	Склады.WMSСтатусы
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	Склады.WMSСтатусы <> """"";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция получает товары
//
Функция ПолучитьТовары()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура,
	               |	Номенклатура.Код КАК КодНоменклатуры,
	               |	СерииНоменклатуры.Ссылка КАК СерияНоменклатуры,
	               |	СерииНоменклатуры.СерийныйНомер
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |		ПО Номенклатура.Ссылка = СерииНоменклатуры.Владелец
	               |ГДЕ
	               |	НЕ Номенклатура.ЭтоГруппа";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция получает документы перемещений
//
Функция ПолучитьПеремещенияТоваровПоКачеству(НачалоПериода,КонецПериода)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПеремещениеТоваров.Ссылка КАК ПеремещениеТоваров,
	               |	ПеремещениеТоваров.ДатаТранзакцииWMS
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |ГДЕ
	               |	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПеремещениеТоваров.СозданWMS";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция заменяет русские, на английские буквы
//
Функция ПреобразоватьНомерПартииАнгл(НомерПартии)
	
	НомерПартии = СтрЗаменить(НомерПартии,"А","A");
	НомерПартии = СтрЗаменить(НомерПартии,"а","a");
	НомерПартии = СтрЗаменить(НомерПартии,"О","O");
	НомерПартии = СтрЗаменить(НомерПартии,"о","o");
	НомерПартии = СтрЗаменить(НомерПартии,"Е","E");
	НомерПартии = СтрЗаменить(НомерПартии,"е","e");
	НомерПартии = СтрЗаменить(НомерПартии,"К","K");
	НомерПартии = СтрЗаменить(НомерПартии,"к","k");
	НомерПартии = СтрЗаменить(НомерПартии,"С","C");
	НомерПартии = СтрЗаменить(НомерПартии,"с","c");
	НомерПартии = СтрЗаменить(НомерПартии,"М","M");
	НомерПартии = СтрЗаменить(НомерПартии,"м","m");
	НомерПартии = СтрЗаменить(НомерПартии,"Р","P");
	НомерПартии = СтрЗаменить(НомерПартии,"р","p");
	НомерПартии = СтрЗаменить(НомерПартии,"Н","H");
	НомерПартии = СтрЗаменить(НомерПартии,"н","h");
	
	Возврат НомерПартии;
	
КонецФункции

// Функция заменяет русские, на английские буквы
//
Функция ПреобразоватьНомерПартииРус(НомерПартии)
	
	НомерПартии = СтрЗаменить(НомерПартии,"A","А");
	НомерПартии = СтрЗаменить(НомерПартии,"a","а");
	НомерПартии = СтрЗаменить(НомерПартии,"O","О");
	НомерПартии = СтрЗаменить(НомерПартии,"o","о");
	НомерПартии = СтрЗаменить(НомерПартии,"E","Е");
	НомерПартии = СтрЗаменить(НомерПартии,"e","е");
	НомерПартии = СтрЗаменить(НомерПартии,"K","К");
	НомерПартии = СтрЗаменить(НомерПартии,"k","к");
	НомерПартии = СтрЗаменить(НомерПартии,"C","С");
	НомерПартии = СтрЗаменить(НомерПартии,"c","с");
	НомерПартии = СтрЗаменить(НомерПартии,"M","М");
	НомерПартии = СтрЗаменить(НомерПартии,"m","м");
	НомерПартии = СтрЗаменить(НомерПартии,"P","Р");
	НомерПартии = СтрЗаменить(НомерПартии,"p","р");
	НомерПартии = СтрЗаменить(НомерПартии,"H","Н");
	НомерПартии = СтрЗаменить(НомерПартии,"h","н");
	
	Возврат НомерПартии;
	
КонецФункции

