
 Функция ПолучитьДопРеквизитТабличнойЧастиСумма(прЭлементСправочника, прИмяТабличнойЧасти, прНоменклатура, прИмяДопРеквизита) Экспорт
	Для Каждого ТекущаяСтрока Из прЭлементСправочника.ДопКолонкиТабличнойЧасти Цикл
		Если (СокрЛП(ТекущаяСтрока.ИмяТабличнойЧасти) = прИмяТабличнойЧасти)И(ТекущаяСтрока.Номенклатура = прНоменклатура)И(СокрЛП(ТекущаяСтрока.ИмяДопРеквизита) = прИмяДопРеквизита) Тогда
			Возврат ТекущаяСтрока.СуммаДопРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьДопРеквизитТабличнойЧастиСумма()



Процедура ОбработкаПроведения(Отказ, Режим)
	////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Движения.Хозрасчетный.Записывать = Истина;
	//Для Каждого ТекСтрокаОкруглениеНаценки Из ОкруглениеНаценки Цикл
	//	// регистр Хозрасчетный 
	//	Движение = Движения.Хозрасчетный.Добавить();
	//	Движение.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
	//	Движение.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;
	//	Движение.Сумма = ТекСтрокаОкруглениеНаценки.Сумма;
	//	Движение.КоличествоДт = 0;
	//КонецЦикла;
	////}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	Движения.Хозрасчетный.Очистить();
	Движения.ТоварыВНТТВПродажныхЦенах.Очистить();  
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ТоварыВНТТВПродажныхЦенах.Записывать = Истина;

	Для Каждого ТекСтрокаОкруглениеНаценки Из ОкруглениеНаценки Цикл
		Если (ТекСтрокаОкруглениеНаценки.Сумма <> 0)И
			(Склад.ВидСклада <> Перечисления.ВидыСкладов.Оптовый) Тогда
			Если ТекСтрокаОкруглениеНаценки.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Округление: сумма торговой наценки';uk='Округлення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ; // 2822
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852  
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
                	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
				ИначеЕсли Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ; // 2821
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 2851
				КонецЕсли;
								
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ТекСтрокаОкруглениеНаценки.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаОкруглениеНаценки.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
				    			
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = ТекСтрокаОкруглениеНаценки.Сумма;
				
				СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, ТекСтрокаОкруглениеНаценки.Номенклатура, Склад);
				НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
				
				Проводка.НалоговоеНазначениеДт = НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				Если Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = ТекСтрокаОкруглениеНаценки.Сумма;  				
					Проводка.СуммаНУКт = ТекСтрокаОкруглениеНаценки.Сумма;  
				КонецЕсли;
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах   				
				НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
				НовоеДвижение.Активность  = Истина;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;  
				НовоеДвижение.Период 	   = Дата;  
				НовоеДвижение.Регистратор = Ссылка;  			
				НовоеДвижение.Склад 	   = Склад;  			
				НовоеДвижение.СтавкаНДС= ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС;
				НовоеДвижение.Сумма 		 = ТекСтрокаОкруглениеНаценки.Сумма;
				НовоеДвижение.СуммаНаценки  = ТекСтрокаОкруглениеНаценки.Сумма;      			
				НовоеДвижение.Номенклатура  = ТекСтрокаОкруглениеНаценки.Номенклатура;  				
				НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Поступление;   
			Иначе
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Округление: сумма торговой наценки';uk='Округлення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ; // 2822
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852  
				ИначеЕсли Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ; // 2821
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 2851
				КонецЕсли;
				
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ТекСтрокаОкруглениеНаценки.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаОкруглениеНаценки.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС);
				
				
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = -ТекСтрокаОкруглениеНаценки.Сумма;
				
				СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, ТекСтрокаОкруглениеНаценки.Номенклатура, Склад);
				НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
				
				Проводка.НалоговоеНазначениеДт = НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				Если Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = ТекСтрокаОкруглениеНаценки.Сумма; 				
					Проводка.СуммаНУКт = ТекСтрокаОкруглениеНаценки.Сумма;
				КонецЕсли;
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах                   
				НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
				НовоеДвижение.Активность  = Истина;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
				НовоеДвижение.Период 	   = Дата;  
				НовоеДвижение.Регистратор = Ссылка;  			
				НовоеДвижение.Склад 	   = Склад;  			
				НовоеДвижение.СтавкаНДС= ТекСтрокаОкруглениеНаценки.Номенклатура.СтавкаНДС;
				НовоеДвижение.Сумма 		 = ТекСтрокаОкруглениеНаценки.Сумма;
				НовоеДвижение.СуммаНаценки  = ТекСтрокаОкруглениеНаценки.Сумма;      			
				НовоеДвижение.Номенклатура  = ТекСтрокаОкруглениеНаценки.Номенклатура;
				НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;    

			КонецЕсли;    		
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаИнвентаризация Из Инвентаризация Цикл
		Если ТекСтрокаИнвентаризация.СуммаРазницыТН <> 0 Тогда
			//лпСчет = ?(СуммаРазницы>0,"719","949");
			//глПроводка(Контекст,лпСчет,ТО_ДатьСчетСклада(МестоХранения),(-СуммаРазницы),"Инвентаризация",Разница,
			//	Константа.БазВидДеятельности,Константа.ТО_ВидЗатрат,,
			//	МестоХранения,ТМЦ,Партия,
			//	,,"ИН");
			
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Инвентаризация: себестоимость';uk='Інвентаризація: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
				//Если ТекСтрокаИнвентаризация.СуммаРазницы > 0 Тогда
				
				Если фПереброскаОстатковСИзмененнойСтавкойНДС = Истина Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
				Иначе
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхТоваров; // 902
				КонецЕсли;
			
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе; // 281
				Иначе
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ; // 2822
				КонецЕсли;
				
				Если фПереброскаОстатковСИзмененнойСтавкойНДС = Ложь Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  Справочники.СтатьиЗатрат.НайтиПоКоду("100000004")); // Себестоимость реализованных покупных запасов
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  ТекСтрокаИнвентаризация.Номенклатура.НоменклатурнаяГруппа); 
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);

				КонецЕсли;
			
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаИнвентаризация.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ТекСтрокаИнвентаризация.Номенклатура.СтавкаНДС);
				
				Проводка.Сумма  = ТекСтрокаИнвентаризация.СуммаРазницы;
				
				СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, ТекСтрокаИнвентаризация.Номенклатура, Склад);
                НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;

				Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				Если Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность; ; 
					Проводка.СуммаНУДт = Проводка.Сумма;  				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;				
							
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Инвентаризация: сумма торговой наценки';uk='Інвентаризація: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе; // 281
				Иначе
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ; // 2822
				КонецЕсли;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ТекСтрокаИнвентаризация.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаИнвентаризация.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  ТекСтрокаИнвентаризация.Номенклатура.СтавкаНДС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  ТекСтрокаИнвентаризация.Номенклатура.СтавкаНДС);
		
				Проводка.Сумма  = ТекСтрокаИнвентаризация.СуммаРазницыТН;    			
				
				Проводка.НалоговоеНазначениеДт = НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = НалоговоеНазначение;
				Если Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма; 				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах 
				лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
				лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", Ссылка);
				Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
					лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
				Иначе
					лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
				КонецЕсли;
				
				Если лпДопДанныеДокументаСсылка.Пустая() Тогда
					Возврат;
				КонецЕсли;
				лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
				
				Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(Дата,Организация).НДС = Ложь Тогда
					лпСуммаНаценки_упр = ТекСтрокаИнвентаризация.СуммаРазницыТН; 
					лпСумма_упр = ТекСтрокаИнвентаризация.СуммаРазницы;
				Иначе   						
					лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", ТекСтрокаИнвентаризация.Номенклатура, "СуммаЗакНДС");  
					лпСуммаНаценки_упр = ТекСтрокаИнвентаризация.СуммаРазницыТН - лпСуммаЗакНДС; 
					лпСумма_упр = ТекСтрокаИнвентаризация.СуммаРазницы + лпСуммаЗакНДС;

				КонецЕсли;  
				
				НовоеДвижение = Движения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
				НовоеДвижение.Активность  = Истина;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
				НовоеДвижение.Период 	   = Дата;  
				НовоеДвижение.Регистратор = Ссылка;  			
				НовоеДвижение.Склад 	   = Склад;  			
				НовоеДвижение.СтавкаНДС= ТекСтрокаИнвентаризация.Номенклатура.СтавкаНДС;
				НовоеДвижение.Сумма 		 = лпСумма_упр;
				НовоеДвижение.СуммаНаценки  = лпСуммаНаценки_упр;      			
				НовоеДвижение.Номенклатура  = ТекСтрокаИнвентаризация.Номенклатура;
				НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;  	
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаПриготовление Из Приготовление Цикл
		Если ТекСтрокаПриготовление.Сумма <> 0 Тогда
				//глПроводка(Контекст,ТО_ДатьСчетСклада(ДатьМестоХранения()),"28.5",СуммаРознСНДС,"Тариф:Сумма торговой наценки",, 
				//	ДатьМестоХранения(),Товар,Партия,
				//	ДатьМестоХранения(),Товар,Партия, ,,"ПХ");
			Если ТекСтрокаПриготовление.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Тариф: сумма торговой наценки';uk='Тариф: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе; // 281
				Иначе
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ; // 282
				КонецЕсли;
				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ТекСтрокаПриготовление.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаПриготовление.Номенклатура);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = ТекСтрокаПриготовление.Сумма;
				
			Иначе
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Тариф: сумма торговой наценки';uk='Тариф: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
				Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе; // 281
				Иначе
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ; // 282
				КонецЕсли;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ТекСтрокаПриготовление.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", ТекСтрокаПриготовление.Номенклатура);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = ТекСтрокаПриготовление.Сумма;
			КонецЕсли;
				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
