Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра.Значение = '00010101' Тогда
		ЗначениеПараметра.Значение = КонецДня(ТекущаяДата());
		ЗначениеПараметра.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(Результат, Расшифровка, ОтчетОбъект, ВыводВФормуОтчета = Истина)Экспорт
	
	//СтандартнаяОбработка = Ложь;
	Результат.Очистить();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,Расшифровка);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,Расшифровка);
	ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ТиповыеОтчеты.ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета);

	
	ПолеПоКоторомуНеобходимоПолучитьЗначение = "Ссылка";
	ПроцессорВывода.НачатьВывод();
	Пока Истина Цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
			ЗначениеВыводимыхДанных = Неопределено;
			Для Каждого ЗначенияПараметра Из ЭлементРезультата.ЗначенияПараметров Цикл
				Если ТипЗнч(ЗначенияПараметра.Значение) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
					ПоляРасшифровки = Расшифровка.Элементы[ЗначенияПараметра.Значение].ПолучитьПоля();
					Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
						Если ПолеРасшифровки.Поле = ПолеПоКоторомуНеобходимоПолучитьЗначение Тогда
							
							ЗначениеВыводимыхДанных = ПолеРасшифровки.Значение;
							
							Рис = Результат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
							Рис.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
							Индекс = Результат.Рисунки.Индекс(Рис);
							Если ЗначениеВыводимыхДанных.ПометкаУдаления = Истина Тогда
								Результат.Рисунки[Индекс].Картинка  = БиблиотекаКартинок.ПомеченНаУдаление;
								Результат.Рисунки[Индекс].ЦветФона = Новый Цвет(255,229,229);
							Иначе 
								Если ЗначениеВыводимыхДанных.Проведен Тогда
									Результат.Рисунки[Индекс].Картинка  = БиблиотекаКартинок.Проведенный;
								Иначе
									Результат.Рисунки[Индекс].Картинка  = БиблиотекаКартинок.НеПроведенный;
								КонецЕсли;
							КонецЕсли;
							ВысотаТабДок = Результат.ВысотаТаблицы;
							ОбластьДляКартинки = Результат.НайтиТекст("%Картинка%");
							Если ОбластьДляКартинки <> Неопределено Тогда 
								Результат.Рисунки[Индекс].Расположить(ОбластьДляКартинки);
								ОбластьДляКартинки.Текст = "%КартинкаДобавлена%";
							КонецЕсли;
							
							Прервать;
						КонецЕсли; 
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	
	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры


// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры

Расшифровки = Новый СписокЗначений;
//Расшифровки.Добавить("СтандартнаяРасшифровка", "СтандартнаяРасшифровка");

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли