//процедура запрета изменения документов вчерашним числом
Процедура ЗапретИзмененияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если РольДоступна(Метаданные.Роли.ПравоИзменятьДокументыЗаднимЧислом)=Ложь Тогда
		//ДатаД=НачалоДня(Источник.Дата+60*60*24*15);
		ДатаД=НачалоДня(Источник.Дата);
		ДатаТ=НачалоДня(ТекущаяДата());
		Если ДатаТ>ДатаД Тогда
			Отказ=Истина;
			Сообщить("У пользователя нет права редактировать документ задним числом!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура ПодпискаНаСобытие1ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если РольДоступна(Метаданные.Роли.ПравоПроводитьДокументы)=Ложь Тогда
					Отказ=Истина;
			Сообщить("У пользователя нет права проводить документы!",СтатусСообщения.Важное);
	КонецЕсли;

КонецПроцедуры


//процедуры создания серии и характеристики
Процедура ПроверитьЗаполнениеИСоздатьСерию(Объект,Отказ,ВидПрихода)Экспорт 
	
	ПроверитьЗаполнениеРеквизитовПоСерии(Объект,Отказ);
	
	СпрХарактеристики 			= Справочники.ХарактеристикиНоменклатуры;
	СпрСправочникСерии 			= Справочники.СерииНоменклатуры;
	ПустаяСерия 				= СпрСправочникСерии.ПустаяСсылка();
	
	Если НЕ Отказ Тогда
		
		Для Каждого ТекущаяСтрока ИЗ Объект.Товары Цикл                                                        
			
			Если НЕ ТекущаяСтрока.Номенклатура.ВестиУчетПоСериям ИЛИ НЕ ТекущаяСтрока.Номенклатура.ВестиУчетПоХарактеристикам Тогда                                        
				Продолжить;                                                                                    
			КонецЕсли;                                                                               
			
			//ИмяСерии =  СокрЛП(ТекущаяСтрока.НомерСерии)+", "+ТекущаяСтрока.НомерСертификата + ", "+Формат(ТекущаяСтрока.СрокГодности,"ДФ=dd.MM.yyyy");
			ИмяСерии =  СокрЛП(ТекущаяСтрока.НомерСерии)+ ", " + Формат(ТекущаяСтрока.СрокГодности,"ДФ=dd.MM.yyyy");
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СерияНоменклатуры)                                    
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.СерияНоменклатуры.Владелец) Тогда                      
				
				//На всякий случай еще раз проверим присутсвие серии в справочнике
				
				ЗапросСерии = Новый Запрос;
				ЗапросСерии.Текст = 
				"ВЫБРАТЬ
				|	СерииНоменклатуры.Ссылка
				|ИЗ
				|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
				|ГДЕ
				|	СерииНоменклатуры.Владелец = &Владелец
				|	И СерииНоменклатуры.Наименование = &Наименование";
				
				ЗапросСерии.УстановитьПараметр("Владелец", ТекущаяСтрока.Номенклатура);
				ЗапросСерии.УстановитьПараметр("Наименование", ИмяСерии);
				
				
				ВыборкаДетальныеЗаписиСерии =  ЗапросСерии.Выполнить().Выбрать();
				
				Если ВыборкаДетальныеЗаписиСерии.Следующий() Тогда
					НайденнаяСерия = ВыборкаДетальныеЗаписиСерии.Ссылка;
				Иначе
					НайденнаяСерия = ПустаяСерия;
				КонецЕсли;
				
				
				//НайденнаяСерия 		= СпрСправочникСерии.НайтиПоРеквизиту("Наименование",СокрЛП(ТекущаяСтрока.НомерСерии)+" "+Формат(ТекущаяСтрока.СрокГодности,"ДФ=dd.MM.yy"),,ТекущаяСтрока.Номенклатура);
				
				Если НайденнаяСерия <> ПустаяСерия Тогда
					
					ТекущаяСтрока.СерияНоменклатуры = НайденнаяСерия;
					//Проверим характеристику и создадим ее если нету
					ПроверитьСоздатьХарактеристикуСтроки(Объект, ТекущаяСтрока, СпрХарактеристики, Отказ, ВидПрихода);
					
				Иначе
					//...создаем новые серии
					
					НоваяСерия 				= СпрСправочникСерии.СоздатьЭлемент();
					НоваяСерия.Владелец 	= ТекущаяСтрока.Номенклатура;
					НоваяСерия.СерийныйНомер= СокрЛП(ТекущаяСтрока.НомерСерии);       
					НоваяСерия.СрокГодности = ТекущаяСтрока.СрокГодности;
					//НоваяСерия.Сертификат 	= ТекущаяСтрока.НомерСертификата;
					НоваяСерия.Наименование = ИмяСерии ;
					//НоваяСерия.НомерВисновка 	= ТекущаяСтрока.НомерВисновка;
					//НоваяСерия.ДатаВисновка 	= ТекущаяСтрока.ДатаВисновка;
					//НоваяСерия.ТаможеннаяЦена 	= ТекущаяСтрока.ТаможеннаяЦена;
					//НоваяСерия.ТаможеннаяЦенаВалютная 	= ТекущаяСтрока.ТаможеннаяЦенаВалютная;
					//Пытаемся записать                          
					Попытка
						
						НоваяСерия.Записать();	
						
						ТекущаяСтрока.СерияНоменклатуры = НоваяСерия.Ссылка;
						//Проверим характеристику и создадим ее если нету
						ПроверитьСоздатьХарактеристикуСтроки(Объект, ТекущаяСтрока, СпрХарактеристики, Отказ, ВидПрихода);
						
					Исключение
						
						ТекстСообщения = "В строке № "+ТекущаяСтрока.НомерСтроки+" не записан элемент справочника Серии номенклатуры '"+ТекущаяСтрока.НомерСерии+"'
						|"+ОписаниеОшибки();
						
						ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);	
						
					КонецПопытки;
					
				КонецЕсли;				
				
			Иначе
				
				ПроверитьСоздатьХарактеристикуСтроки(Объект, ТекущаяСтрока, СпрХарактеристики, Отказ, ВидПрихода);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовПоСерии(Объект,Отказ) Экспорт
	
	Для Каждого ТекущаяСтрока ИЗ Объект.Товары Цикл
		
		Если НЕ ТекущаяСтрока.Номенклатура.ВестиУчетПоСериям ИЛИ НЕ ТекущаяСтрока.Номенклатура.ВестиУчетПоХарактеристикам Тогда
			Продолжить;                                                       
		КонецЕсли;
		
		//Если ТекущаяСтрока.НоваяСерия Тогда                                
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерСерии) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("В строке № "+ТекущаяСтрока.НомерСтроки+" не заполнено поле 'НомерСерии'!", Отказ);	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СрокГодности) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("В строке № "+ТекущаяСтрока.НомерСтроки+" не заполнено поле 'Срок годности'!", Отказ);	
			
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерСертификата) Тогда
		//	
		//	ОбщегоНазначения.СообщитьОбОшибке("В строке № "+ТекущаяСтрока.НомерСтроки+" не заполнено поле 'Номер сертификата'!", Отказ);	
		//	
		//КонецЕсли;                                        
		//
		//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаСертификата) Тогда
		//	
		//	ОбщегоНазначения.СообщитьОбОшибке("В строке № "+ТекущаяСтрока.НомерСтроки+" не заполнено поле 'Дата сертификата'!", Отказ);	
		//	
		//КонецЕсли;
		
		
		//Иначе
		//	
		//	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СерияНоменклатуры) ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
		//		
		//		ОбщегоНазначения.СообщитьОбОшибке("В строке № "+ТекущаяСтрока.НомерСтроки+" не заполнено поле 'Cерия' или 'Серия номенклатуры'!", Отказ);	
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверитьСоздатьХарактеристикуСтроки(Объект, ТекущаяСтрока, СпрХарактеристики, Отказ, ЭтоОприходование = 2, СоздаватьХарактеристику = Истина) Экспорт
	
	Если ТипЗнч(Объект)=Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
		СоздаватьХарактеристику = Ложь;
	КонецЕсли;
	
	//Выясним заполнена ли характеристика или нет
	Если НЕ СоздаватьХарактеристику Тогда		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;                                                                        
	
	Если ЭтоОприходование = 1 Тогда 		//Оприходование
		НаименованиеХарактеристики = "ОП "+Объект.Номер+" "+ Формат(Объект.Дата,"ДФ=dd.MM.yy")+ "; "+ТекущаяСтрока.СерияНоменклатуры.Наименование;
	ИначеЕсли ЭтоОприходование = 2 Тогда	//Приходная
		НаименованиеХарактеристики = "ПН "+Объект.Номер+" "+ Формат(Объект.Дата,"ДФ=dd.MM.yy")+ "; "+ТекущаяСтрока.СерияНоменклатуры.Наименование;
	ИначеЕсли ЭтоОприходование = 3 Тогда	//Возврат				
		НаименованиеХарактеристики = "ВН "+Объект.Номер+" "+ Формат(Объект.Дата,"ДФ=dd.MM.yy")+ "; "+ТекущаяСтрока.СерияНоменклатуры.Наименование;
	ИначеЕсли ЭтоОприходование = 4 Тогда	//Приходный ордер на товары
		НаименованиеХарактеристики = "ПОТ "+Объект.Номер+" "+ Формат(Объект.Дата,"ДФ=dd.MM.yy")+ "; "+ТекущаяСтрока.СерияНоменклатуры.Наименование;		
	Иначе //ХЗ		
		НаименованиеХарактеристики = "ПН "+Объект.Номер+" "+ Формат(Объект.Дата,"ДФ=dd.MM.yy")+ "; "+ТекущаяСтрока.СерияНоменклатуры.Наименование;		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
		
		Попытка
			НоваяХарактеристика = ТекущаяСтрока.ХарактеристикаНоменклатуры.ПолучитьОбъект();
			
			Если СокрЛП(НоваяХарактеристика.Наименование) = НаименованиеХарактеристики  Тогда
				//Менять ничего не нужно
				
				
				НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
				
				//.... партия
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Партия;
				Запись.Значение = Объект.Ссылка;
				
				//.... Серия
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Серия;
				Запись.Значение = ТекущаяСтрока.СерияНоменклатуры;
				
				//.... НомерСертификата
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата;
				Запись.Значение = ТекущаяСтрока.НомерСертификата;
				
				//.... ДатаСертификата
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата;
				Запись.Значение = ТекущаяСтрока.ДатаСертификата;
				
				//.... НомерВисновка
				Запись = НаборЗаписейЗначенияСвойств.Добавить();                                        
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;                                           
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка;
				Запись.Значение = ТекущаяСтрока.НомерВисновка;                                      
				
				//.... ДатаВисновка
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка;
				Запись.Значение = ТекущаяСтрока.ДатаВисновка;
				
				
				
				НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(НоваяХарактеристика.Ссылка);
				
				НаборЗаписейЗначенияСвойств.Записать();
				
				Возврат;
				//ИначеЕсли  СокрЛП(НоваяХарактеристика.Наименование) <> НаименованиеХарактеристики и ЭтоОприходование=3 тогда  //для возврата создаем новую характеристику
				//	
				//	НоваяХарактеристика = СпрХарактеристики.СоздатьЭлемент();
				
			КонецЕсли;
		Исключение
			
			//Если  СокрЛП(НоваяХарактеристика.Наименование) <> НаименованиеХарактеристики и ЭтоОприходование=3 тогда  //для возврата создаем новую характеристику
			//	
			//	НоваяХарактеристика = СпрХарактеристики.СоздатьЭлемент();
			//Иначе	
			
			НоваяХарактеристика = СпрХарактеристики.НайтиПоНаименованию(НаименованиеХарактеристики,Истина,,ТекущаяСтрока.Номенклатура);
			
			Если НоваяХарактеристика = СпрХарактеристики.ПустаяСсылка() Тогда 
				
				НоваяХарактеристика = СпрХарактеристики.СоздатьЭлемент();	
				
			Иначе
				
				ТекущаяСтрока.ХарактеристикаНоменклатуры = НоваяХарактеристика.Ссылка;
				
				
				НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
				
				//.... партия
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Партия;
				Запись.Значение = Объект.Ссылка;
				
				//.... Серия
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Серия;
				Запись.Значение = ТекущаяСтрока.СерияНоменклатуры;
				
				//.... НомерСертификата
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата;
				Запись.Значение = ТекущаяСтрока.НомерСертификата;
				
				//.... ДатаСертификата
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата;
				Запись.Значение = ТекущаяСтрока.ДатаСертификата;
				
				//.... НомерВисновка
				Запись = НаборЗаписейЗначенияСвойств.Добавить();                                        
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;                                           
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка;
				Запись.Значение = ТекущаяСтрока.НомерВисновка;                                      
				
				//.... ДатаВисновка
				Запись = НаборЗаписейЗначенияСвойств.Добавить();
				
				Запись.Объект   = НоваяХарактеристика.Ссылка;
				Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка;
				Запись.Значение = ТекущаяСтрока.ДатаВисновка;
				
				НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(НоваяХарактеристика.Ссылка);
				
				НаборЗаписейЗначенияСвойств.Записать();
				
				Возврат;
				//КонецЕсли;	
			КонецЕсли;		
		КонецПопытки;
		
	Иначе
		
		//не заполнена, создаем ее на базе серии
		
		//...Сразу попробуем найти по наименованию
		НоваяХарактеристика = СпрХарактеристики.НайтиПоНаименованию(НаименованиеХарактеристики,Истина,,ТекущаяСтрока.Номенклатура);
		
		Если НоваяХарактеристика = СпрХарактеристики.ПустаяСсылка() Тогда 
			
			НоваяХарактеристика = СпрХарактеристики.СоздатьЭлемент();	
			
		Иначе
			
			ТекущаяСтрока.ХарактеристикаНоменклатуры = НоваяХарактеристика.Ссылка;
			
			НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			
			//.... партия
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Партия;
			Запись.Значение = Объект.Ссылка;
			
			//.... Серия
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Серия;
			Запись.Значение = ТекущаяСтрока.СерияНоменклатуры;
			
			//.... НомерСертификата
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата;
			Запись.Значение = ТекущаяСтрока.НомерСертификата;
			
			//.... ДатаСертификата
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата;
			Запись.Значение = ТекущаяСтрока.ДатаСертификата;
			
			//.... НомерВисновка
			Запись = НаборЗаписейЗначенияСвойств.Добавить();                                        
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;                                           
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка;
			Запись.Значение = ТекущаяСтрока.НомерВисновка;                                      
			
			//.... ДатаВисновка
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = НоваяХарактеристика.Ссылка;
			Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка;
			Запись.Значение = ТекущаяСтрока.ДатаВисновка;
			
			НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(НоваяХарактеристика.Ссылка);
			
			НаборЗаписейЗначенияСвойств.Записать();
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяХарактеристика.Наименование	= НаименованиеХарактеристики;
	НоваяХарактеристика.Владелец 		= ТекущаяСтрока.Номенклатура;
	НоваяХарактеристика.НоменклатураГТД	= ТекущаяСтрока.Номенклатура.НоменклатураГТД;
	
	Попытка
		
		НоваяХарактеристика.Записать();
		ТекущаяСтрока.ХарактеристикаНоменклатуры = НоваяХарактеристика.Ссылка;
		
	Исключение
		
		ТекстСообщения = "В строке № "+ТекущаяСтрока.НомерСтроки+" не записан элемент справочника Характеристика номенклатуры '"+ТекущаяСтрока.Серия+"'
		|"+ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		Возврат;
		
	КонецПопытки;
	
	//Запишем теперь свойства характеристики
	Попытка
		
		НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		
		//.... партия
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Партия;
		Запись.Значение = Объект.Ссылка;
		
		//.... Серия
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Серия;
		Запись.Значение = ТекущаяСтрока.СерияНоменклатуры;
		
		//.... НомерСертификата
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата;
		Запись.Значение = ТекущаяСтрока.НомерСертификата;
		
		//.... ДатаСертификата
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата;
		Запись.Значение = ТекущаяСтрока.ДатаСертификата;
		
		//.... НомерВисновка
		Запись = НаборЗаписейЗначенияСвойств.Добавить();                                        
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;                                           
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка;
		Запись.Значение = ТекущаяСтрока.НомерВисновка;                                      
		
		//.... ДатаВисновка
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		
		Запись.Объект   = НоваяХарактеристика.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка;
		Запись.Значение = ТекущаяСтрока.ДатаВисновка;
		
		НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(НоваяХарактеристика.Ссылка);
		
		НаборЗаписейЗначенияСвойств.Записать();
		
	Исключение
		
		ТекстСообщения = "В строке № "+ТекущаяСтрока.НомерСтроки+" не записан элемент справочника Характеристика номенклатуры '"+ТекущаяСтрока.Серия+"'
		|"+ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		Возврат;
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСерииВСтроке(СтрокаТабличнойЧасти) Экспорт 
	
	Если СтрокаТабличнойЧасти.НомерСерии<>СтрокаТабличнойЧасти.СерияНоменклатуры.СерийныйНомер Тогда
		СтрокаТабличнойЧасти.НомерСерии 		= СтрокаТабличнойЧасти.СерияНоменклатуры.СерийныйНомер;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.СрокГодности<>СтрокаТабличнойЧасти.СерияНоменклатуры.СрокГодности  Тогда
		СтрокаТабличнойЧасти.СрокГодности 		= СтрокаТабличнойЧасти.СерияНоменклатуры.СрокГодности;
	КонецЕсли;
	
	//Если СтрокаТабличнойЧасти.НомерСертификата<>СтрокаТабличнойЧасти.СерияНоменклатуры.Сертификат  Тогда
	//  СтрокаТабличнойЧасти.НомерСертификата 	= СтрокаТабличнойЧасти.СерияНоменклатуры.Сертификат;
	//КонецЕсли;
	
	//Если СтрокаТабличнойЧасти.ДатаСертификата<>СтрокаТабличнойЧасти.СерияНоменклатуры.ДатаСертификата  Тогда
	//  СтрокаТабличнойЧасти.ДатаСертификата 	= СтрокаТабличнойЧасти.СерияНоменклатуры.ДатаСертификата;
	//КонецЕсли;
	
	//Если СтрокаТабличнойЧасти.НомерВисновка<>СтрокаТабличнойЧасти.СерияНоменклатуры.НомерВисновка  Тогда
	//  СтрокаТабличнойЧасти.НомерВисновка 		= СтрокаТабличнойЧасти.СерияНоменклатуры.НомерВисновка;
	//КонецЕсли;
	
	//Если СтрокаТабличнойЧасти.ДатаВисновка<>СтрокаТабличнойЧасти.СерияНоменклатуры.ДатаВисновка  Тогда
	//  СтрокаТабличнойЧасти.ДатаВисновка 		= СтрокаТабличнойЧасти.СерияНоменклатуры.ДатаВисновка;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеХарактеристикиВСтроке(СтрокаТабличнойЧасти) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектовСертификат.Значение, """") КАК НомерСертификата,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектовДатаСертификата.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСертификата,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектовВисновок.Значение, """") КАК НомерВисновка,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектовДатаВисновка.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВисновка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовСертификат
	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовСертификат.Объект
	|			И (ЗначенияСвойствОбъектовСертификат.Свойство = &СвойствоСертификат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовДатаСертификата
	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовДатаСертификата.Объект
	|			И (ЗначенияСвойствОбъектовДатаСертификата.Свойство = &СвойствоДатаСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовВисновок
	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовВисновок.Объект
	|			И (ЗначенияСвойствОбъектовВисновок.Свойство = &СвойствоВисновок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовДатаВисновка
	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовДатаВисновка.Объект
	|			И (ЗначенияСвойствОбъектовДатаВисновка.Свойство = &СвойствоДатаВисновка)
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаСсылка";
	
	Запрос.УстановитьПараметр("СвойствоВисновок", ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка);
	Запрос.УстановитьПараметр("СвойствоДатаВисновка", ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка);
	Запрос.УстановитьПараметр("СвойствоДатаСертификата", ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата);
	Запрос.УстановитьПараметр("СвойствоСертификат", ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата);
	Запрос.УстановитьПараметр("ХарактеристикаСсылка", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		СтрокаТабличнойЧасти.НомерСертификата = ВыборкаДетальныеЗаписи.НомерСертификата;
		СтрокаТабличнойЧасти.ДатаСертификата = ВыборкаДетальныеЗаписи.ДатаСертификата;
		СтрокаТабличнойЧасти.НомерВисновка = ВыборкаДетальныеЗаписи.НомерВисновка;
		СтрокаТабличнойЧасти.ДатаВисновка = ВыборкаДетальныеЗаписи.ДатаВисновка;
		
	КонецЕсли;;
	
КонецПроцедуры

//проверим заполнение свойств  характеристик при открытии документов поступления на случай возможного изменения их в карточке номенклатуры
Процедура ПерезаполнитьПоляПоСвойствамХарактеристик(Объект)   Экспорт 
	ДокуменИзменен = Ложь;
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХарактеристикиНоменклатуры.Ссылка,
			|	ЕСТЬNULL(ЗначенияСвойствОбъектовСертификат.Значение, """") КАК НомерСертификата,
			|	ЕСТЬNULL(ЗначенияСвойствОбъектовДатаСертификата.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСертификата,
			|	ЕСТЬNULL(ЗначенияСвойствОбъектовВисновок.Значение, """") КАК НомерВисновка,
			|	ЕСТЬNULL(ЗначенияСвойствОбъектовДатаВисновка.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВисновка
			|ИЗ
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовСертификат
			|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовСертификат.Объект
			|			И (ЗначенияСвойствОбъектовСертификат.Свойство = &СвойствоСертификат)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовДатаСертификата
			|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовДатаСертификата.Объект
			|			И (ЗначенияСвойствОбъектовДатаСертификата.Свойство = &СвойствоДатаСертификата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовВисновок
			|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовВисновок.Объект
			|			И (ЗначенияСвойствОбъектовВисновок.Свойство = &СвойствоВисновок)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовДатаВисновка
			|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектовДатаВисновка.Объект
			|			И (ЗначенияСвойствОбъектовДатаВисновка.Свойство = &СвойствоДатаВисновка)
			|ГДЕ
			|	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаСсылка";
			
			Запрос.УстановитьПараметр("СвойствоВисновок", ПланыВидовХарактеристик.СвойстваОбъектов.НомерВисновка);
			Запрос.УстановитьПараметр("СвойствоДатаВисновка", ПланыВидовХарактеристик.СвойстваОбъектов.ДатаВисновка);
			Запрос.УстановитьПараметр("СвойствоДатаСертификата", ПланыВидовХарактеристик.СвойстваОбъектов.ДатаСертификата);
			Запрос.УстановитьПараметр("СвойствоСертификат", ПланыВидовХарактеристик.СвойстваОбъектов.НомерСертификата);
			Запрос.УстановитьПараметр("ХарактеристикаСсылка", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Если СтрокаТабличнойЧасти.НомерСертификата <> ВыборкаДетальныеЗаписи.НомерСертификата Тогда
					СтрокаТабличнойЧасти.НомерСертификата = ВыборкаДетальныеЗаписи.НомерСертификата;
					ДокуменИзменен = Истина;
				КонецЕсли;
				
				Если СтрокаТабличнойЧасти.ДатаСертификата <> ВыборкаДетальныеЗаписи.ДатаСертификата Тогда
					СтрокаТабличнойЧасти.ДатаСертификата = ВыборкаДетальныеЗаписи.ДатаСертификата;
					ДокуменИзменен = Истина;
				КонецЕсли;
				
				Если СтрокаТабличнойЧасти.НомерВисновка <> ВыборкаДетальныеЗаписи.НомерВисновка Тогда
					СтрокаТабличнойЧасти.НомерВисновка = ВыборкаДетальныеЗаписи.НомерВисновка;
					ДокуменИзменен = Истина;
				КонецЕсли;
				
				Если СтрокаТабличнойЧасти.ДатаВисновка <> ВыборкаДетальныеЗаписи.ДатаВисновка Тогда
					СтрокаТабличнойЧасти.ДатаВисновка = ВыборкаДетальныеЗаписи.ДатаВисновка;
					ДокуменИзменен = Истина;
				КонецЕсли;
				
			КонецЕсли;;
		КонецЕсли;
	КонецЦикла;
	
	Если ДокуменИзменен  Тогда
		Объект.Записать();
	КонецЕсли;
	
	
КонецПроцедуры


//...используется при отборе характеристик с учетом остатков
Функция  ВыбратьТаблицуХарактеристикСОстаткамиНаСкладах(ПредварительныеХарактеристики,ДатаОстатков) Экспорт 
	ГотоваяТаблица = ПредварительныеХарактеристики.Скопировать();
	ГотоваяТаблица.Очистить();
	Для каждого строка Из ПредварительныеХарактеристики Цикл
		
		//СерияНоменклатуры = 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
		|			&Период,
		|			Номенклатура = &Номенклатура
		//|				И СерияНоменклатуры = &СерияНоменклатуры
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ПартииТоваровНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("Номенклатура", строка.Характеристика.Владелец);
		Запрос.УстановитьПараметр("Период", ДатаОстатков);
		//Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", строка.Характеристика);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если ВыборкаДетальныеЗаписи.КоличествоОстаток>0 Тогда
				НоваяСтрока = ГотоваяТаблица.Добавить();
				НоваяСтрока.ПометкаУдаления = строка.ПометкаУдаления;
				НоваяСтрока.Характеристика = строка.Характеристика;
			КонецЕсли; 
		КонецЕсли;
		
		
	КонецЦикла;	
	Возврат ГотоваяТаблица;
КонецФункции


Функция НайтиСериюПоХарактеристике(Характеристика)  Экспорт 
	
	СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Характеристика);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.Серия);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СерияНоменклатуры=ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат СерияНоменклатуры;	
	
КонецФункции // НайтиСериюПоХарактеристике(Характеристика)()

Функция НайтиПартиюПоХарактеистике(Характеристика) Экспорт 
	Партия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Характеристика);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.Партия);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
		Партия = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат Партия;
	
КонецФункции // НайтиПартиюПоХарактеистике()

//отключил из-за неправильности подхода расчета себестоимости и отмены использования реквизитов ТаможеннаяЦена
Процедура  ЗаполнитьСебестоимостьИТаможеннуюЦену(СтрокаТабличнойЧасти,ДатаДокумента) Экспорт 
	//таможенную цену берем из документа партии
	//себестоимость выбираем из регистра ПратииТоваровНаСкладах
	//	
	//Партия = НайтиПартиюПоХарактеистике(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	//
	//Если  Партия<>Неопределено тогда
	//	
	//	ДокументПартии = Партия; 		
	//	ТаблицаТоваров = ДокументПартии.Товары.Выгрузить();
	//	
	//	Отбор = Новый Структура();
	//	Отбор.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	//	Отбор.Вставить("ХарактеристикаНоменклатуры",СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	//	Строки = ТаблицаТоваров.НайтиСтроки(Отбор);
	//	Если Строки.Количество() > 0 Тогда
	//		СтрокаДокументаПартии = Строки[0];  
	//		СтрокаТабличнойЧасти.ТаможеннаяЦена = СтрокаДокументаПартии.ТаможеннаяЦена;
	//		СтрокаТабличнойЧасти.ТаможеннаяЦенаВалютная = СтрокаДокументаПартии.ТаможеннаяЦенаВалютная;   
	//	КонецЕсли;
	//КонецЕсли;
	
	//// а теперь выбираем себестоимость
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток,
	//	|	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток,
	//	|	ВЫБОР
	//	|		КОГДА ПартииТоваровНаСкладахОстатки.КоличествоОстаток = 0
	//	|			ТОГДА 0
	//	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток
	//	|	КОНЕЦ КАК Себестоимость
	//	|ИЗ
	//	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	//	|			&Период,
	//	|			Номенклатура = &Номенклатура
	//	|				И СерияНоменклатуры = &СерияНоменклатуры
	//	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//	|				И ДокументОприходования = &ДокументОприходования) КАК ПартииТоваровНаСкладахОстатки";
	
	//Запрос.УстановитьПараметр("ДокументОприходования", Партия);
	//Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	//Запрос.УстановитьПараметр("Период", ДатаДокумента);
	//Запрос.УстановитьПараметр("СерияНоменклатуры", СтрокаТабличнойЧасти.СерияНоменклатуры);
	//Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	
	//Результат = Запрос.Выполнить();
	//												  
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	СтрокаТабличнойЧасти.Себестоимость = ВыборкаДетальныеЗаписи.Себестоимость;
	//КонецЕсли;
	
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	//
	
	////проверка цены (Катя)
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	// |	ВложенныйЗапрос.Ссылка,
	// |	ВложенныйЗапрос.Номенклатура,
	// |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	// |	ВложенныйЗапрос.СерияНоменклатуры,
	// |	ВложенныйЗапрос.Цена,
	// |	ВложенныйЗапрос.Регистратор,
	// |	ВложенныйЗапрос.Номенклатура1,
	// |	ВложенныйЗапрос.ХарактеристикаНоменклатуры1,
	// |	ВложенныйЗапрос.СерияНоменклатуры1,
	// |	ВложенныйЗапрос.Себестоимость
	// |ИЗ
	// |	(ВЫБРАТЬ
	// |		РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	// |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	// |		РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	// |		РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	// |		РеализацияТоваровУслугТовары.Цена КАК Цена,
	// |		ПартииТоваровНаСкладах.Регистратор КАК Регистратор,
	// |		ПартииТоваровНаСкладах.Номенклатура КАК Номенклатура1,
	// |		ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры1,
	// |		ПартииТоваровНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры1,
	// |		ВЫБОР
	// |			КОГДА ПартииТоваровНаСкладах.Количество = 0
	// |				ТОГДА 0
	// |			ИНАЧЕ ПартииТоваровНаСкладах.Стоимость / ПартииТоваровНаСкладах.Количество
	// |		КОНЕЦ КАК Себестоимость
	// |	ИЗ
	// |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	// |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	// |			ПО РеализацияТоваровУслугТовары.Ссылка = ПартииТоваровНаСкладах.Регистратор
	// |				И РеализацияТоваровУслугТовары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	// |				И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	// |				И РеализацияТоваровУслугТовары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	// |	ГДЕ
	// |		РеализацияТоваровУслугТовары.Ссылка = &ТекущийДокумент) КАК ВложенныйЗапрос";
	//
	// 
	// Выборка = Запрос.Выполнить().Выгрузить();
	// 
	// Для Каждого ТекущаяСтрока Из Выборка Цикл 
	//	 Если ТекущаяСтрока.Цена < ТекущаяСтрока.Себестоимость Тогда
	//		 Сообщить("Внимание! Есть позиции, в которых цена ниже себестоимости!");
	//		 Сообщить("" + ТекущаяСтрока.Номенклатура + "  цена: "+ ТекущаяСтрока.Цена + " себестоимость: " + ТекущаяСтрока.Себестоимость);
	//		 Отказ = Истина;
	//	 КонецЕсли;
	//	 
	// КонецЦикла; 
	// //...проверка цены (Катя)
	
	
КонецПроцедуры // ЗаполнитьСебестоимостьИТаможеннуюЦену(СтрокаТабличнойЧасти)()



Процедура ВыбратьАдресДоставкиДляРегионов(ТекущаяСтрока, СтандартнаяОбработка, ЭтаФорма, Контрагент) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Контрагент.Пустая() Тогда
		Возврат
	КонецЕсли;
	
	ФормаВыбора = РегистрыСведений.КонтактнаяИнформация.ПолучитьФормуСписка("ФормаСписка", ЭтаФорма);
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.мВозвратДанныхКонтактнойИнформации = Истина;
	
	ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Значение = Контрагент;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Использование = Истина;
	
	СтруктураОтбораАдресов = Новый СписокЗначений;
	СтруктураОтбораАдресов.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Значение = СтруктураОтбораАдресов;
	ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Использование = Истина;
	ФормаВыбора.ЭлементыФормы.РегистрСведенийСписок.Колонки.Тип.Видимость = Ложь;
	
	СтруктураАдреса = ФормаВыбора.ОткрытьМодально();
	
	// Устанавливаем адрес доставки и его комментарий
	Если СтруктураАдреса <> Неопределено Тогда
		
		ТекущаяСтрока.Адрес = УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(СтруктураАдреса);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьАптекиКонтрагента(Контрагент) Экспорт
	
	Если Контрагент.Пустая() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СпрАптеки = Справочники.Аптеки;
	Выборка = СпрАптеки.Выбрать(,Контрагент);
	
	Если НЕ Выборка.Следующий() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции


Процедура ИнвентироватьПроцентСкидкиНаценки(Объект, ТаблицаТоваров, ТекущаяСтрока, ТекущаяКолонка) Экспорт
	
	Если ТекущаяКолонка = "Наценка" Тогда
		
		ТекущаяСтрока.ПроцентСкидкиНаценки = ТекущаяСтрока.Наценка * -1;
		
	ИначеЕсли ТекущаяКолонка = "ПроцентСкидкиНаценки" Тогда
		
		ТекущаяСтрока.Наценка = ТекущаяСтрока.ПроцентСкидкиНаценки * -1;	
		
	КонецЕсли;
	//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(ТекущаяСтрока, Объект);
	//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(ТекущаяСтрока, Объект);
	//РасчитатьОтпускнуюЦенуДокумента(ТекущаяСтрока);
	
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		
		Если ТекСтрока <> ТекущаяСтрока И ТекСтрока.Наценка = 0 Тогда
			
			ТекСтрока.Наценка 				= ТекущаяСтрока.Наценка;	
			ТекСтрока.ПроцентСкидкиНаценки 	= ТекущаяСтрока.ПроцентСкидкиНаценки;	
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(ТекСтрока, Объект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Объект);
			//РасчитатьОтпускнуюЦенуДокумента(ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьСкидкуНаЦену(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, МетаданныеДокумента, СпособРасчета = Неопределено) Экспорт
	
	НадоПерерасчет = Истина;
	
	Если НадоПерерасчет Тогда
		
		Если (СпособРасчета = Неопределено)
		 Или (СпособРасчета = Перечисления.СпособРасчетаСуммыДокумента.СУчетомВсехСкидок)
		 Или (СпособРасчета = Перечисления.СпособРасчетаСуммыДокумента.БезУчетаРучнойСкидки) Тогда
			Если (СпособРасчета <> Перечисления.СпособРасчетаСуммыДокумента.БезУчетаРучнойСкидки)Тогда
				Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Наценка", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
					
					Попытка
						НацененнаяЦена 				= Окр(СтрокаТабличнойЧасти.Цена + СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Наценка / 100, 2);						
						СтрокаТабличнойЧасти.Сумма	= НацененнаяЦена * СтрокаТабличнойЧасти.Количество;		
					Исключение
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры


Процедура РасчитатьОтпускнуюЦенуДокумента(СтрокаТабличнойЧасти) Экспорт
	
	Попытка
		Если СтрокаТабличнойЧасти.Количество = 0 Тогда
			
			СтрокаТабличнойЧасти.ОтпускнаяЦена = 0;
			Возврат;
			
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ОтпускнаяЦена = Окр(СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество,2); 	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПересчитатьОтпускнуюЦенуДокумента(ТабличнаяЧасть) Экспорт
	
	Для Каждого СтрокаТабличнойЧасти ИЗ ТабличнаяЧасть Цикл
		
		Если СтрокаТабличнойЧасти.Количество = 0 Тогда
			
			ОтпускнаяЦена = 0;
			
			Если СтрокаТабличнойЧасти.ОтпускнаяЦена <> ОтпускнаяЦена Тогда
				
				СтрокаТабличнойЧасти.ОтпускнаяЦена = ОтпускнаяЦена;
				
			КонецЕсли;
			
			Продолжить;		
			
		КонецЕсли;
		
		//... получим цену сразу
		ОтпускнаяЦена = Окр(СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество,2); 	
		
		Если СтрокаТабличнойЧасти.ОтпускнаяЦена <> ОтпускнаяЦена Тогда
			
			СтрокаТабличнойЧасти.ОтпускнаяЦена = ОтпускнаяЦена;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

//используется в РеализацииТоваровУслуг  (вытянул из списания партий в БУ)
Функция ВычислитьСебестоимостьТовара(СтрокаТовар,ДокументОбъект)   Экспорт 
	
	СебестоимостьПозиции = 0;
	
	Запрос = Новый Запрос;
	
	ВидСубконтоНоменклатура          = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура;
	ВидСубконтоПартии                = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии;
	ВидСубконтоСклады                = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады;
	ВидСубконтоКонтрагенты           = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты;
	ВидСубконтоОтгрузки              = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами;
	ВидСубконтоНоменклатурныеПозиции = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции;
	
	ВидыСубконтоНСПД = Новый Массив;
	ВидысубконтоНСПД.Добавить(ВидСубконтоНоменклатура);
	ВидысубконтоНСПД.Добавить(ВидСубконтоПартии);
	ВидысубконтоНСПД.Добавить(ВидСубконтоСклады);
	ВидысубконтоНСПД.Добавить(ВидСубконтоНоменклатурныеПозиции);
	
	МоментКон = ДокументОбъект.МоментВремени();
	
	НалоговыеНазначения = Новый Массив;
	НалоговыеНазначения.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НайтиПоКоду("000031"));//	"Необл. НДС, любая хоз.;
	НалоговыеНазначения.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НайтиПоКоду("000033"));//	"Обл. НДС";
	
	Номенклатура = Новый Массив;
	Номенклатура.Добавить(СтрокаТовар.Номенклатура);
	
	Организации = Новый Массив;
	Организации.Добавить(ДокументОбъект.Организация);
	
	ПустаяДата = Дата("00010101");
	ПустаяОтгрузка = Документы.ДокументРасчетовСКонтрагентом.ПустаяСсылка();
	
	Склады = Новый Массив;
	//Серж
	//Склады.Добавить(ДокументОбъект.Склад);
	Склады.Добавить(СтрокаТовар.Склад);
	//...Серж
	
	СчетаУчетаНСПД = Новый СписокЗначений;
	СчетаУчетаНСПД.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладе);//281
	
	Запрос.УстановитьПараметр("ВидысубконтоНСПД", ВидысубконтоНСПД);
	Запрос.УстановитьПараметр("МоментКон", МоментКон);
	Запрос.УстановитьПараметр("НалоговыеНазначения", НалоговыеНазначения);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.УстановитьПараметр("ПустаяОтгрузка", ПустаяОтгрузка);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("СчетаУчетаНСПД", СчетаУчетаНСПД);
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.Счет КАК СчетУчета,
	|	Остатки.Субконто1 КАК Номенклатура,
	|	Остатки.Субконто4.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Остатки.Субконто4.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Остатки.Субконто4.ЗаказПокупателя КАК ЗаказПокупателя,
	|	0 КАК СовпалЗаказ,
	|	Остатки.Субконто4.Качество КАК Качество,
	|	Остатки.Субконто4 КАК НоменклатурнаяПозиция,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДокументОприходованияДата,
	|	Остатки.Субконто2 КАК ДокументОприходования,
	|	&ПустаяДата КАК ДокументОтгрузкиДата,
	|	&ПустаяОтгрузка КАК ДокументОтгрузки,
	|	Остатки.Субконто3 КАК Склад,
	|	Остатки.Организация КАК Организация,
	|	Остатки.НалоговоеНазначение КАК НалоговоеНазначение,
	|	СУММА(ВЫБОР
	|			КОГДА Остатки.КоличествоОстатокДт ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ Остатки.КоличествоОстатокДт
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА Остатки.СуммаОстатокДт ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ Остатки.СуммаОстатокДт
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Остатки.СуммаНУОстатокДт ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ Остатки.СуммаНУОстатокДт
	|		КОНЕЦ) КАК СтоимостьНУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&МоментКон,
	|			Счет В (&СчетаУчетаНСПД),
	|			&ВидысубконтоНСПД,
	|			Субконто1 В (&Номенклатура)
	|				И Субконто3 В (&Склады)
	|				И Организация В (&Организации)
	|				И НалоговоеНазначение В (&НалоговыеНазначения)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Счет,
	|	Остатки.Субконто1,
	|	Остатки.Субконто2,
	|	Остатки.Субконто3,
	|	Остатки.Субконто4.ХарактеристикаНоменклатуры,
	|	Остатки.Субконто4.СерияНоменклатуры,
	|	Остатки.Субконто4.ЗаказПокупателя,
	|	Остатки.Субконто4.Качество,
	|	Остатки.Субконто4,
	|	Остатки.Организация,
	|	Остатки.НалоговоеНазначение
	|ИТОГИ ПО
	|	Номенклатура";
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НоменклатурнаяПозиция.СерияНоменклатуры = СтрокаТовар.СерияНоменклатуры 
				и ВыборкаДетальныеЗаписи.НоменклатурнаяПозиция.ХарактеристикаНоменклатуры = СтрокаТовар.ХарактеристикаНоменклатуры
				и ВыборкаДетальныеЗаписи.Количество <> 0 Тогда
				
				СебестоимостьПозиции = Окр(ВыборкаДетальныеЗаписи.Стоимость/ВыборкаДетальныеЗаписи.Количество,2);
				
			КонецЕсли;
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
	КонецЦикла;
	
	Возврат СебестоимостьПозиции;
	
КонецФункции // ВычислитьСебестоимостьТовара(СтрокаТовар,ЭтотОбъект)()


//записываем цены поступления в долларах
Процедура ЗаписатьЦеныПоступленияВДолларах(ДокументОбъект) Экспорт 
	
	Если ДокументОбъект.Товары.Количество()=0 Тогда
		Возврат;	
	КонецЕсли;
	
	ВалютаГривна = Справочники.Валюты.НайтиПоКоду("980");//грн
	ВалютаДоллар =  Справочники.Валюты.НайтиПоКоду("840");//USD
	
	Если ДокументОбъект.ВалютаДокумента<>ВалютаГривна и  ДокументОбъект.ВалютаДокумента<>ВалютаДоллар  Тогда
		//Предупреждение("В этом режиме можно установить цены только если валюта документа гривна или доллар");
		Возврат;
	КонецЕсли;
	
	ТипЦенПоступлениеВДолларах = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000004");//Цена поступления USD	
	КурсВалютыЧисло = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДоллар,ДокументОбъект.Дата)["Курс"];
	
	УстановкаЦенОбъект = НайтиУстановкуЦен(ДокументОбъект);
	Если УстановкаЦенОбъект=Неопределено Тогда
		УстановкаЦенОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	КонецЕсли;
	
	УстановкаЦенОбъект.Дата = ДокументОбъект.Дата;
	УстановкаЦенОбъект.ДокументОснование = ДокументОбъект.Ссылка;
	УстановкаЦенОбъект.Комментарий = "Создан автоматически при проведении "+ДокументОбъект.Ссылка;
	
	//очищаем все значения (если документ уже существует)
	УстановкаЦенОбъект.ТипыЦен.Очистить();
	УстановкаЦенОбъект.Товары.Очистить();
	
	СтрокаТипыЦен = УстановкаЦенОбъект.ТипыЦен.Добавить();
	СтрокаТипыЦен.ТипЦен = ТипЦенПоступлениеВДолларах;
	
	               
	Для каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
		//при возврате записываем цены только для вновь созданной характеристики
		Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") 
			и Сред(СтрокаТовары.ХарактеристикаНоменклатуры.Наименование,1,2) <> "ВН" Тогда
			Продолжить;
		КонецЕсли;
		//Леонид 111213
		Если СтрокаТовары.Номенклатура.ВидНоменклатуры<>Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001") Тогда  //товар
			Продолжить;
		КонецЕсли;
		//...Леонид 111213
		
		НоваяСтрокаТоваров = УстановкаЦенОбъект.Товары.Добавить();
		НоваяСтрокаТоваров.Номенклатура = СтрокаТовары.Номенклатура;
		НоваяСтрокаТоваров.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		НоваяСтрокаТоваров.Валюта = ВалютаДоллар;
		НоваяСтрокаТоваров.ИндексСтрокиТаблицыЦен = 0;
		НоваяСтрокаТоваров.ТипЦен = ТипЦенПоступлениеВДолларах;
		НоваяСтрокаТоваров.ЕдиницаИзмерения = СтрокаТовары.ЕдиницаИзмерения;
		НоваяСтрокаТоваров.СпособРасчетаЦены = ТипЦенПоступлениеВДолларах.СпособРасчетаЦены;
		
		Если ДокументОбъект.ВалютаДокумента = ВалютаДоллар  Тогда
			НоваяСтрокаТоваров.Цена = СтрокаТовары.Цена;
		ИначеЕсли ДокументОбъект.ВалютаДокумента = ВалютаГривна тогда	
			НоваяСтрокаТоваров.Цена = Окр(СтрокаТовары.Цена/КурсВалютыЧисло,2);
		КонецЕсли;
	КонецЦикла; 
	
	//проверяем на заполненность товаров в установке цен
	Если УстановкаЦенОбъект.Товары.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	//убираем дубли
	ТаблицаПодготовленная = УстановкаЦенОбъект.Товары.Выгрузить();
	ТаблицаПодготовленная.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,Валюта,ИндексСтрокиТаблицыЦен,ТипЦен,ЕдиницаИзмерения,СпособРасчетаЦены,Цена");
	УстановкаЦенОбъект.Товары.Загрузить(ТаблицаПодготовленная);	
	
	Попытка
		//Серж
		//УстановкаЦенОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		УстановкаЦенОбъект.Записать(РежимЗаписиДокумента.Запись);
		//...Серж
	Исключение
		Сообщить("Не удалось записать и провести установку цен поступления в долларах!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;	
	 Сообщить("Записан документ "+УстановкаЦенОбъект);
	
КонецПроцедуры

Функция НайтиУстановкуЦен(ДокументОбъект)
	
	СписокТиповЦен = Новый СписокЗначений;
	СписокТиповЦен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000004"));//Цена поступления USD
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.ДокументОснование = &ДокументОснование
	|	И УстановкаЦенНоменклатуры.ТипыЦен.ТипЦен В (&ТипЦен)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОбъект.ссылка);
	Запрос.УстановитьПараметр("ТипЦен",СписокТиповЦен );
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
	иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции // НайтиСоздатьУстановкуЦен(ДокументОбъект)()

//============================ПРОЦЕДУРЫ АВТОМАТИЧЕСКОЙ РАССЫЛКИ ДОКУМЕНТОВ====================================
#Если Клиент Тогда

Функция ПолучитьГруппуПисемУчетнойЗаписи(УчетнаяЗапись, НаименованиеГруппы)
	ГруппыПисем = Справочники.ГруппыПисемЭлектроннойПочты;
	Возврат ГруппыПисем.НайтиПоНаименованию(НаименованиеГруппы,Истина,,УчетнаяЗапись);
КонецФункции	
	
Функция ПолучитьНазваниеДокумента(НазваниеФайла) 
	
	Если НазваниеФайла = "Накладная_2" Тогда
		
		Возврат "'ОЛФА' Расходная накладная № ";
		
	ИначеЕсли НазваниеФайла = "Накладная" Тогда
		
		Возврат "'ОЛФА' Расходная накладная №";
		
	ИначеЕсли НазваниеФайла = "Акт" Тогда
		
		Возврат "'ОЛФА' Акт об оказании услуг №";	
		
	ИначеЕсли НазваниеФайла = "Сертификаты" Тогда
		
		Возврат "'ОЛФА' Печать сертификатов по расходной накладной №";
		
	ИначеЕсли НазваниеФайла = "Реестр" Тогда
		
		Возврат "'ОЛФА' Реестр № ";
		
	ИначеЕсли НазваниеФайла = "АдресДоставки" Тогда
		
		Возврат "'ОЛФА' Адрес доставки по расходной накладной № ";
		
	ИначеЕсли НазваниеФайла = "СчетФактура" Тогда
		
		Возврат "'ОЛФА' Счет-фактура № ";
		
	ИначеЕсли НазваниеФайла = "Бланк" Тогда
		
		Возврат "'ОЛФА' Бланк товарного наполнения № ";
		
	ИначеЕсли НазваниеФайла = "СерийныеНомера" Тогда
		
		Возврат "'ОЛФА' Список серийных номеров по расходной накладной № ";
		
	ИначеЕсли НазваниеФайла = "РасходСРозничныхСкладовВЦенахАТТ" Тогда
		
		Возврат "Расход с розничных складов в ценах АТТ";
		
	ИначеЕсли НазваниеФайла = "ТТН" Тогда
		
		Возврат "'ОЛФА' ТТН по расходной накладной № ";
		
	ИначеЕсли НазваниеФайла = "ТТН" Тогда
		
		Возврат "'ОЛФА' Налоговая накладная № ";
		
	КонецЕсли;		
	
	Возврат НазваниеФайла;
	
КонецФункции

Процедура ЗаписатьПечатнуюФормуВФайл(Ссылка, НазваниеФайла, ТабДокумент) Экспорт
	
	КаталогСохранения = КаталогВременныхФайлов()+"\Docs";
	
	МассивНайденныхКаталогов = НайтиФайлы(КаталогСохранения);
	
	Если МассивНайденныхКаталогов.Количество() = 0 Тогда
		
		СоздатьКаталог(КаталогСохранения);
				
	КонецЕсли;
	
	НазваниеФайла = ПолучитьНазваниеДокумента(НазваниеФайла);
	
	Если ТипЗнч(Ссылка) = Тип("Дата") Тогда
		
		ПолныйПутьФайла = КаталогСохранения +"\"+ НазваниеФайла + "_" + Формат(Ссылка,"ДЛФ=ДД")+".XLS"; 
		
	Иначе
		
		ПолныйПутьФайла = КаталогСохранения +"\"+ НазваниеФайла + "" + СокрЛП(Ссылка.Номер)+".XLS"; 	
		
	КонецЕсли;
	
	Если ТипЗнч(ТабДокумент) = Тип("ТабличныйДокумент") Тогда
		
		ТабДокумент.Записать(ПолныйПутьФайла,ТипФайлаТабличногоДокумента.XLS97);
        УстановитьПарольНаИзмененияФайла(ПолныйПутьФайла);
			
	КонецЕсли;
	
КонецПроцедуры

//Юрий -- 26.01.2011 {UASOFT}
Процедура УстановитьПарольНаИзмененияФайла(ПутьКФайлу) Экспорт
	
	ФайлЭксель = Новый Файл(ПутьКФайлу);
	
	Если ФайлЭксель.Существует() Тогда
	
		Попытка
			
			Эксель = Новый COMОбъект("Excel.Application");
	
			Книга 	= Эксель.WorkBooks.Open(ПутьКФайлу); 
			Лист 	= Книга.WorkSheets(1); 
			
			ЗащитаЭкселя = Лист.Protect("sook",,,,,,1,1); //Пароль на изменение, можем форматировать колонки и столбики
			
			Книга.Save();
			Эксель.Quit();
			
		Исключение
			Предупреждение("ОШИБКА ФУНКЦИИ ЗАЩИТЫ ФАЙЛА EXCEL!" + Символы.ПС + ОписаниеОшибки() + " Программа Exсel не установлена на данном компьютере!");
			Возврат;
		КонецПопытки;
	    				
	КонецЕсли;
	
КонецПроцедуры
//...Юрий -- 26.01.2011 {UASOFT}

Процедура ОтослатьДокументы(Объект, Email, КомуОтсылаем, ОткрыватьЭлектронноеПисьмо = Ложь ,КомуКопии = "", ЗапрашиватьТему = Ложь, ТемаИТекстПисьма = "") Экспорт
	
	Если НЕ ПустаяСтрока(Email) ИЛИ ОткрыватьЭлектронноеПисьмо Тогда
		
		СписокАдресовДляОтправки = РазобратьEMailАдреса(СокрЛП(Email));
		
		Если СписокАдресовДляОтправки.Количество() > 0 ИЛИ ОткрыватьЭлектронноеПисьмо Тогда
			
			//КомуАдресЭлектроннойПочты = КомуОтсылаем;
			КомуАдресЭлектроннойПочты = Email;
			
			УчетнаяЗаписьОтКого = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУчетнаяЗапись");
			
			КаталогСохранения = КаталогВременныхФайлов()+"\Docs";
						
			МассивФайловОтправки = НайтиФайлы(КаталогСохранения,"*.*");//Ищем все что есть!!!!!!!!
			
			Если НЕ ЗначениеЗаполнено(УчетнаяЗаписьОтКого) Тогда
				
				Предупреждение("Для текущего пользователя не задана учетная запись электронной почты!");
				Возврат;
				
			КонецЕсли;
			
			Если МассивФайловОтправки.Количество() = 0 Тогда
				
				Сообщить("Нету файлов для отправки!",СтатусСообщения.Важное);
				Возврат;
				
			КонецЕсли;
			
			Если ПустаяСтрока(ТемаИТекстПисьма) Тогда
				ТемаИТекстПисьма = СформироватьТемуПисьма(Объект);
			КонецЕсли;
			
			//Юрий -- 24.06.2010 {UASOFT}
			Если ЗапрашиватьТему Тогда
				
				ВведеннаяСтрока = ВвестиСтроку(ТемаИТекстПисьма, "Введите тему письма...");
	            							
			КонецЕсли;
			//...Юрий -- 24.06.2010 {UASOFT}
			
			ЭлектронноеПисьмо 				= Документы.ЭлектронноеПисьмо.СоздатьДокумент();
			ЭлектронноеПисьмо.Дата 			= ТекущаяДата();
			ЭлектронноеПисьмо.Тема 			= ТемаИТекстПисьма;
			ЭлектронноеПисьмо.ТекстПисьма 	= ТемаИТекстПисьма;
			ЭлектронноеПисьмо.Кому 			= КомуАдресЭлектроннойПочты;	
			ЭлектронноеПисьмо.Копии			= КомуКопии;	
			
			ЭлектронноеПисьмо.ОтправительИмя 					= УчетнаяЗаписьОтКого.Наименование;
			ЭлектронноеПисьмо.ОтправительАдресЭлектроннойПочты	= УчетнаяЗаписьОтКого.АдресЭлектроннойПочты;
			ЭлектронноеПисьмо.ОтправительПредставление 			= УчетнаяЗаписьОтКого.Наименование + " <" + УчетнаяЗаписьОтКого.АдресЭлектроннойПочты + ">";
			
			ЭлектронноеПисьмо.УчетнаяЗапись 		= УчетнаяЗаписьОтКого;
			ЭлектронноеПисьмо.ГруппаУчетнойЗаписи	= ПолучитьГруппуПисемУчетнойЗаписи(УчетнаяЗаписьОтКого, "Исходящие");
			ЭлектронноеПисьмо.Ответственный 		= глЗначениеПеременной("глТекущийПользователь");
			ЭлектронноеПисьмо.Комментарий 			= "Сформировано автоматически. Момент формирования: " + ТекущаяДата();
			ЭлектронноеПисьмо.СтатусПисьма 			= Перечисления.СтатусыПисем.Исходящее;
			ЭлектронноеПисьмо.ВидТекстаПисьма 		= Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
			ЭлектронноеПисьмо.ЕстьВложения 			= Истина;
			ИдентификаторПисьма 					= Строка(Новый УникальныйИдентификатор);
			ЭлектронноеПисьмо.ИдентификаторПисьма 	= ИдентификаторПисьма;
			
			Для Каждого ТекАдрес ИЗ СписокАдресовДляОтправки Цикл
			
				СтрокаКомуТЧ 						= ЭлектронноеПисьмо.КомуТЧ.Добавить();
				СтрокаКомуТЧ.Представление 			= КомуАдресЭлектроннойПочты + " <" + ТекАдрес + ">";;
				СтрокаКомуТЧ.АдресЭлектроннойПочты	= ТекАдрес;
				
			КонецЦикла;	
			
			ЭлектронноеПисьмо.Записать();
			
			Для Каждого ТекФайл ИЗ МассивФайловОтправки Цикл
				
				ВложениеЭлектронногоПисьма 				= Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
				ВложениеЭлектронногоПисьма.Объект 		= ЭлектронноеПисьмо.Ссылка;
				ВложениеЭлектронногоПисьма.ИмяФайла 	= ТекФайл.Имя;		
				ВложениеЭлектронногоПисьма.Хранилище 	= Новый ХранилищеЗначения(Новый ДвоичныеДанные(ТекФайл.ПолноеИмя));
				ВложениеЭлектронногоПисьма.Записать();	
				
				//Сразу удаляем файлы
				УдалитьФайлы(ТекФайл.ПолноеИмя);
				
			КонецЦикла;	
			
			
			Если ОткрыватьЭлектронноеПисьмо Тогда
				
				ЭлектронноеПисьмо.ПолучитьФорму().Открыть();	
				
			Иначе
				
				//...Отправляем
				ЭлектронноеПисьмо.ОтправитьПисьмо();
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли; 				
	
КонецПроцедуры

Функция РазобратьEMailАдреса(СтрокаАдресовЭлектроннойПочты) Экспорт
	
	//Будем считать, что адреса разделяются символом ";"
	
	СписокАдресовДляОтправки = Новый СписокЗначений;
    
	ПозицияРазделителяАдресов = 100;
	
	Пока ПозицияРазделителяАдресов <> 0 Цикл
		
		ДлиннаСтрокиСАдресами = СтрДлина(СокрЛП(СтрокаАдресовЭлектроннойПочты));
		
		//... найдем первый разделитель
		ПозицияНайденногоРазделителя = Найти(СтрокаАдресовЭлектроннойПочты,";");
		
		Если ПозицияНайденногоРазделителя = 0 Тогда
			//... разделителя не нашли, адрес один всего
			
			СписокАдресовДляОтправки.Добавить(СокрЛП(СтрокаАдресовЭлектроннойПочты));
						
		Иначе	
			//... нашли символ разделителя
			
			СтрокаАдреса = СокрЛП(Лев(СтрокаАдресовЭлектроннойПочты,ПозицияНайденногоРазделителя - 1));
			СписокАдресовДляОтправки.Добавить(СтрокаАдреса);
			СтрокаАдресовЭлектроннойПочты = Сред(СтрокаАдресовЭлектроннойПочты,ПозицияНайденногоРазделителя + 1,ДлиннаСтрокиСАдресами - ПозицияНайденногоРазделителя + 1);
		
		КонецЕсли;
		
		ПозицияРазделителяАдресов = ПозицияНайденногоРазделителя;
		
	КонецЦикла;
	
	Возврат СписокАдресовДляОтправки;		
	
КонецФункции

Функция СформироватьТемуПисьма(Объект) Экспорт
	
	СтрокаТемы = "";
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПокупателя")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		СтрокаТемы = НСтр("ru='Пакет документов по : ';uk='Пакет документів по: '",КодЯзыкаПечать)+Объект.Ссылка;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Сделка) Тогда
			
			СтрокаТемы = НСтр("ru='Пакет документов по : ';uk='Пакет документів по: '",КодЯзыкаПечать)+Объект.Ссылка;
			
		Иначе
			
			Если ТипЗнч(Объект.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				
				СтрокаТемы = НСтр("ru='Пакет документов по : ';uk='Пакет документів по: '",КодЯзыкаПечать)+Объект.Сделка;	
				
			Иначе
				
				СтрокаТемы = НСтр("ru='Пакет документов по : ';uk='Пакет документів по: '",КодЯзыкаПечать)+Объект.Ссылка;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Строка") Тогда
		
		СтрокаТемы = НСтр("ru='Рассылка документов от : ';uk='Розсилка документів від : '",КодЯзыкаПечать)+УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");;		
		
	Иначе
		
		СтрокаТемы = НСтр("ru='Рассылка документов от : ';uk='Розсилка документів від : '",КодЯзыкаПечать)+Объект.Организация;	
		
	КонецЕсли;	
	
	Возврат СтрокаТемы; 
	
КонецФункции
#КонецЕсли
//...============================ПРОЦЕДУРЫ АВТОМАТИЧЕСКОЙ РАССЫЛКИ ДОКУМЕНТОВ====================================


//uasoft Леонид 26.01.2014 15:33:20
//========== ПРОЦЕДУРЫ РАБОТЫ С ПРИНТЕРАМИ СИСТЕМЫ ==================================
Функция ПолучитьПринтерПоУмолчанию() Экспорт
    
    Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
    Скрипт.Language = "vbscript";                 
    Скрипт.AddCode("
         |Function GetDefaultPrinter()
         |GetDefaultPrinter=vbNullString
         |Set objWMIService=GetObject(""winmgmts:"" _
         |& ""{impersonationLevel=impersonate}!\\.\root\cimv2"")
         |Set colInstalledPrinters=objWMIService.ExecQuery _
         |(""Select * from Win32_Printer"")
         |For Each objPrinter in colInstalledPrinters
         |If objPrinter.Attributes and 4 Then
         |GetDefaultPrinter=objPrinter.Name
         |Exit For
         |End If
         |Next
         |End Function");
         
    Возврат СокрЛП(Скрипт.run("GetDefaultPrinter"));
    
КонецФункции

Функция ПолучитьПринтерыСистемы() Экспорт
	
	СписокПринтеров = Новый СписокЗначений;
	
	Принтеры 			= Новый COMОбъект("WScript.Network");
    АктивныеПринтеры	= Принтеры.EnumPrinterConnections();
    i = 0;
    Пока i < АктивныеПринтеры.Count() - 1 Цикл
        СписокПринтеров.Добавить(АктивныеПринтеры.Item(i + 1));
        i = i + 2;
    КонецЦикла;
	
	Возврат СписокПринтеров;
	
КонецФункции

Процедура ПечатьСертификатов(Серии = Неопределено, СтруктураОформленияДокументов = Неопределено) Экспорт

	ОбработкиСертификатов = Обработки.ПечатьСертификатов.Создать();
	Если ТипЗнч(Серии) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Серии) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ОбработкиСертификатов.ВнешнийДокумент = Серии;
	ИначеЕсли ТипЗнч(Серии) = Тип ("СправочникСсылка.СерииНоменклатуры") Тогда
		ОбработкиСертификатов.ВнешнийЭлементСерии = Серии;
	КонецЕсли;
	
	Если СтруктураОформленияДокументов = Неопределено Тогда
		
		ФормаОбработкиСертификатов = ОбработкиСертификатов.ПолучитьФорму();
		ФормаОбработкиСертификатов.Открыть();
		
	Иначе
		
		ФормаОбработкиСертификатов = ОбработкиСертификатов.ПолучитьФорму("Форма",,СтруктураОформленияДокументов);
		ФормаОбработкиСертификатов.Открыть();
		
	КонецЕсли;

КонецПроцедуры // ПечатьЭтикеток()

Процедура ПриВыводеСтрокиСерий(ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки.РазрешеноПродажу И НЕ ДанныеСтроки.Фальсификат Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли ДанныеСтроки.Фальсификат Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Красный;	
	ИначеЕсли НЕ ДанныеСтроки.РазрешеноПродажу Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Серый;	
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеПризнакомЕстьОригинал(ДокументСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДокумент 							= ДокументСсылка.ПолучитьОбъект();
	ОбъектДокумент.ЕстьОригинал				= НЕ ОбъектДокумент.ЕстьОригинал;
	ОбъектДокумент.ОбменДанными.Загрузка	= Истина;
	ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры


Процедура ПечатьЗаключений(Характеристики = Неопределено, СтруктураОформленияДокументов = Неопределено) Экспорт

	ОбработкиЗаключений = Обработки.ПечатьЗаключений.Создать();
	Если ТипЗнч(Характеристики) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Характеристики) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ОбработкиЗаключений.ВнешнийДокумент = Характеристики;
	ИначеЕсли ТипЗнч(Характеристики) = Тип ("СправочникСсылка.СерииНоменклатуры") Тогда
		ОбработкиЗаключений.ВнешнийЭлементСерии = Характеристики;
	КонецЕсли;
	
	Если СтруктураОформленияДокументов = Неопределено Тогда
		
		ФормаОбработкиЗаключений = ОбработкиЗаключений.ПолучитьФорму();
		ФормаОбработкиЗаключений.Открыть();
		
	Иначе
		
		ФормаОбработкиСертификатов = ОбработкиЗаключений.ПолучитьФорму("Форма",,СтруктураОформленияДокументов);
		ФормаОбработкиСертификатов.Открыть();
		
	КонецЕсли;

КонецПроцедуры // ПечатьЭтикеток()

Процедура ПроверкаНаЗапретЗаписиДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РольДоступна("ЗапретЗаписиДокументов") Тогда
		#Если Клиент Тогда
			Предупреждение("Для пользователя действует запрет записи всех документов!");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписьюНалоговойНакладнойСуммаПревышенияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Источник.СуммаПревышения = Источник.Товары.Итог("СуммаПревышения")
							 + Источник.Услуги.Итог("СуммаПревышения")
							 + Источник.ОС.Итог(	"СуммаПревышения")
							 + Источник.НМА.Итог(	"СуммаПревышения");
	Источник.СуммаНДСПревышения = Источник.Товары.Итог("СуммаНДСПревышения")
								+ Источник.Услуги.Итог("СуммаНДСПревышения")
								+ Источник.ОС.Итог(	   "СуммаНДСПревышения")
								+ Источник.НМА.Итог(   "СуммаНДСПревышения");
КонецПроцедуры



//...uasoft Леонид 26.01.2014 15:33:26
