//Внимание! У общих модулей есть только раздел процедур и функций.      

////anr nic
//ТаблицаПоТоварам = ТоварныйОтчет.ПодготовитьТаблицуТоваров(ТаблицаПоТоварам, СтруктураШапкиДокумента);
////anr nic

////anr nic
//ТоварныйОтчет.ДвиженияПоРегистрам(Отказ, Движения, РежимПроведения, СтруктураШапкиДокумента);
////anr nic

Функция АБС(прЧисло)
	Возврат ?(прЧисло<0,-прЧисло,прЧисло);
КонецФункции

//взято из УТП
// Возвращает сокращенный уникальный идентификатор текущей конфигурации.
Функция ИДКонфигурации() Экспорт
	// Условие ИЛИ было добавлено для совместимости с данной конфигурацией
	Если Метаданные.Имя = "БухгалтерияДляУкраины" ИЛИ Метаданные.Имя = "БухгалтерияДляУкраиныБазовая" ИЛИ Метаданные.Имя = "РегламентированнаяОтчетность"  Тогда
		Возврат "БП";
	ИначеЕсли Метаданные.Имя = "ЗарплатаИУправлениеПерсоналомДляУкраины" Тогда
		Возврат "ЗУП";
	ИначеЕсли Метаданные.Имя = "УправлениеПроизводственнымПредприятиемДляУкраины" Тогда
		Возврат "УПП";
	ИначеЕсли (Метаданные.Имя = "BASУправлениеТорговымПредприятием") ИЛИ (Метаданные.Имя = "УправлениеТорговымПредприятиемДляУкраины") Тогда
		Возврат "УТП";	
	Иначе
		Возврат Метаданные.Имя;
	КонецЕсли;
КонецФункции // ИДКонфигурации()

//взято из УТП
// Возвращает номер редакции текущей конфигурации.
//  Номер редакции выделяется из полного номера версии конфигурации 
// и представляет собой все символы до второй точки.
//
Функция РедакцияКонфигурации() Экспорт
	
	Перем Версия;
	Перем ПерваяТочка;
	
	Версия = Метаданные.Версия;
	ПерваяТочка = Найти(Версия, ".");
	
	Возврат СокрЛП(Лев(Версия, Найти(Сред(Версия, ПерваяТочка + 1), ".") + ПерваяТочка - 1));
	
КонецФункции // РедакцияКонфигурации()

//взято из УТП
Функция ВедетсяСуммовойУчетПоСкладам(Счет) Экспорт
	
	УчетПоСкладам = Ложь;
	
	СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто");
	
	Если СтрокаВидаСубконто <> Неопределено Тогда
		УчетПоСкладам = СтрокаВидаСубконто.Суммовой;
	КонецЕсли;
	
	Возврат УчетПоСкладам;
	
КонецФункции // ВедетсяСуммовойУчетПоСкладам()

Функция НаСчетеВедетсяУчетПоСтатьямПриростаУбыли(Счет) Экспорт
	
	УчетПоСтатьям = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНалоговогоУчета, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			УчетПоСтатьям = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат УчетПоСтатьям;
	
КонецФункции

Функция НаСчетеВедетсяУчетПоВидамНалоговойДеятельности(Счет) Экспорт
	
	УчетПоВНД = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыНалоговойДеятельности, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			УчетПоВНД = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат УчетПоВНД;
	
КонецФункции

Функция НаСчетеВедетсяПартионныйУчет(Счет) Экспорт
	
	ПартионныйУчет = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			ПартионныйУчет = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПартионныйУчет;
	
КонецФункции // НаСчетеВедетсяПартионныйУчет()

Функция НаСчетеВедетсяУчетПоНоменклатурнымПозициям(Счет) Экспорт
	
	УчетПоНоменклатурнымПозициям = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			УчетПоНоменклатурнымПозициям = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат УчетПоНоменклатурнымПозициям;
	
КонецФункции

Функция НаСчетеВедетсяУчетПоОтгрузкам(Счет) 
	
	ПартионныйУчет = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			ПартионныйУчет = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПартионныйУчет;
	
КонецФункции // НаСчетеВедетсяПартионныйУчет()

Функция НаСчетеВедетсяУчетПоКонтрагентам(Счет)
	
	УчетПоКонтрагентам = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
	Иначе
		СтрокаВидаСубконто = Счет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
		
		Если СтрокаВидаСубконто <> Неопределено Тогда
			УчетПоКонтрагентам = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат УчетПоКонтрагентам;
	
КонецФункции // НаСчетеВедетсяУчетПоКонтрагентам()

Процедура ЗаполнитьСубконтоПоРеквизитам(ВидСубконто, Субконто, ЗначениеСубконто1, ЗначениеСубконто2, ЗначениеСубконто3, ЗначениеСубконто4)
	
	Если ЗначениеЗаполнено(ЗначениеСубконто1) И ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто1)) Тогда
		Субконто.Вставить(ВидСубконто.ВидСубконто, ЗначениеСубконто1);
		
	ИначеЕсли ЗначениеЗаполнено(ЗначениеСубконто2) И ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто2)) Тогда
		Субконто.Вставить(ВидСубконто.ВидСубконто, ЗначениеСубконто2);
		
	ИначеЕсли ЗначениеЗаполнено(ЗначениеСубконто3) И ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто3)) Тогда
		Субконто.Вставить(ВидСубконто.ВидСубконто, ЗначениеСубконто3);
		
	ИначеЕсли ЗначениеЗаполнено(ЗначениеСубконто4) И ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто4)) Тогда
		Субконто.Вставить(ВидСубконто.ВидСубконто, ЗначениеСубконто4);	
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает субконто на счете. Если такое субконто не счете
// отсутствует, то ничего не делается.
//
// Параметры:
//		Счет - Счет, к которому относится субконто
//      Субконто - вид субконто
//		Номер или имя установливаемого субконто
//      Значение субконто - значение устанавливаемого субконто
//
Процедура ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, СтрокаДокумента = Неопределено, СубконтоДт1 = Неопределено, СубконтоДт2 = Неопределено, СубконтоДт3 = Неопределено, СубконтоДт4 = Неопределено, СубконтоКт1 = Неопределено, СубконтоКт2 = Неопределено, СубконтоКт3 = Неопределено, СубконтоКт4 = Неопределено) Экспорт
	
	// Заполняем дебет:
	Если ЗначениеЗаполнено(Проводка.СчетДт) Тогда
		
		Для каждого ВидСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
			
			Если ЗначениеЗаполнено(СтрокаДокумента) Тогда
				
				Если ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.Номенклатура);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.Организация);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Склады")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.Склад);
					Если ЗначениеЗаполнено(прСтруктураШапкиДокумента.Склад) Тогда
						Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.Склад);
					КонецЕсли;
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
					Если ТипЗнч(прСтруктураШапкиДокумента.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
						Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.ДоговорКонтрагента.Владелец);
					КонецЕсли;
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.ДоговорКонтрагента);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ВидыНалоговойДеятельности")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.НалоговоеНазначение.ВидНалоговойДеятельности);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.НоменклатурныеГруппы")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.НоменклатурнаяГруппа);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаполнитьСубконтоПоРеквизитам(ВидСубконто, Проводка.СубконтоДт, СубконтоДт1, СубконтоДт2, СубконтоДт3, СубконтоДт4);
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполняем кредит
	Если ЗначениеЗаполнено(Проводка.СчетКт) Тогда
		
		Для каждого ВидСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
			
			Если ЗначениеЗаполнено(СтрокаДокумента) Тогда
				
				Если ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура")) Тогда
					Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.Номенклатура);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
					Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.Организация);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Склады")) Тогда
					Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.Склад);
					Если ЗначениеЗаполнено(прСтруктураШапкиДокумента.Склад) Тогда
						Проводка.СубконтоДт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.Склад);
					КонецЕсли;
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
					Если ТипЗнч(прСтруктураШапкиДокумента.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
						Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.ДоговорКонтрагента.Владелец);
					ИначеЕсли ТипЗнч(СубконтоКт1) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(СубконтоКт1) Тогда
						Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СубконтоКт1);
					ИначеЕсли ТипЗнч(СубконтоКт2) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(СубконтоКт2) Тогда
						Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СубконтоКт2);
					ИначеЕсли ТипЗнч(СубконтоКт3) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(СубконтоКт3) Тогда
						Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СубконтоКт3);
					КонецЕсли;
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
					Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, прСтруктураШапкиДокумента.ДоговорКонтрагента);
					
				ИначеЕсли ВидСубконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ВидыНалоговойДеятельности")) Тогда
					Проводка.СубконтоКт.Вставить(ВидСубконто.ВидСубконто, СтрокаДокумента.НалоговоеНазначение.ВидНалоговойДеятельности);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаполнитьСубконтоПоРеквизитам(ВидСубконто, Проводка.СубконтоКт, СубконтоКт1, СубконтоКт2, СубконтоКт3, СубконтоКт4);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСубконто()

//взято из БП

// Процедура устанавливает субконто на счете. Если такое субконто на счете
// отсутствует, то ничего не делается.
//
// Параметры:
//		Счет - Счет, к которому относится субконто
//      Субконто - набор субконто
//		Номер или имя установливаемого субконто
//      Значение субконто - значение устанавливаемого субконто
//
Процедура УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто, Сообщать = Ложь, Заголовок = "", ВидыСубконтоСчета = Неопределено) Экспорт
	
	Если Счет = Неопределено ИЛИ Счет.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидыСубконтоСчета = Неопределено Тогда
		ВидыСубконтоСчета = Счет.ВидыСубконто;
	КонецЕсли; 
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда
		
		Если ИмяСубконто > ВидыСубконтоСчета.Количество() Тогда
			Возврат;
		КонецЕсли;
		
		ВидСубк = ВидыСубконтоСчета[ИмяСубконто - 1].ВидСубконто;
		
	Иначе
		
		ВидСубк = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные[ИмяСубконто];
		
		Если ВидыСубконтоСчета.Найти(ВидСубк) = Неопределено Тогда
			//Если Сообщать тогда
			//	ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон(НСтр("ru='Вид субконто <¤1¤> для счета ""¤2¤ (¤3¤)"" не определен.';uk='Вид субконто <¤1¤> для рахунку ""¤2¤ (¤3¤)"" не визначений.'"), ВидСубк, Счет.Код, Счет.Наименование),, Заголовок );
			//КонецЕсли;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидСубк.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		Субконто.Вставить(ВидСубк, ЗначениеСубконто);
		
		//ИначеЕсли Сообщать тогда
		//	ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон(НСтр("ru='Неверное значение ""¤1¤"" для вида субконто <¤2¤>';uk='Невірне значення ""¤1¤"" для виду субконто <¤2¤>'"), ЗначениеСубконто, ВидСубк),, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСубконто()

// Функция возвращает счета учета номенклатры по выбранной организации.
//
// Параметры:
//  Организация         - организация, по которой определяются счета учета
//  Склад		        - место хранения, по которому определяются счета учета
//  Номенклатура        - номенклатура, по которой определяются счета учета
//
// Возвращаемое значение:
//  Структура - структура содержащая счета учета расчетов
// 
Функция ПолучитьСчетаУчетаНоменклатуры(Организация, Номенклатура, Склад = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("
	|СчетУчетаБУ, 
	|СчетУчетаДавСырья, 
	|СчетПередачиБУ, 
	|СчетУчетаДоп,   
	|СчетПередачиЗабБУ,
	|СхемаРеализации,
	|СтатьяПриростаУбылиЗапасов,
	|НалоговоеНазначение, 
	|УчитыватьКакЗапасНУ,
	|СубконтоБУ1, 
	|СубконтоБУ2, 
	|СубконтоБУ3,
	|Организация, 
	|Склад, 
	|ТипСклада, 
	|Номенклатура");
	
	
	МассивСклад			 = Новый Массив();
	МассивТипСклада		 = Новый Массив();
	МассивНоменклатура	 = Новый Массив();
	МассивОрганизация	 = Новый Массив();
	
	МассивСклад.Добавить(Справочники.Склады.ПустаяСсылка());
	МассивТипСклада.Добавить(Перечисления.ТипыСкладов.ПустаяСсылка());
	МассивНоменклатура.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	МассивОрганизация.Добавить(Справочники.Организации.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(Склад) Тогда
		МассивСклад.Добавить(Склад);
		МассивТипСклада.Добавить(?(Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый, Перечисления.ТипыСкладов.Оптовый, Перечисления.ТипыСкладов.Розничный));
	КонецЕсли;
	
	МассивНоменклатура.Добавить(Номенклатура);
	//СписокГрупп = УправлениеВзаиморасчетами.ПолучитьСписокВышестоящихГрупп(Номенклатура);
	СписокГрупп = ОбщегоНазначения.ПолучитьСписокВышестоящихГрупп(Номенклатура);
	Для каждого Элемент Из СписокГрупп Цикл
		МассивНоменклатура.Добавить(Элемент);
	КонецЦикла;
	
	МассивОрганизация.Добавить(Организация);
	
	ТестЗапрос = Новый Запрос();
	
	ТестЗапрос.УстановитьПараметр("Организация",        МассивОрганизация);
	ТестЗапрос.УстановитьПараметр("Номенклатура",       МассивНоменклатура);
	ТестЗапрос.УстановитьПараметр("Склад",			    МассивСклад);
	ТестЗапрос.УстановитьПараметр("ТипСклада",			МассивТипСклада);
	
	ТестЗапрос.Текст = "
	|ВЫБРАТЬ
	|	СчетаУчетаНоменклатуры.Организация КАК Организация,
	|	СчетаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СчетаУчетаНоменклатуры.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	СчетаУчетаНоменклатуры.Склад КАК Склад,
	|	СчетаУчетаНоменклатуры.ТипСклада КАК ТипСклада,
	|	СчетаУчетаНоменклатуры.СчетУчетаБУ КАК СчетУчетаБУ,
	|	СчетаУчетаНоменклатуры.СчетУчетаЗабалансовыйБУ КАК СчетУчетаЗабалансовыйБУ,
	|	СчетаУчетаНоменклатуры.СчетУчетаПередачиБУ КАК СчетУчетаПередачиБУ,
	|	СчетаУчетаНоменклатуры.СчетУчетаПередачиЗабалансовыйБУ КАК СчетУчетаПередачиЗабалансовыйБУ,
	|	СчетаУчетаНоменклатуры.СхемаРеализации КАК СхемаРеализации,
	|	СчетаУчетаНоменклатуры.СтатьяПриростаУбылиЗапасов КАК СтатьяПриростаУбылиЗапасов,
	|	СчетаУчетаНоменклатуры.НалоговоеНазначение КАК НалоговоеНазначение,
	|	СчетаУчетаНоменклатуры.УчитыватьКакЗапасНУ КАК УчитыватьКакЗапасНУ,
	|	СчетаУчетаНоменклатуры.СубконтоБУ1 КАК СубконтоБУ1,
	|	СчетаУчетаНоменклатуры.СубконтоБУ2 КАК СубконтоБУ2,
	|	СчетаУчетаНоменклатуры.СубконтоБУ3 КАК СубконтоБУ3
	|ИЗ
	|	РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|	
	|ГДЕ
	|	СчетаУчетаНоменклатуры.Организация В (&Организация)
	|	И СчетаУчетаНоменклатуры.Номенклатура В (&Номенклатура)
	|	И СчетаУчетаНоменклатуры.Склад В (&Склад)
	|	И СчетаУчетаНоменклатуры.ТипСклада В (&ТипСклада)";
	
	ТаблицаЗапроса = ТестЗапрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Колонки.Добавить("Глубина");
	Для Каждого Строка Из ТаблицаЗапроса Цикл
		Если Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Строка.Глубина = 0;
		Иначе
			Строка.Глубина = СтрДлина(Строка.Номенклатура.ПолныйКод());
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗапроса.Сортировать("Глубина Убыв, Склад Убыв, ТипСклада Убыв, Организация Убыв");
	
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		
		СведенияОСчетах = ТаблицаЗапроса[0];
		
		СтруктураВозврата.СчетУчетаБУ         = СведенияОСчетах.СчетУчетаБУ;
		СтруктураВозврата.СубконтоБУ1         = СведенияОСчетах.СубконтоБУ1;
		СтруктураВозврата.СубконтоБУ2         = СведенияОСчетах.СубконтоБУ2;
		СтруктураВозврата.СубконтоБУ3         = СведенияОСчетах.СубконтоБУ3;
		СтруктураВозврата.СчетУчетаДоп        = СведенияОСчетах.СчетУчетаЗабалансовыйБУ;
		СтруктураВозврата.СчетУчетаДавСырья   = СведенияОСчетах.СчетУчетаЗабалансовыйБУ;
		СтруктураВозврата.СчетПередачиБУ      = СведенияОСчетах.СчетУчетаПередачиБУ;
		СтруктураВозврата.СчетПередачиЗабБУ   = СведенияОСчетах.СчетУчетаПередачиЗабалансовыйБУ;
		СтруктураВозврата.СхемаРеализации     = СведенияОСчетах.СхемаРеализации;
		// параметры налогового учета
		СтруктураВозврата.СтатьяПриростаУбылиЗапасов    = СведенияОСчетах.СтатьяПриростаУбылиЗапасов;
		СтруктураВозврата.НалоговоеНазначение			= СведенияОСчетах.НалоговоеНазначение;
		СтруктураВозврата.УчитыватьКакЗапасНУ			= СведенияОСчетах.УчитыватьКакЗапасНУ;
		//измерения
		СтруктураВозврата.Номенклатура			= СведенияОСчетах.Номенклатура;
		СтруктураВозврата.Организация			= СведенияОСчетах.Организация;
		СтруктураВозврата.Склад					= СведенияОСчетах.Склад;
		СтруктураВозврата.ТипСклада				= СведенияОСчетах.ТипСклада;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСчетаУчетаНоменклатуры()



//// !!! надобы переделать Функция возвращает субконто по входной операции и складу.
////
//// Параметры:
////  прСклад         - место хранения, по которому определяются счета учета
////
//// Возвращаемое значение:
////  Структура - структура содержащая параметры учета
//// 
//Функция ПолучитьТО_ПараметрыКассовыхОпераций(прСклад = Неопределено, прСчетУчета = Неопределено) Экспорт

//	СтруктураВозврата = Новый Структура("
//	|Счет,
//	|КодУчета,
//	|ВидДок,
//	|Субконто1,
//	|Субконто2,
//	|Субконто3,
//	|СтатьяДвиженияДенежныхСредств,
//	|Склад");
//	

//	МассивСкладов = Новый Массив();
//	МассивСкладов.Добавить(Справочники.Склады.ПустаяСсылка());
//	
//	Если ЗначениеЗаполнено(прСклад) Тогда
//		МассивСкладов.Добавить(прСклад);
//		//СписокГрупп = ПолучитьСписокВышестоящихГрупп(прСклад);
//		Если ЗначениеЗаполнено(прСклад.Родитель) Тогда
//			МассивСкладов.Добавить(прСклад.Родитель);
//		КонецЕсли;
//		//Если ЗначениеЗаполнено(прСклад.Родитель.Родитель) Тогда
//		//	МассивСкладов.Добавить(прСклад.Родитель.Родитель);
//		//КонецЕсли;
//	КонецЕсли;
//	
//	МассивВидовДок = Новый Массив();
//	МассивВидовДок.Добавить("");
//	МассивВидовДок.Добавить("РасходныйКассовыйОрдер");
//	
//	ТестЗапрос = Новый Запрос();
//	ТестЗапрос.УстановитьПараметр("Склад",МассивСкладов);
//	ТестЗапрос.УстановитьПараметр("ВидДок",МассивВидовДок);
//	ТестЗапрос.УстановитьПараметр("СчетУчета",прСчетУчета);
//	
//	ТестЗапрос.Текст = "
//	|ВЫБРАТЬ
//	|	ТО_КассовыеОперации.Склад КАК Склад,
//	|	ТО_КассовыеОперации.Склад.ЭтоГруппа КАК ЭтоГруппа,
//	|	ТО_КассовыеОперации.КодУчета КАК КодУчета,
//	|	ТО_КассовыеОперации.ВидДок КАК ВидДок,
//	|	ТО_КассовыеОперации.Счет КАК Счет,
//	|	ТО_КассовыеОперации.Субконто1 КАК Субконто1,
//	|	ТО_КассовыеОперации.Субконто2 КАК Субконто2,
//	|	ТО_КассовыеОперации.Субконто3 КАК Субконто3,
//	|	ТО_КассовыеОперации.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
//	|ИЗ
//	|	РегистрСведений.ТО_КассовыеОперации КАК ТО_КассовыеОперации
//	|ГДЕ
//	|	ТО_КассовыеОперации.Склад В (&Склад)
//	|	И ТО_КассовыеОперации.ВидДок В (&ВидДок)
//	|	И ТО_КассовыеОперации.КодУчета В (&СчетУчета)";
//	
//	ТаблицаЗапроса = ТестЗапрос.Выполнить().Выгрузить();
//	ТаблицаЗапроса.Колонки.Добавить("Глубина");
//	Для Каждого Строка Из ТаблицаЗапроса Цикл
//		Если Строка.Склад = Справочники.Склады.ПустаяСсылка() Тогда
//			Строка.Глубина = 0;
//		Иначе
//			Строка.Глубина = СтрДлина(Строка.Склад.ПолныйКод());
//		КонецЕсли;
//	КонецЦикла;
//	
//	ТаблицаЗапроса.Сортировать("Глубина Убыв, Склад Убыв");

//	Если ТаблицаЗапроса.Количество() > 0 Тогда
//		лпВыборка = ТаблицаЗапроса[0];
//		// параметры для 
//		СтруктураВозврата.Счет           = лпВыборка.Счет;
//		СтруктураВозврата.Субконто1 = лпВыборка.Субконто1;
//		СтруктураВозврата.Субконто2 = лпВыборка.Субконто2;
//		СтруктураВозврата.Субконто3 = лпВыборка.Субконто3;
//		СтруктураВозврата.СтатьяДвиженияДенежныхСредств = лпВыборка.СтатьяДвиженияДенежныхСредств;
//		//измерения
//		СтруктураВозврата.Склад = лпВыборка.Склад;
//		СтруктураВозврата.КодУчета   = лпВыборка.КодУчета;
//		СтруктураВозврата.ВидДок   = лпВыборка.ВидДок;
//	КонецЕсли;

//	Возврат СтруктураВозврата;

//КонецФункции // ПолучитьТО_ПараметрыСкладов()

// Функция возвращает субконто по входной операции и складу.
//
// Параметры:
//  прСклад         - место хранения, по которому определяются счета учета
//
// Возвращаемое значение:
//  Структура - структура содержащая параметры учета
// 
Функция ПолучитьТО_ПараметрыКассовыхОпераций(прСклад = Неопределено, прКодУчета = Неопределено, прВидДок = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("
	|Счет,
	|КодУчета,
	|ВидДок,
	|Субконто1,
	|Субконто2,
	|Субконто3,
	|СтатьяДвиженияДенежныхСредств,
	|Склад");
	
	
	МассивСкладов = Новый Массив();
	МассивСкладов.Добавить(Справочники.Склады.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(прСклад) Тогда
		МассивСкладов.Добавить(прСклад);
		//СписокГрупп = ПолучитьСписокВышестоящихГрупп(прСклад);
		Если ЗначениеЗаполнено(прСклад.Родитель) Тогда
			МассивСкладов.Добавить(прСклад.Родитель);
		КонецЕсли;
		//Если ЗначениеЗаполнено(прСклад.Родитель.Родитель) Тогда
		//	МассивСкладов.Добавить(прСклад.Родитель.Родитель);
		//КонецЕсли;
	КонецЕсли;
	
	МассивВидовДок = Новый Массив();
	МассивВидовДок.Добавить("");
	Если ЗначениеЗаполнено(прВидДок) Тогда
		МассивВидовДок.Добавить(прВидДок);
	КонецЕсли;
	
	ТестЗапрос = Новый Запрос();
	ТестЗапрос.УстановитьПараметр("Склад",МассивСкладов);
	ТестЗапрос.УстановитьПараметр("ВидДок",МассивВидовДок);
	ТестЗапрос.УстановитьПараметр("КодУчета",прКодУчета);
	
	ТестЗапрос.Текст = "
	|ВЫБРАТЬ
	|	ТО_КассовыеОперации.Склад КАК Склад,
	|	ТО_КассовыеОперации.Склад.ЭтоГруппа КАК ЭтоГруппа,
	|	ТО_КассовыеОперации.КодУчета КАК КодУчета,
	|	ТО_КассовыеОперации.ВидДок КАК ВидДок,
	|	ТО_КассовыеОперации.Счет КАК Счет,
	|	ТО_КассовыеОперации.Субконто1 КАК Субконто1,
	|	ТО_КассовыеОперации.Субконто2 КАК Субконто2,
	|	ТО_КассовыеОперации.Субконто3 КАК Субконто3,
	|	ТО_КассовыеОперации.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	РегистрСведений.ТО_КассовыеОперации КАК ТО_КассовыеОперации
	|ГДЕ
	|	ТО_КассовыеОперации.Склад В (&Склад)
	|	И ТО_КассовыеОперации.ВидДок В (&ВидДок)
	|	И ТО_КассовыеОперации.КодУчета В (&КодУчета)";
	
	ТаблицаЗапроса = ТестЗапрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Колонки.Добавить("Глубина");
	Для Каждого Строка Из ТаблицаЗапроса Цикл
		Если Строка.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			Строка.Глубина = 0;
		Иначе
			Строка.Глубина = СтрДлина(Строка.Склад.ПолныйКод());
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗапроса.Сортировать("Глубина Убыв, Склад Убыв");
	
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		лпВыборка = ТаблицаЗапроса[0];
		// параметры для 
		СтруктураВозврата.Счет           = лпВыборка.Счет;
		СтруктураВозврата.Субконто1 = лпВыборка.Субконто1;
		СтруктураВозврата.Субконто2 = лпВыборка.Субконто2;
		СтруктураВозврата.Субконто3 = лпВыборка.Субконто3;
		СтруктураВозврата.СтатьяДвиженияДенежныхСредств = лпВыборка.СтатьяДвиженияДенежныхСредств;
		//измерения
		СтруктураВозврата.Склад = лпВыборка.Склад;
		СтруктураВозврата.КодУчета   = лпВыборка.КодУчета;
		СтруктураВозврата.ВидДок   = лпВыборка.ВидДок;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // 

////////////////////////////////////////////////////////////////////////////////
// 
// Функция возвращает параметры учета по выбранному складу.
//
// Параметры:
//  прСклад         - место хранения, по которому определяются счета учета
//
// Возвращаемое значение:
//  Структура - структура содержащая параметры учета
// 
Функция ПолучитьТО_ПараметрыСкладов(прСклад = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("
	|Касса,
	|КассаККМ,
	|ВидОплаты,
	|БанковскийСчетЭквайринга,
	|ДоговорЭквайринга,
	|Склад");
	
	
	МассивСкладов = Новый Массив();
	
	МассивСкладов.Добавить(Справочники.Склады.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(прСклад) Тогда
		МассивСкладов.Добавить(прСклад);
		//СписокГрупп = ПолучитьСписокВышестоящихГрупп(прСклад);
		Если ЗначениеЗаполнено(прСклад.Родитель) Тогда
			МассивСкладов.Добавить(прСклад.Родитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(прСклад.Родитель.Родитель) Тогда
			МассивСкладов.Добавить(прСклад.Родитель.Родитель);
		КонецЕсли;
	КонецЕсли;
	
	ТестЗапрос = Новый Запрос();
	ТестЗапрос.УстановитьПараметр("Склад",МассивСкладов);
	
	ТестЗапрос.Текст = "
	|ВЫБРАТЬ
	|	ТО_ПараметрыСкладов.Склад КАК Склад,
	|	ТО_ПараметрыСкладов.Склад.ЭтоГруппа КАК ЭтоГруппа,
	|	ТО_ПараметрыСкладов.Касса КАК Касса,
	|	ТО_ПараметрыСкладов.КассаККМ КАК КассаККМ,
	|	ТО_ПараметрыСкладов.ДоговорЭквайринга КАК ДоговорЭквайринга,
	|	ТО_ПараметрыСкладов.БанковскийСчетЭквайринга КАК БанковскийСчетЭквайринга,
	|	ТО_ПараметрыСкладов.ВидОплаты КАК ВидОплаты
	|ИЗ
	|	РегистрСведений.ТО_ПараметрыСкладов КАК ТО_ПараметрыСкладов
	|ГДЕ
	|	ТО_ПараметрыСкладов.Склад В (&Склад)";
	
	ТаблицаЗапроса = ТестЗапрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Колонки.Добавить("Глубина");
	Для Каждого Строка Из ТаблицаЗапроса Цикл
		Если Строка.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			Строка.Глубина = 0;
		Иначе
			Строка.Глубина = СтрДлина(Строка.Склад.ПолныйКод());
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗапроса.Сортировать("Глубина Убыв, Склад Убыв");
	
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		лпПараметрыСкладов = ТаблицаЗапроса[0];
		// параметры для ОтчетОРозничныхПродажах
		СтруктураВозврата.Касса          = лпПараметрыСкладов.Касса;
		СтруктураВозврата.КассаККМ          = лпПараметрыСкладов.КассаККМ;
		СтруктураВозврата.ДоговорЭквайринга = лпПараметрыСкладов.ДоговорЭквайринга;
		СтруктураВозврата.ВидОплаты         = лпПараметрыСкладов.ВидОплаты;
		СтруктураВозврата.БанковскийСчетЭквайринга         = лпПараметрыСкладов.БанковскийСчетЭквайринга;
		//измерения
		СтруктураВозврата.Склад = лпПараметрыСкладов.Склад;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТО_ПараметрыСкладов()

Функция ПолучитьДопРеквизитТабличнойЧастиСумма(прЭлементСправочника, прИмяТабличнойЧасти, прНоменклатура, прИмяДопРеквизита) Экспорт
	Для Каждого ТекущаяСтрока Из прЭлементСправочника.ДопКолонкиТабличнойЧасти Цикл
		Если (СокрЛП(ТекущаяСтрока.ИмяТабличнойЧасти) = прИмяТабличнойЧасти)И(ТекущаяСтрока.Номенклатура = прНоменклатура)И(СокрЛП(ТекущаяСтрока.ИмяДопРеквизита) = прИмяДопРеквизита) Тогда
			Возврат ТекущаяСтрока.СуммаДопРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьДопРеквизитТабличнойЧастиСумма()

Функция ПолучитьДопРеквизитШапкиСумма(прЭлементСправочника, прИмяДопРеквизита) Экспорт
	Для Каждого ТекущаяСтрока Из прЭлементСправочника.ДопШапкаДокумента Цикл
		Если (СокрЛП(ТекущаяСтрока.ИмяДопРеквизита) = прИмяДопРеквизита) Тогда
			Возврат ТекущаяСтрока.СуммаДопРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьДопРеквизитШапкиСумма()

Функция ПолучитьДопРеквизитШапкиЗначение(прЭлементСправочника, прИмяДопРеквизита) Экспорт
	Для Каждого ТекущаяСтрока Из прЭлементСправочника.ДопШапкаДокумента Цикл
		Если (СокрЛП(ТекущаяСтрока.ИмяДопРеквизита) = прИмяДопРеквизита) Тогда
			Возврат ТекущаяСтрока.ЗначениеДопРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьДопРеквизитШапкиЗначение()


// добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
// Виды документов: ПоступлениеТоваровУслуг, РеализацияТоваровУслуг, ВозвратТоваровПоставщику, ПеремещениеТоваров, , ,
// Искать:
// // Проверить заполнение ТЧ ...
// Добавить:
// //anr nic <<
//  ТаблицаПоТоварам = ТоварныйОтчет.ПодготовитьТаблицуТоваров(ТаблицаПоТоварам, СтруктураШапкиДокумента);
// //anr nic
Функция ПодготовитьТаблицуТоваров(прТаблицаТоваров, прСтруктураШапкиДокумента) Экспорт
	
	лпТаблицаТоваров = прТаблицаТоваров.Скопировать();
	
	// поиск по одному измерению или реквизиту 
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка = Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		Возврат лпТаблицаТоваров;
	Иначе
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	КонецЕсли;
	
	
	//ТО_СоответствияДокументов = РегистрыСведений.ТО_СоответствияДокументов;
	//лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	//ПараметрОтбора = Новый Структура("Документ");
	//ПараметрОтбора.Документ = лпДокСсылка; 
	//Выборка = ТО_СоответствияДокументов.Выбрать(ПараметрОтбора,);
	//Пока Выборка.Следующий() Цикл
	//	//Сообщить("Дата " + Выборка.Документ);
	//	лпДопДанныеДокументаСсылка = Выборка.ДопДанныеДокумента;
	//	Прервать;
	//КонецЦикла; 
	
	Если НЕ лпДопДанныеДокументаСсылка.Пустая() Тогда
		лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
		Если прСтруктураШапкиДокумента.ВидДокумента = "ПоступлениеТоваровУслуг" Тогда
			МетаданныеДокумента = лпДокСсылка.Метаданные();
			Если ИДКонфигурации() = "БП" Тогда
				Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
					Для Каждого Строка из лпТаблицаТоваров Цикл
						лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						//может не быть если учет в закуп. ценах
						Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
						Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
					КонецЦикла;
				КонецЕсли;
				//Строка.Себестоимость = лпСебестоимость;
			КонецЕсли;
			Если ИДКонфигурации() = "УТП" Тогда
				Если МетаданныеДокумента.Реквизиты.Найти("Склад") <> Неопределено Тогда
					Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
						Для Каждого Строка из лпТаблицаТоваров Цикл
							лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
							Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
							//Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
						КонецЦикла;
					КонецЕсли;
				ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("СкладОрдер") <> Неопределено Тогда
					Если лпДокСсылка.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
						Для Каждого Строка из лпТаблицаТоваров Цикл
							//ТорговаяНаценка = СтрокаТаблицы.СуммаПродажная - СтрокаТаблицы.ПроводкиСуммаБезНДСРегл;
							лпСебестоимость = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
							Строка.Стоимость = лпСебестоимость;
							Строка.СуммаУпр = лпСебестоимость;
							лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
							Строка.СуммаПродажная = лпСуммаРознУчетСНДС;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровПоставщику" Тогда
			Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Если ИДКонфигурации() = "УТП" Тогда
					Для Каждого Строка из лпТаблицаТоваров Цикл
						лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						Строка.СуммаПродажная = лпСуммаРознУчетСНДС;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровОтПокупателя" Тогда
			Для Каждого Строка из лпТаблицаТоваров Цикл
				// из-за проверки заполнения при проведении - заполняем и здесь.
				//лпСебестоимость = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
				//Строка.Себестоимость = лпСебестоимость;
				Если ИДКонфигурации() = "УТП" Тогда
					Если лпДокСсылка.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
						лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						//!!! с минусом получаются подходящие проводки, тоже самое при ручной установке цены розничной товара
						Строка.СуммаПродажная = -лпСуммаРознУчетСНДС;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "РеализацияТоваровУслуг" Тогда
			Для Каждого Строка из лпТаблицаТоваров Цикл
				Если ИДКонфигурации() = "БП" Тогда
					//Строка.Себестоимость = лпСебестоимость;
				ИначеЕсли ИДКонфигурации() = "УТП" Тогда
					лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
					Строка.СуммаПродажная = лпСуммаРознУчетСНДС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" Тогда
			// схема оптовый-розничный
			Если (лпДокСсылка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(лпДокСсылка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
					Строка.СуммаПродажнаяПолучателя = лпСуммаРознРеализацииСНДС;
					//Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
				КонецЦикла;
			КонецЕсли;
			// схема розничный-оптовый
			Если (лпДокСсылка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(лпДокСсылка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
					Строка.СуммаПродажнаяОтправителя = лпСуммаРознРеализацииСНДС;
					//Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
				КонецЦикла;
			КонецЕсли;
			
			//лпТаблицаТоваров.Колонки.Добавить("Себестоимость");
			//Для Каждого Строка из лпТаблицаТоваров Цикл
			//	лпСебестоимость = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			//	Строка.Себестоимость = лпСебестоимость;
			//КонецЦикла;
			//
			//// схема оптовый-оптовый
			//// ничего не делаем
			//
			//// схема оптовый-розничный
			//Если (лпДокСсылка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(лпДокСсылка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
			//	Для Каждого Строка из лпТаблицаТоваров Цикл
			//		лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			//		лпСуммаРознСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознСНДС");
			//		Если (лпСуммаРознСНДС <> лпСуммаРознУчетСНДС)И(лпСуммаРознСНДС <> 0) Тогда
			//			Строка.РозничнаяЦена = лпСуммаРознСНДС;
			//			Строка.УчетнаяЦена   = лпСуммаРознСНДС;
			//		Иначе	 
			//			Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
			//			Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
			//			//Строка.Себестоимость = лпСуммаРознУчетСНДС;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			//// схема розничный-розничный
			//Если (лпДокСсылка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(лпДокСсылка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
			//	Для Каждого Строка из лпТаблицаТоваров Цикл
			//		лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			//		лпСуммаРознСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознСНДС");
			//		Если (лпСуммаРознСНДС <> лпСуммаРознУчетСНДС)И(лпСуммаРознСНДС <> 0) Тогда
			//			Строка.РозничнаяЦена           = лпСуммаРознСНДС;
			//			Строка.УчетнаяЦена             = лпСуммаРознСНДС;
			//			Строка.РозничнаяЦенаПолучатель = лпСуммаРознСНДС;
			//		Иначе	 
			//			Строка.РозничнаяЦена           = лпСуммаРознУчетСНДС;
			//			Строка.УчетнаяЦена             = лпСуммаРознУчетСНДС;
			//			Строка.РозничнаяЦенаПолучатель = лпСуммаРознУчетСНДС;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			//
			//// схема розничный-оптовый
			//Если (лпДокСсылка.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(лпДокСсылка.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
			//	Для Каждого Строка из лпТаблицаТоваров Цикл
			//		лпСебестоимость     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			//		лпСуммаЗакСНДС      = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			//		лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			//		лпСуммаРознСНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознСНДС");
			//		Если (лпСуммаРознУчетСНДС = лпСуммаЗакСНДС) Тогда
			//			Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
			//			Строка.УчетнаяЦена   = лпСуммаРознУчетСНДС;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			
		КонецЕсли; //Если прСтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" Тогда
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ОтчетОРозничныхПродажах" Тогда
			//лпТаблицаТоваров.Колонки.Добавить("Себестоимость");
			Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСебестоимость = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
					Если ИДКонфигурации() = "БП" Тогда
						//Строка.Себестоимость = лпСебестоимость;
					ИначеЕсли ИДКонфигурации() = "УТП" Тогда
						//Строка.Стоимость = лпСебестоимость;
						//Строка.СуммаУпр = лпСебестоимость;
						
						
						лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						Строка.СуммаПродажная = лпСуммаРознУчетСНДС;
						
						//лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						//Строка.СтоимостьБезСкидок = лпСуммаРознУчетСНДС;
						
						//Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
						//Строка.УчетнаяЦена     = лпСуммаРознУчетСНДС;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ЧекККМ" Тогда
			//лпТаблицаТоваров.Колонки.Добавить("Себестоимость");
			Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСебестоимость = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
					Если ИДКонфигурации() = "БП" Тогда
						//Строка.Себестоимость = лпСебестоимость;
					ИначеЕсли ИДКонфигурации() = "УТП" Тогда
						//Строка.Стоимость = лпСебестоимость;
						//Строка.СуммаУпр = лпСебестоимость;
						
						
						лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						Строка.СуммаПродажная = лпСуммаРознУчетСНДС;
						
						
						//лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
						//Строка.СтоимостьБезСкидок = лпСуммаРознУчетСНДС;
						
						//Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
						//Строка.УчетнаяЦена     = лпСуммаРознУчетСНДС;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "СписаниеТоваров" Тогда
			Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
					Строка.РозничнаяЦена = лпСуммаРознУчетСНДС;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если прСтруктураШапкиДокумента.ВидДокумента = "ПереоценкаТоваровВРознице" Тогда
			Если лпДокСсылка.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				Для Каждого Строка из лпТаблицаТоваров Цикл
					лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
					Строка.СуммаПереоценки = лпСуммаРознУчетСНДС;
					//// для обхода проверки
					//Строка.ЦенаВРозницеСтарая = лпСуммаРознУчетСНДС;
					//Строка.ЦенаВРознице = лпСуммаРознУчетСНДС;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		лпДопДанныеДокумента = 0;
	КонецЕсли; //Если НЕ лпДопДанныеДокументаСсылка.Пустая() Тогда
	
	
	
	Возврат лпТаблицаТоваров;
	
КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ДвиженияПоРегистрам_БП_ПоступлениеТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_ПоступлениеТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		//***** Регистр накопления "Партии товаров на складах (налоговый учет)"
		лпДвижения_ПартииНУ =  прДвижения.УдалитьПартииТоваровНаСкладахНалоговыйУчет;
		лпНомерПров = лпДвижения_ПартииНУ.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_ПартииНУ.Получить(лпНомерПров - 1);
			// схема оптовый
			Если (прСтруктураШапкиДокумента.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетУчета.Код, 2) = "ЗА") Тогда
					лпДвижения_ПартииНУ.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			// схема розничный
			Если (прСтруктураШапкиДокумента.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетУчета.Код, 2) = "ЗА") Тогда
					лпДвижения_ПартииНУ.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			лпСебестоимость = лпСуммаЗакБезНДС;
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			лпСуммаРознРеализацииСНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			лпСуммаРознРеализацииСкидка   = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			лпСуммаНаценкиОтправителя = лпСуммаРознУчетСНДС - лпСебестоимость;
			лпСуммаНаценкиПолучателя = лпСуммаРознРеализацииСНДС - лпСебестоимость;
			
			
		КонецЦикла;
	КонецЕсли;
	лпДокОбъект = 0;
КонецПроцедуры


Процедура ДвиженияПоРегистрам_УТП_ПоступлениеТоваровУслугВНТТ(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
КонецПроцедуры



Процедура ДвиженияПоРегистрам_БП_ПеремещениеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	//Если прСтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" Тогда
	//	//прТекущиеДвижения.Очистить();
	//	//удалим неправильные проводки
	//	лпНомерПров = прТекущиеДвижения.Количество();
	//	Пока лпНомерПров > 0 Цикл
	//		лпПроводка = прТекущиеДвижения.Получить(лпНомерПров - 1);
	//		// схема оптовый-оптовый
	//		// ничего не удаляем
	//		// схема оптовый-розничный
	//		// ничего не удаляем
	//		
	//		// схема розничный-розничный
	//		Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
	//			Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
	//				прТекущиеДвижения.Удалить(лпНомерПров - 1);
	//			КонецЕсли; 
	//		КонецЕсли; 
	//		// схема розничный-оптовый
	//		Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
	//			Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
	//				прТекущиеДвижения.Удалить(лпНомерПров - 1);
	//			КонецЕсли; 
	//		КонецЕсли; 
	//		
	//		лпНомерПров = лпНомерПров - 1;
	//	КонецЦикла;
	//	
	//	Для каждого Строка Из прТаблицаПоТоварам Цикл
	//		лпСебестоимость     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
	//		лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
	//		лпСуммаРознСНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознСНДС");
	//		лпСуммаРознСкидка   = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознСкидка");
	//		лпСуммаНаценкиОтправителя = лпСуммаРознСНДС - лпСебестоимость;
	//		лпСуммаНаценкиПолучателя = лпСуммаРознУчетСНДС - лпСебестоимость;
	//		// 282 - 285 торговая наценка
	//		// схема оптовый-розничный
	//		Если (прСтруктураШапкиДокумента.СкладОтправитель = Перечисления.ВидыСкладов.Оптовый)И(прСтруктураШапкиДокумента.СкладПолучатель = Перечисления.ВидыСкладов.Розничный) Тогда
	//			Если лпСуммаНаценкиОтправителя <> 0 Тогда
	//				Проводка = прТекущиеДвижения.Добавить();
	//				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	//				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	//				Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
	//				
	//				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
	//				Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 282
	//				
	//				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
	//				
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
	//				Проводка.Сумма  = лпСуммаНаценкиОтправителя;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		// схема розничный-оптовый
	//		//оформим сторно
	//		Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
	//			Проводка = прТекущиеДвижения.Добавить();
	//			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	//			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	//			Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость (сторно)';uk='Переміщення: собівартість (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
	//			
	//			//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//			//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
	//			Проводка.СчетДт      = Строка.СчетУчетаБУ; // 282
	//			Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ; // 281
	//			
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
	//			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
	//			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
	//			Проводка.Сумма  = -лпСебестоимость;
	//			
	//			Если лпСуммаНаценкиОтправителя <> 0 Тогда
	//				Проводка = прТекущиеДвижения.Добавить();
	//				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	//				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	//				Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки (сторно)';uk='Переміщення: торгова націнка (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
	//				
	//				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
	//				Проводка.СчетДт      = Строка.СчетУчетаБУ; // 282
	//				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
	//				
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
	//				Проводка.Сумма  = -лпСуммаНаценкиОтправителя;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		// схема розничный-розничный
	//		Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
	//			Проводка = прТекущиеДвижения.Добавить();
	//			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	//			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	//			Проводка.Содержание  = НСтр("ru='Перемещение: сумма розничная';uk='Переміщення: сума роздрібна'",Локализация.КодЯзыкаИнформационнойБазы());
	//			//Проводка.Содержание  = НСтр("ru='Перемещение: в рознице (наценка)';uk='Переміщення: в роздробу (націнка)'",Локализация.КодЯзыкаИнформационнойБазы());
	//			//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//			//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
	//			Проводка.СчетДт      = Строка.СчетУчетаБУ; // 282
	//			Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ; // 282
	//			
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
	//			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
	//			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
	//			//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
	//			Проводка.Сумма  = лпСуммаРознУчетСНДС;
	//			
	//			Если лпСуммаНаценкиОтправителя <> 0 Тогда
	//				Проводка = прТекущиеДвижения.Добавить();
	//				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	//				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	//				Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
	//				
	//				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
	//				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
	//				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
	//				
	//				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
	//				
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
	//				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
	//				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
	//				Проводка.Сумма  = лпСуммаНаценкиОтправителя;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	прТекущиеДвижения.мДействияПередЗаписьюВыполнены = Истина;
	//	прТекущиеДвижения.Записать(Истина);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_ПеремещениеТоваров_ММО(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//***** ТоварыВНТТВПродажныхЦенах
	прДвижения.ТоварыВНТТВПродажныхЦенах.Очистить(); 
	
	//***** ПартииТоваровНаСкладах   
	прДвижения.ПартииТоваровНаСкладах.Очистить();
	
	//***** Хозрасчетный
	//Регистр бухгалтерии "Журнал проводок (бухгалтерский учет)"
	лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
	лпНомерПров = лпДвижения_Хозрасчетный.Количество();
	Пока лпНомерПров > 0 Цикл
		лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
		лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
		лпНомерПров = лпНомерПров - 1;
	КонецЦикла;
	
	// сформируем проводки
	Для каждого Строка Из лпДокСсылка.Товары Цикл
		лпСебестоимость     = Строка.СебестоимостьАНР;
		
		Если лпСебестоимость = 0 Тогда
			Сообщить("В строке "+Строка.НомерСтроки+" себестоимость равна нулю!!!",СтатусСообщения.ОченьВажное);
		КонецЕсли;
				
		лпСуммаРозн = Строка.СуммаВРознице;
		лпСуммаНаценкиОтправителя = лпСуммаРозн - лпСебестоимость;
		
		//***** Хозрасчетный - проводки
		Проводка = прДвижения.Хозрасчетный.Добавить();
		Проводка.Период      = прСтруктураШапкиДокумента.Дата;
		Проводка.Организация = прСтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость';uk='Переміщення: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
		Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 281
		Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
		
		
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);   
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеПозиции",  Строка.НоменклатурнаяПозиция);
		
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  лпДокСсылка);
		//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
		Проводка.Сумма  = лпСебестоимость;
		
		Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
		Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
		Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
			Проводка.СуммаНУДт = Проводка.Сумма; 				
			Проводка.СуммаНУКт = Проводка.Сумма;
		КонецЕсли;
		
		Если Проводка.СчетДт.Количественный Тогда
			Проводка.КоличествоДт = Строка.Количество;
		КонецЕсли;
		Если Проводка.СчетКт.Количественный Тогда
			Проводка.КоличествоКт = Строка.Количество;
		КонецЕсли;
		
		Если лпСуммаНаценкиОтправителя <> 0 Тогда
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852 
			Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
			
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);    
			Проводка.Сумма  = лпСуммаНаценкиОтправителя;
			
			Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.СуммаНУДт = Проводка.Сумма;					
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли; 	
		
		// ***** регистр ТоварыВНТТВПродажныхЦенах
		Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
			лпСуммаНаценкиОтправителя_упр = лпСуммаРозн - лпСебестоимость; 
		Иначе
			УчитыватьНДС = Истина;
			СуммаВключаетНДС = Ложь;
			лпСуммаЗакНДС = УчетНДС.РассчитатьСуммуНДС(лпСебестоимость,
			УчитыватьНДС, СуммаВключаетНДС,
			УчетНДС.ПолучитьСтавкуНДС(Строка.СтавкаНДСВРознице));   					
			лпСуммаНаценкиОтправителя_упр = лпСуммаРозн - лпСебестоимость - лпСуммаЗакНДС; 
		КонецЕсли;
		
		Если лпСуммаРозн <> 0 Тогда
			НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
			НовоеДвижение.Активность  = Истина;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
			НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
			НовоеДвижение.Регистратор = лпДокСсылка;  			
			НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.СкладОтправитель;  			
			НовоеДвижение.СтавкаНДС = Строка.СтавкаНДСВРознице;
			НовоеДвижение.Сумма 		 = АБС(лпСуммаРозн);
			НовоеДвижение.СуммаНаценки  = АБС(лпСуммаНаценкиОтправителя_упр);  			
			НовоеДвижение.Номенклатура  = Строка.Номенклатура;
			НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
			НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат; 
		КонецЕсли;	
		
		// ***** регистр ПартииТоваровНаСкладах
		НовоеДвижениеПартии = прДвижения.ПартииТоваровНаСкладах.Добавить();  
		НовоеДвижениеПартии.Активность  = Истина;
		НовоеДвижениеПартии.ВидДвижения = ВидДвиженияНакопления.Приход;  
		НовоеДвижениеПартии.Период 	   = лпДокСсылка.Дата;  
		НовоеДвижениеПартии.Регистратор = лпДокСсылка;  
		НовоеДвижениеПартии.Номенклатура  = Строка.Номенклатура;
		НовоеДвижениеПартии.Склад 	   = прСтруктураШапкиДокумента.СкладПолучатель;  
		НовоеДвижениеПартии.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 
		НовоеДвижениеПартии.СерияНоменклатуры =  Строка.СерияНоменклатуры;
		НовоеДвижениеПартии.ДокументОприходования = лпДокСсылка;
		НовоеДвижениеПартии.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;
		НовоеДвижениеПартии.Качество = Строка.Качество;
		
		НовоеДвижениеПартии.Количество = Строка.Количество;
		НовоеДвижениеПартии.Стоимость = лпСебестоимость;
		НовоеДвижениеПартии.КодОперации = Перечисления.КодыОперацийПартииТоваров.Оприходование;
		НовоеДвижениеПартии.СписаниеПартий = Ложь;
	КонецЦикла;
	
	
КонецПроцедуры

	
Процедура ДвиженияПоРегистрам_УТП_ПеремещениеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Если ПустаяСтрока(лпДокСсылка.НомерВход_АНР) Тогда
			Возврат;
		Иначе
			// документ загружен из файла .mmo
			ДвиженияПоРегистрам_УТП_ПеремещениеТоваров_ММО(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** ТоварыВНТТВПродажныхЦенах
		прДвижения.ТоварыВНТТВПродажныхЦенах.Очистить();   
		
		
		//***** Хозрасчетный
		//Регистр бухгалтерии "Журнал проводок (бухгалтерский учет)"
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый-розничный
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли;
			// схема розничный-оптовый
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли;
			
			// схема оптовый-НТТ
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли;
			
			// схема НТТ-оптовый
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли;
			
			// схема НТТ-НТТ
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли;
			
			
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			лпСуммаРознРеализацииСНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			лпСуммаРознРеализацииСкидка   = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			лпСуммаНаценкиОтправителя = лпСуммаРознУчетСНДС - лпСебестоимость;
			лпСуммаНаценкиПолучателя = лпСуммаРознРеализацииСНДС - лпСебестоимость;
			
			//***** Хозрасчетный - проводки
			// схема оптовый-розничный
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				//***** Хозрасчетный - проводки
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость';uk='Переміщення: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
				
				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
				Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 281
				Проводка.СчетКт      = Строка.СчетУчетаБУ; // 282
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСебестоимость;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;   				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				Если Проводка.СчетДт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				Если Проводка.СчетКт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				
				Если лпСуммаНаценкиПолучателя <> 0 Тогда
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
					Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 282
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиПолучателя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;  					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			// схема розничный-оптовый
			//сторно
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Розничный)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				//***** Хозрасчетный - проводки
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость (сторно)';uk='Переміщення: собівартість (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
				Проводка.СчетДт      = Строка.СчетУчетаБУ; // 282
				Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ; // 281
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСебестоимость;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.СуммаНУДт = Проводка.Сумма;
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Проводка.СуммаНУКт = Проводка.Сумма;
				
				Если Проводка.СчетДт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				Если Проводка.СчетКт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				
				Если лпСуммаНаценкиПолучателя <> 0 Тогда
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки (сторно)';uk='Переміщення: торгова націнка (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
					
					//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
					Проводка.СчетДт      = Строка.СчетУчетаБУ; // 282
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ; // 285
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиПолучателя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Проводка.СуммаНУКт = Проводка.Сумма;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли; 							
			КонецЕсли;
			
			// схема оптовый-НТТ
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.Оптовый)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				//***** Хозрасчетный - проводки
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость';uk='Переміщення: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
				
				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
				Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 2822
				Проводка.СчетКт      = Строка.СчетУчетаБУ; // 281
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСебестоимость;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				Если Проводка.СчетДт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				Если Проводка.СчетКт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				
				Если лпСуммаНаценкиПолучателя <> 0 Тогда
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
					Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 2822
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);     					
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиОтправителя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;  					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			// схема НТТ-оптовый
			//сторно
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				//***** Хозрасчетный - проводки
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость (сторно)';uk='Переміщення: собівартість (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
				Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
				Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 281
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);   
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСебестоимость;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма; 				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				Если Проводка.СчетДт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				Если Проводка.СчетКт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				
				Если лпСуммаНаценкиПолучателя <> 0 Тогда
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки (сторно)';uk='Переміщення: торгова націнка (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
					
					//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 285
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);    
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиОтправителя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли; 							
			КонецЕсли; 
			
			
			// схема НТТ-НТТ
			Если (прСтруктураШапкиДокумента.СкладОтправитель.ВидСклада = Перечисления.ВидыСкладов.НТТ)И(прСтруктураШапкиДокумента.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах
				Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
					лпСуммаНаценкиОтправителя_упр = лпСуммаРознУчетСНДС - лпСебестоимость; 
					лпСуммаНаценкиПолучателя_упр = лпСуммаРознРеализацииСНДС - лпСебестоимость;
				Иначе
					лпСуммаНаценкиОтправителя_упр = лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС; 
					лпСуммаНаценкиПолучателя_упр = лпСуммаРознРеализацииСНДС - лпСебестоимость - лпСуммаЗакНДС; 	
				КонецЕсли;
				
				Если лпСуммаРознУчетСНДС <> 0 Тогда
					НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
					НовоеДвижение.Активность  = Истина;
					НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
					НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
					НовоеДвижение.Регистратор = лпДокСсылка;  			
					НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.СкладОтправитель;  			
					НовоеДвижение.СтавкаНДС = Строка.СтавкаНДСВРознице;
					НовоеДвижение.Сумма 		 = АБС(лпСуммаРознУчетСНДС);
					НовоеДвижение.СуммаНаценки  = АБС(лпСуммаНаценкиОтправителя_упр);  			
					НовоеДвижение.Номенклатура  = Строка.Номенклатура;
					НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
					НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат; 
				КонецЕсли;
				Если лпСуммаРознРеализацииСНДС <> 0 Тогда
					НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
					НовоеДвижение.Активность  = Истина;
					НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;  
					НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
					НовоеДвижение.Регистратор = лпДокСсылка;  			
					НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.СкладПолучатель;  			
					НовоеДвижение.СтавкаНДС = Строка.СтавкаНДСВРознице;
					НовоеДвижение.Сумма 		 = АБС(лпСуммаРознРеализацииСНДС);
					НовоеДвижение.СуммаНаценки  = АБС(лпСуммаНаценкиПолучателя_упр);  			
					НовоеДвижение.Номенклатура  = Строка.Номенклатура;
					НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
					НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Поступление; 
				КонецЕсли;
				
				
				//***** Хозрасчетный - проводки
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Перемещение: себестоимость';uk='Переміщення: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
				
				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				//Проводка.СчетКт      = Строка.НовыйСчетУчетаБУ;
				Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 2822
				Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСебестоимость;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма; 				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				Если Проводка.СчетДт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				Если Проводка.СчетКт.Количественный Тогда
					Проводка.КоличествоКт = Строка.Количество;
				КонецЕсли;
				
				
				Если лпСуммаНаценкиОтправителя <> 0 Тогда
					//285-282
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852
					Проводка.СчетКт      = Строка.СчетУчетаБУ; // 2822
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОтправитель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);     					
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиОтправителя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли; 
				КонецЕсли;
				
				Если лпСуммаНаценкиПолучателя <> 0 Тогда  
					//282-285
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Перемещение: сумма торговой наценки';uk='Переміщення: торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = Строка.НовыйСчетУчетаБУ; // 2822
					Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852
					
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладПолучатель);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);     					
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма  = лпСуммаНаценкиПолучателя;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма; 					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	лпДокОбъект = 0;
КонецПроцедуры


Процедура ДвиженияПоРегистрам_БП_ВозвратТоваровПоставщику(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем (содержание - "Возврат поставщику. Неоплаченная часть.") и 281
			// схема розничный
			// ничего не удаляем
			
			// схема оптовый
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				// движение по документу
				лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по документу
				лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		//***** Налоговый
		лпДвижения_Налоговый =  прДвижения.Налоговый;
		лпНомерПров = лпДвижения_Налоговый.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Налоговый.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем все
			// схема розничный
			// ничего не удаляем
			
			// схема оптовый
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетКт.Код, 2) = "ЗА") Тогда
					лпДвижения_Налоговый.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли; 
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетКт.Код, 2) = "ЗА") Тогда
					лпДвижения_Налоговый.Удалить(лпНомерПров - 1);
				КонецЕсли; 
			КонецЕсли; 
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		//***** Регистр накопления "Партии товаров на складах (налоговый учет)"
		лпДвижения_ПартииНУ =  прДвижения.УдалитьПартииТоваровНаСкладахНалоговыйУчет;
		лпНомерПров = лпДвижения_ПартииНУ.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_ПартииНУ.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем все
			// схема розничный
			// ничего не удаляем
			
			// схема оптовый
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетУчета.Код, 2) = "ЗА") Тогда
					лпДвижения_ПартииНУ.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по строке
				Если (Лев(лпПроводка.СчетУчета.Код, 2) = "ЗА") Тогда
					лпДвижения_ПартииНУ.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСебестоимость     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			//лпСебестоимость = лпСуммаЗакБезНДС;
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			//***** Хозрасчетный - проводки
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период          = лпДокСсылка.Дата;
			Проводка.Организация = лпДокСсылка.Организация;
			Проводка.Содержание = "Возврат ТМЦ: себестоимость сторно";
			Проводка.СчетДт = Строка.СчетУчетаБУ;
			Проводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			Если Строка.НДСВключенВСтоимость Тогда
				Проводка.Сумма = - (Строка.Сумма - Строка.СуммаНДС);
			Иначе
				Проводка.Сумма = - Строка.Сумма;
			КонецЕсли;
			Если Проводка.СчетДт.Количественный Тогда
				Проводка.КоличествоДт = -Строка.Количество;
			КонецЕсли;
			Если Проводка.СчетКт.Количественный Тогда
				Проводка.КоличествоКт = -Строка.Количество;
			КонецЕсли;
			
			Если ИДКонфигурации() = "БП" Тогда
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиНалоговогоУчета",Строка.СтатьяПриростаУбылиЗапасов);
			КонецЕсли;
			Если ИДКонфигурации() = "УТП" Тогда
				ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			КонецЕсли;
			
			
			
			//***** Хозрасчетный - проводки
			//Проводка = прДвижения.Хозрасчетный.Добавить();
			//Проводка.Период          = лпДокСсылка.Дата;
			//Проводка.Организация = лпДокСсылка.Организация;
			//Проводка.Содержание = "Возврат ТМЦ: себестоимость";
			//
			//Проводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			//
			//Проводка.СчетКт = Строка.СчетУчетаБУ;
			////ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			////ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиНалоговогоУчета",Строка.СтатьяПриростаУбылиЗапасов);
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиНалоговогоУчета",Строка.СтатьяПриростаУбылиЗапасов);
			//
			//Если Строка.НДСВключенВСтоимость Тогда
			//	Проводка.Сумма = Строка.Сумма - Строка.СуммаНДС;
			//Иначе
			//	Проводка.Сумма = Строка.Сумма;
			//КонецЕсли;
			//Если Проводка.СчетКт.Количественный Тогда
			//	Проводка.КоличествоКт = Строка.Количество;
			//КонецЕсли;
			
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				Если (лпСуммаСписываемойНаценки <> 0) Тогда
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Возврат ТМЦ: торговая надбавка сторно";
					Проводка.СчетДт = Строка.СчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоДт = Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = Строка.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
			//???
			//Если НаСчетеВедетсяУчетПоОтгрузкам(Проводка.СчетДт) Тогда
			//	Проводка.СубконтоДт.ДокументыРасчетовСКонтрагентами = СтрокаПартии.ДокументОтгрузки;
			//КонецЕсли;
			//
			//Если (СтрокаДокумента.КорСубконтоСписанияБУ4 = Неопределено) Тогда
			//	СтрокаДокумента.КорСубконтоСписанияБУ4 = НоменклатурнаяПозицияСтроки;
			//КонецЕсли;
			//
			//ЗаполнитьСубконто(Проводка, СтрокаДокумента, 
			//СтрокаДокумента.КорСубконтоСписанияБУ1,
			//СтрокаДокумента.КорСубконтоСписанияБУ2,
			//СтрокаДокумента.КорСубконтоСписанияБУ3,
			//СтрокаДокумента.КорСубконтоСписанияБУ4,
			//СтрокаПартии.ДокументОприходования,
			//НоменклатурнаяПозицияСтроки,,);
			//
			//Если НаСчетеВедетсяУчетПоОтгрузкам(Проводка.СчетКт) Тогда
			//	Проводка.СубконтоКт.ДокументыРасчетовСКонтрагентами = СтрокаПартии.ДокументОтгрузки;
			//КонецЕсли;
			
			//Если Строка.НДСВключенВСтоимость Тогда
			//	Проводка.Сумма = Строка.Сумма - Строка.СуммаНДС;
			//Иначе
			//	Проводка.Сумма = Строка.Сумма;
			//КонецЕсли;
			//Если Проводка.СчетКт.Количественный Тогда
			//	Проводка.КоличествоКт = Строка.Количество;
			//КонецЕсли;
			
			//***** Налоговый - проводки
			Проводка = прДвижения.Налоговый.Добавить();
			Проводка.Период          = лпДокСсылка.Дата;
			Проводка.Организация = лпДокСсылка.Организация;
			Проводка.Содержание = "";
			Проводка.СчетКт = ПланыСчетов.Налоговый.Запасы;
			Если ИДКонфигурации() = "БП" Тогда
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиНалоговогоУчета",Строка.СтатьяПриростаУбылиЗапасов);
			КонецЕсли;
			Если ИДКонфигурации() = "УТП" Тогда
				ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			КонецЕсли;
			
			Если Строка.НДСВключенВСтоимость Тогда
				Проводка.Сумма = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				Проводка.Сумма = Строка.Сумма;
			КонецЕсли;
			Если Проводка.СчетДт.Количественный Тогда
				Проводка.КоличествоДт = Строка.Количество;
			КонецЕсли;
			Если Проводка.СчетКт.Количественный Тогда
				Проводка.КоличествоКт = Строка.Количество;
			КонецЕсли;
			
			
			// Регистр накопления "Партии товаров на складах (налоговый учет)"
			Движение = прДвижения.ПартииТоваровНаСкладахНалоговыйУчет.ДобавитьРасход();
			Движение.Активность      = Истина;
			Движение.Период            = лпДокСсылка.Дата;
			Движение.Регистратор    = лпДокСсылка;
			Движение.Номенклатура = Строка.Номенклатура;
			//Движение.ХарактеристикаНоменклатуры = СтрокаПартии.ХарактеристикаНоменклатуры;
			//Движение.СерияНоменклатуры                  = СтрокаПартии.СерияНоменклатуры;
			//Движение.Заказ                                             = СтрокаПартии.ЗаказПокупателя;
			//Движение.Качество                                      = СтрокаПартии.Качество;
			Движение.СчетУчета        = ПланыСчетов.Налоговый.Запасы;
			Движение.Организация    = лпДокСсылка.Организация;
			
			Если ИДКонфигурации() = "БП" Тогда
				Движение.Склад                = прСтруктураШапкиДокумента.Склад;
			КонецЕсли;
			Если ИДКонфигурации() = "УТП" Тогда
				Движение.Склад                = Строка.Склад;
			КонецЕсли;
			
			Движение.НалоговоеНазначение                = Строка.НалоговоеНазначение;
			Движение.СтатьяПриростаУбылиЗапасов = Строка.СтатьяПриростаУбылиЗапасов;
			//Движение.ДокументОприходования          = СтрокаПартии.ДокументОприходования;
			
			Движение.Количество = Строка.Количество;
			Движение.СуммаНДС  = Строка.СуммаНДС;
			Если Строка.НДСВключенВСтоимость Тогда
				Движение.Стоимость = Строка.Сумма - Строка.СуммаНДС;
				Движение.СуммаВР   = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				Движение.Стоимость = Строка.Сумма;
				Движение.СуммаВР   = Строка.Сумма;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_ВозвратТоваровПоставщикуИзНТТ(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** ТоварыВНТТВПродажныхЦенах
		прДвижения.ТоварыВНТТВПродажныхЦенах.Очистить();
		
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем (содержание - "Возврат поставщику. Неоплаченная часть.") и 281
			// схема розничный
			
			// схема оптовый
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый) Тогда
				// движение по документу
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасходовБУ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				//лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по документу
				Если (лпПроводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасходовБУ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				//лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			// схема НТТ
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				// движение по документу
				Если (лпПроводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасходовБУ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				//лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;   		
	КонецЕсли;
	
	// ****
	НаправлениеДвижения = УправлениеВзаиморасчетами.ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(лпДокСсылка.Метаданные().Имя,, прСтруктураШапкиДокумента).Направление;
	ЭтоВозврат          = (УправлениеВзаиморасчетами.ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(лпДокСсылка.Метаданные().Имя,, прСтруктураШапкиДокумента).РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат);
	СчетРасчетов        = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;	
	СчетАвансов         = прСтруктураШапкиДокумента.СчетУчетаРасчетовПоАвансам;
	ВалютаДокумента     = прСтруктураШапкиДокумента.ВалютаДокумента;
	РасчетыВВалюте      = НЕ (ВалютаДокумента = глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	Если лпДокСсылка.СуммаВключаетНДС Тогда  
		СуммаДокументаСНДСВВалютеРасчетов = лпДокСсылка.Товары.Итог("Сумма");
	Иначе
		СуммаДокументаСНДСВВалютеРасчетов = лпДокСсылка.Товары.Итог("Сумма") + лпДокСсылка.Товары.Итог("СуммаНДС");
	КонецЕсли;

	Если НаправлениеДвижения=Перечисления.НаправленияДвижений.Поступление тогда
		СодержаниеОперации = "Выделение аванса (оплаченная часть при возвр.)";
	Иначе
		СодержаниеОперации = "Возврат поставщику. Неоплаченная часть.";
	КонецЕсли;
	СуфиксСчетаРасчетов = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление, "Дт", "Кт");
	СуфиксСчетаАвансов  = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление, "Кт", "Дт");
	УсловиеВалюта = Справочники.Валюты.ПустаяСсылка();
	ЗнакФильтрПоОстаткам = ?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление , 1, -1);    
	МоментДокумента     = Новый МоментВремени(лпДокСсылка.Дата,лпДокСсылка.Ссылка);
	Период = МоментДокумента;
	Контрагент          = прСтруктураШапкиДокумента.Контрагент;
	ДоговорКонтрагента  = прСтруктураШапкиДокумента.ДоговорКонтрагента;
	Если     ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом 
		И НЕ ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл Тогда
		Сделка = Неопределено;
	КонецЕсли;  
	ТаблицаАвансов       = ОбщегоНазначения.ПолучитьОстатокПоСчету(лпДокСсылка.Организация,Период,?(НаправлениеДвижения = Перечисления.НаправленияДвижений.Поступление и ЭтоВозврат,СчетРасчетов,СчетАвансов),УсловиеВалюта ,Контрагент, ДоговорКонтрагента,Сделка,ЗнакФильтрПоОстаткам);
	НомерСубконтоРасчетныеДокументы = 0;
	Если НЕ СчетАвансов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто") = Неопределено тогда
		НомерСубконтоРасчетныеДокументы = СчетАвансов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто").НомерСтроки;
	КонецЕсли;
	Если НЕ НомерСубконтоРасчетныеДокументы = 0 тогда
		УправлениеВзаиморасчетами.УпорядочитьТаблицуПоДокументу(ТаблицаАвансов,"Субконто"+НомерСубконтоРасчетныеДокументы);
	КонецЕсли;
	
	Если ТаблицаАвансов.Количество()<>0 тогда
		ПроводкиБУ = прДвижения.Хозрасчетный;   		
		Для каждого СтрокаАванса из ТаблицаАвансов Цикл
			//Расчет суммы перекрытия задолженности на счете, определение суммовых разниц
		ТекущийАванс = Макс(0, Мин(СуммаДокументаСНДСВВалютеРасчетов,СтрокаАванса["СуммаОстаток"]));  		
		Если ТекущийАванс = 0 тогда 
			Продолжить;
		КонецЕсли;
		ТекущийАвансРегл = ТекущийАванс;
		СуммаДокументаСНДСВВалютеРасчетов = СуммаДокументаСНДСВВалютеРасчетов - ТекущийАванс;

		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = лпДокСсылка.Дата;
		Проводка.Организация  = лпДокСсылка.Организация;
		Проводка.Содержание   = СодержаниеОперации;
		
		Проводка["Счет" + СуфиксСчетаРасчетов]= СчетРасчетов;
		ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "Контрагенты",        Контрагент);
		ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "Договоры",           ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаРасчетов], Проводка["Субконто" + СуфиксСчетаРасчетов], "ДокументыРасчетовСКонтрагентами", УправлениеВзаиморасчетами.ОпределитьДокументРасчетовСКонтрагентом(прСтруктураШапкиДокумента, прСтруктураШапкиДокумента.Ссылка, Сделка));
		
		Проводка["Счет" + СуфиксСчетаАвансов]= СчетАвансов;
		Для НомерСубконто = 1 по 3 Цикл
			ОбщегоНазначения.УстановитьСубконто(Проводка["Счет" + СуфиксСчетаАвансов], Проводка["Субконто" + СуфиксСчетаАвансов], НомерСубконто,СтрокаАванса["Субконто" + НомерСубконто]);
		КонецЦикла;
		
		Проводка.Сумма = ТекущийАвансРегл;  			
		КонецЦикла;
	КонецЕсли;
	// ****
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			// суммы отрицательные
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;  				
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			// ***** регистр ТоварыВНТТВПродажныхЦенах
			НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
			НовоеДвижение.Активность  = Истина;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
			НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
			НовоеДвижение.Регистратор = лпДокСсылка;  			
			НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.Склад;  			
			НовоеДвижение.СтавкаНДС= Строка.СтавкаНДСВРознице;
			НовоеДвижение.Сумма 		 = АБС(лпСуммаРознУчетСНДС);
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость); 
			Иначе
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС);
			КонецЕсли;
			НовоеДвижение.СуммаНаценки  = лпСуммаНаценки;  			
			НовоеДвижение.Номенклатура  = Строка.Номенклатура;
			НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
			НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат;    			
			
			
			//***** Хозрасчетный - проводки
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период          = лпДокСсылка.Дата;
			Проводка.Организация = лпДокСсылка.Организация;
			Проводка.Содержание = "Возврат ТМЦ: себестоимость сторно";
			Проводка.СчетДт = Строка.СчетУчетаБУ;
			Проводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.УдалитьСтатьяПриростаУбылиЗапасов);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами",  лпДокСсылка);

			//Если Строка.НДСВключенВСтоимость Тогда
			//	Проводка.Сумма = - (Строка.Сумма - Строка.СуммаНДС);
			//Иначе
			Проводка.Сумма = - Строка.Сумма;
			//КонецЕсли;
			Если Проводка.СчетДт.Количественный Тогда
				Проводка.КоличествоДт = -Строка.Количество;
			КонецЕсли;
			Если Проводка.СчетКт.Количественный Тогда
				Проводка.КоличествоКт = -Строка.Количество;
			КонецЕсли;
			
			Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
			//Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.СуммаНУДт = Проводка.Сумма;  			
				//Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;				
			
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				Если (лпСуммаСписываемойНаценки <> 0) Тогда
					// 282 - 285 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Возврат ТМЦ: торговая надбавка сторно";
					Проводка.СчетДт = Строка.СчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);   					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
					
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоДт = -Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = -Строка.Количество;
					КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;  					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры



Процедура ДвиженияПоРегистрам_БП_ОтчетОРозничныхПродажах(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем 
			// схема розничный
			// ничего не удаляем
			
			// схема розничный
			Если прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
				// проводка по строке
				Если (Лев(лпПроводка.СчетДт.Код, 2) = "28")ИЛИ(Лев(лпПроводка.СчетКт.Код, 2) = "28") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (Лев(лпПроводка.СчетДт.Код, 3) = "36Р") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (Лев(лпПроводка.СчетДт.Код, 3) = "301") Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			
			лпСуммаЗакБезНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДССкидки");
			лпСуммаЗакСНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДССкидки");
			лпСуммаЗакНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДССкидки");
			// !!!
			лпСебестоимость = лпСуммаЗакБезНДС;
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			//***** Хозрасчетный - проводки
			
			//Списание себестоимости продаваемого товара
			// 902 - 282
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание = НСтр("ru='Розн.продажа: себестоимость';uk='Розд.продаж: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт = Строка.СхемаРеализации.СчетСебестоимости;
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.КорСубконтоСписанияБУ1);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.КорСубконтоСписанияБУ2);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.КорСубконтоСписанияБУ3);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
			
			Проводка.СчетКт = Строка.СчетУчетаБУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
			Проводка.Сумма = лпСебестоимость;
			
			Если (лпСуммаРеальнойНаценки >= 0) Тогда
				//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
				//	МестоХранения,ТМЦ,Партия,
				//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
				
				// 285 - 282 торговая наценка
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма торговой наценки';uk='Розд.продаж: списана торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				//Проводка.Сумма  = лпСуммаРознРеализацииСНДС;
				Проводка.Сумма  = лпСуммаРеальнойНаценки;
				
				// 285 - 282 скидка
				Если лпСуммаРознРеализацииСкидка > 0 Тогда 
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма скидки" + "   (стр. №" + НомерСтроки + ")",, 
					//МестоХранения,ТМЦ,Партия,
					//МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаРознРеализацииСкидка;
				ИначеЕсли лпСуммаРознРеализацииСкидка < 0 Тогда
					// оформим сторно
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма дооценки (сторно)" + "   (стр. №" + НомерСтроки + ")",, 
					//МестоХранения,ТМЦ,Партия,
					//МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма дооценки (сторно)';uk='Розд.продаж: списана сума дооцінки (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаРознРеализацииСкидка;
				КонецЕсли;
			Иначе
				Сообщить("Продажа ниже себестоимости - " + лпДокСсылка);
				// продажа ниже себестоимости
				//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма + СуммаДельта) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
				//	МестоХранения,ТМЦ,Партия,
				//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
				
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма = лпСуммаСписываемойНаценки;
			КонецЕсли;
			
		КонецЦикла; // Для каждого Строка Из прТаблицаПоТоварам Цикл
		
		
		//прТекущиеДвижения.мДействияПередЗаписьюВыполнены = Истина;
		//прТекущиеДвижения.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_ОтчетОРозничныхПродажах(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		прДвижения.ТоварыОрганизаций.Очистить();
		прДвижения.ТоварыВНТТ.Очистить();  	
		
		прДвижения.Хозрасчетный.Очистить();  	
	КонецЕсли;
	
	//лпСчет_7091 = ПланыСчетов.Хозрасчетный.ДоходОтРозницы;
	//лпНужнСтатья = Справочники.СтатьиДоходов.НайтиПоКоду("000001001");
	//Для Каждого лпЭлем Из лпДвижения_Хозрасчетный Цикл
	//	Если лпЭлем.СчетДт = лпСчет_7091 Тогда
	//		УстановитьСубконто(лпЭлем.СчетДт, лпЭлем.СубконтоДт, "СтатьиДоходов", лпНужнСтатья);
	//	КонецЕсли;
	//КонецЦикла;
	
	лпДвижения_Продажи = прДвижения.Продажи;
	лпНомерПров = лпДвижения_Продажи.Количество();
	Пока лпНомерПров > 0 Цикл
		лпПроводка = лпДвижения_Продажи.Получить(лпНомерПров - 1);
		лпПроводка.Количество = "";
		лпНомерПров = лпНомерПров - 1; 
	КонецЦикла; 
	
	
	// проводки по итогу ТЧ
	Если "СформироватьПроводкиИтогТЧ" = "СформироватьПроводкиИтогТЧ" Тогда
		// Взаиморасчеты с эквайрером
		
		лпСуммаПродажПоКартам = лпДокСсылка.ОплатаПлатежнымиКартами.Итог("Сумма");
		лпСуммаПродажНаличние = лпДокСсылка.Товары.Итог("Сумма") - лпСуммаПродажПоКартам; 
		
		//лпПараметрыСкладов = ПолучитьТО_ПараметрыСкладов(прСтруктураШапкиДокумента.Склад);

		Если лпСуммаПродажПоКартам <> 0 Тогда
			//// 333 - 7091
			//КНТ = прСтруктураШапкиДокумента.Эквайрер; //лпПараметрыСкладов.ДоговорЭквайринга.Эквайрер;
			//Проводка = прДвижения.Хозрасчетный.Добавить();
			//Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			//Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			//Проводка.Содержание  = НСтр("ru='Розн.продажа: оплата платежными картами';uk='Розд.продаж: оплата платіжними картами'",Локализация.КодЯзыкаИнформационнойБазы());
			//
			//Проводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСЭквайрером;    // 333
			////Проводка.СчетКт = лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;
			//Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091
			//ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КНТ);   
			////ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", КНТ.ОсновнойДоговорКонтрагента);
			//ТоварныйОтчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", лпДокСсылка.Товары[0].СхемаРеализации.СубконтоДоходов1);
			//
			//Проводка.Сумма = лпСуммаПродажПоКартам;
			//
			//Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
			//	Проводка.НалоговоеНазначениеКт = лпДокСсылка.Товары[0].НалоговоеНазначениеДоходовИЗатрат;
			//	Проводка.СуммаНУКт = Проводка.Сумма;
			//КонецЕсли;  
			// 333 - 36Р
			КНТ = прСтруктураШапкиДокумента.Эквайрер; //лпПараметрыСкладов.ДоговорЭквайринга.Эквайрер;
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Розн.продажа: оплата платежными картами';uk='Розд.продаж: оплата платіжними картами'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСЭквайрером;    // 333
			//Проводка.СчетКт = лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
			ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КНТ);   
			//ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", КНТ.ОсновнойДоговорКонтрагента);
			ТоварныйОтчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады", прСтруктураШапкиДокумента.Склад);
			
			Проводка.Сумма = лпСуммаПродажПоКартам;
			
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.НалоговоеНазначениеКт = лпДокСсылка.Товары[0].НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;   
		КонецЕсли;
		
		Если лпСуммаПродажНаличние <> 0 Тогда
			//// 3331 - 7091
			//Проводка = прДвижения.Хозрасчетный.Добавить();
			//Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			//Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			//Проводка.Содержание  = НСтр("ru='Розн.продажа: оплата наличными';uk='Розд.продаж: оплата готівкою'",Локализация.КодЯзыкаИнформационнойБазы());
			//
			//Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3331");   // 3331
			////Проводка.СчетКт =  лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;
			//Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091
			//
			//ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);   
			//
			//ТоварныйОтчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов", лпДокСсылка.Товары[0].СхемаРеализации.СубконтоДоходов1);
			//
			//Проводка.Сумма = лпСуммаПродажНаличние;
			//
			//Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
			//	Проводка.НалоговоеНазначениеКт = лпДокСсылка.Товары[0].НалоговоеНазначениеДоходовИЗатрат;
			//	Проводка.СуммаНУКт = Проводка.Сумма;
			//КонецЕсли; 
			// 3331 - 36Р
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Розн.продажа: оплата наличными';uk='Розд.продаж: оплата готівкою'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3331");   // 3331
			//Проводка.СчетКт =  лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
			
			ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);   
			
			ТоварныйОтчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады", прСтруктураШапкиДокумента.Склад);
			
			Проводка.Сумма = лпСуммаПродажНаличние;
			
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.НалоговоеНазначениеКт = лпДокСсылка.Товары[0].НалоговоеНазначениеДоходовИЗатрат;
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			
			лпСуммаЗакБезНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДССкидки");
			лпСуммаЗакСНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДССкидки");
			лпСуммаЗакНДССкидки = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДССкидки");
			// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			лпСуммаРознРеализацииСкидка =  лпСуммаСписываемойНаценки -лпСуммаРеальнойНаценки;
			
			//***** Хозрасчетный - проводки
			
			//Списание себестоимости продаваемого товара
			// 902 - 282
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Розн.продажа: себестоимость';uk='Розд.продаж: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимости;
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  Справочники.СтатьиЗатрат.НПНК_СВ_Товары);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);  
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  Строка.СхемаРеализации.СубконтоСебестоимости3);  

			
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.КорСубконтоСписанияБУ1);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.КорСубконтоСписанияБУ2);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.КорСубконтоСписанияБУ3);
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
			
			Проводка.СчетКт      = Строка.СчетУчетаБУ;
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
			
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
			Проводка.Сумма  = лпСебестоимость - лпСуммаЗакБезНДССкидки;
			
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУДт = Проводка.Сумма;  			
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
			// это списывается недосписанная себестоимость при продаже ниже себестоимости
			// по наценке не делаем, сумма учтена в основной проводке
			//Если ТО_ДатьСчетСклада(ДатьМестоХранения()) <> СчетПоКоду("281") Тогда
			//	глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(ДатьМестоХранения()),(СуммаРознСНДС-СуммаЗакБезНДС),ТипДокумента.Наименование,, 
			//	ДатьМестоХранения(),Товар,Партия,
			//	ДатьМестоХранения(),Товар,Партия, ,,"ПХ");
			//КонецЕсли;
			//глПроводка(Контекст,Товар.СчетЗатрат,ТО_ДатьСчетСклада(ДатьМестоХранения()), СуммаЗакБезНДС,"Списание: себестоимость",, 
			//	Товар.ВидДеятельности,Товар.ВидЗатрат,,
			//	ДатьМестоХранения(),Товар,Партия, ,,"ПХ"); 
			Если (лпСуммаЗакБезНДССкидки > 0) Тогда
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание = НСтр("ru='Списание: себестоимость';uk='Списання: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимости;
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  Справочники.СтатьиЗатрат.НПНК_СВ_Товары);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);  
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  Строка.СхемаРеализации.СубконтоСебестоимости3);
				
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
				
				Проводка.Сумма  = лпСуммаЗакБезНДССкидки;
				
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
					Проводка.СуммаНУДт = Проводка.Сумма;  			
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;				
			КонецЕсли;
			
			Если (лпСуммаРеальнойНаценки > 0) Тогда
				//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
				//	МестоХранения,ТМЦ,Партия,
				//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
				
				// 285 - 282 торговая наценка
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание = НСтр("ru='Розн.продажа: списана сумма торговой наценки';uk='Розд.продаж: списана торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
				Проводка.СчетКт = Строка.СчетУчетаБУ;
				
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
				
				//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				//Проводка.Сумма  = лпСуммаРознРеализацииСНДС;
				Проводка.Сумма  = лпСуммаРеальнойНаценки;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма; 				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
				// 285 - 282 скидка
				Если лпСуммаРознРеализацииСкидка > 0 Тогда 
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма скидки" + "   (стр. №" + НомерСтроки + ")",, 
					//МестоХранения,ТМЦ,Партия,
					//МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
					
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаРознРеализацииСкидка;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма; 					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				ИначеЕсли лпСуммаРознРеализацииСкидка < 0 Тогда
					// оформим сторно
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма дооценки (сторно)" + "   (стр. №" + НомерСтроки + ")",, 
					//МестоХранения,ТМЦ,Партия,
					//МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма дооценки (сторно)';uk='Розд.продаж: списана сума дооцінки (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
					
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаРознРеализацииСкидка;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				//Сообщить("Продажа ниже себестоимости - " + лпДокСсылка);
				// продажа ниже себестоимости
				//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма + СуммаДельта) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
				//	МестоХранения,ТМЦ,Партия,
				//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
				
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
				
				//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
				//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма = лпСуммаСписываемойНаценки;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма; 				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			
			//// 7091 - 702
			//Проводка = прДвижения.Хозрасчетный.Добавить();
			//Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			//Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			//Проводка.Содержание  = НСтр("ru='Доход от продаж в рознице';uk='Дохід від продажів в роздрібній торгівлі'",Локализация.КодЯзыкаИнформационнойБазы());
			//
			//Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091
			//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов", лпДокСсылка.Товары[0].СхемаРеализации.СубконтоДоходов1);

			//Проводка.СчетКт = лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;  // 702
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов",  лпДокСсылка.Товары[0].СхемаРеализации.СубконтоДоходов1);
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа); 
			//
			//Проводка.Сумма = лпСуммаРознРеализацииСНДС;
			//
			//Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
			//		Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат;
			//		Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначениеДоходовИЗатрат;
			//		Проводка.СуммаНУДт = Проводка.Сумма; 
			//		Проводка.СуммаНУКт = Проводка.Сумма;  
			//КонецЕсли;
			// 36Р - 7091
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Доход от продаж в рознице';uk='Дохід від продажів в роздрібній торгівлі'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
			ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", прСтруктураШапкиДокумента.Склад);

			Проводка.СчетКт =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091   			
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов",  Строка.СхемаРеализации.СубконтоДоходов1);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа); 
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Строка.СхемаРеализации.СубконтоДоходов3); 
						
			Проводка.Сумма = лпСуммаРознРеализацииСНДС;
			
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначениеДоходовИЗатрат;
					Проводка.СуммаНУДт = Проводка.Сумма; 
					Проводка.СуммаНУКт = Проводка.Сумма;  
			КонецЕсли;


			Если лпСуммаРознРеализацииНДС <> 0 Тогда
				//// 702-6434
				//Проводка = прДвижения.Хозрасчетный.Добавить();
				//Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				//Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				//Проводка.Содержание  = НСтр("ru='НДС розничной выручки';uk='НДС розничной выручки'",Локализация.КодЯзыкаИнформационнойБазы());
				//
				////Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДоходОтРеализацииТоваров;  
				//Проводка.СчетДт      =  лпДокСсылка.Товары[0].СхемаРеализации.СчетДоходов;
				//Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;  				
				//
				////лпНужнСтатья = Справочники.СтатьиДоходов.НайтиПоКоду("000001001");
				//
				//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  лпДокСсылка.Товары[0].СхемаРеализации.СубконтоДоходов1);
				//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);
				//Проводка.Сумма = лпСуммаРознРеализацииНДС;
				//
				//Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				//	Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
				//	Проводка.СуммаНУДт = Проводка.Сумма; 
				//КонецЕсли;
				// 7091-6434
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='НДС розничной выручки';uk='НДС розничной выручки'",Локализация.КодЯзыкаИнформационнойБазы());
				
				//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДоходОтРеализацииТоваров;  
				Проводка.СчетДт      =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091
				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;  				
				
				//лпНужнСтатья = Справочники.СтатьиДоходов.НайтиПоКоду("000001001");
				
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  Строка.СхемаРеализации.СубконтоДоходов1);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоДоходов3);
				
				Проводка.Сумма = лпСуммаРознРеализацииНДС;
				
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
					Проводка.СуммаНУДт = Проводка.Сумма; 
				КонецЕсли;

			КонецЕсли;
			
			
			// ***** регистр ОжидаемыйИПодтвержденныйНДСПродаж
			НовоеДвижение = прДвижения.ОжидаемыйИПодтвержденныйНДСПродаж.Добавить();   			
			НовоеДвижение.Активность  = Истина;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;  
			НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
			НовоеДвижение.Регистратор = лпДокСсылка;  			
			НовоеДвижение.Организация 	   = прСтруктураШапкиДокумента.Организация;  			
			НовоеДвижение.ДоговорКонтрагента = "";
			НовоеДвижение.Сделка = "";
			НовоеДвижение.ВозвратнаяТара = "";   				
			НовоеДвижение.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.РеализацияРозница;
			НовоеДвижение.СтавкаНДС = Строка.СтавкаНДС;
			НовоеДвижение.БазаНДС = лпСуммаРознРеализацииБезНДС;
			НовоеДвижение.СуммаНДС = лпСуммаРознРеализацииНДС;
			НовоеДвижение.КодОперации = Перечисления.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж.ОжидаемыйНДС;
			
			
			
			// ***** регистр ТоварыВНТТВПродажныхЦенах
			НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
			НовоеДвижение.Активность  = Истина;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
			НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
			НовоеДвижение.Регистратор = лпДокСсылка;  			
			НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.Склад;  			
			НовоеДвижение.СтавкаНДС= Строка.СтавкаНДС;
			НовоеДвижение.Сумма 		 = АБС(лпСуммаРознУчетСНДС);
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость); 
			Иначе
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС);
			КонецЕсли;
			НовоеДвижение.СуммаНаценки  = лпСуммаНаценки;  			
			НовоеДвижение.Номенклатура  = Строка.Номенклатура;
			НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
			НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;    	
			
		КонецЦикла; // Для каждого Строка Из прТаблицаПоТоварам Цикл
		
		//прТекущиеДвижения.мДействияПередЗаписьюВыполнены = Истина;
		//прТекущиеДвижения.Записать(Истина);
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры


Процедура ДвиженияПоРегистрам_БП_РеализацияТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_РеализацияТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	прДвижения.ПартииТоваровНаСкладах.Очистить();
	прДвижения.ТоварыОрганизаций.Очистить();
	
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		прДвижения.ТоварыОрганизаций.Очистить();
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем 
			// схема розничный
			// удаляем 
			
			// проводка по строке
			Если (Лев(лпПроводка.СчетДт.Код, 2) = "90") Тогда
				лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			КонецЕсли;
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по документу
				Если (лпПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			// схема НТТ
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				// движение по документу
				Если (лпПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;   			
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		
	КонецЕсли;
	
	лпДвижения_Продажи = прДвижения.Продажи;
	лпНомерПров = лпДвижения_Продажи.Количество();
	Пока лпНомерПров > 0 Цикл
		лпПроводка = лпДвижения_Продажи.Получить(лпНомерПров - 1);
		лпПроводка.Количество = "";
		лпНомерПров = лпНомерПров - 1; 
	КонецЦикла; 
	
	
	
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			//лпСебестоимость     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "Себестоимость");
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			//// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			//лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРознРеализацииСкидка = лпСуммаРознУчетСНДС - (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС);
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			//***** Хозрасчетный - проводки
			//Списание себестоимости продаваемого товара
			// 902 - 282
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Реализация товаров: себестоимость';uk='Реалізація товарів: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
			
			Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимости;
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  Справочники.СтатьиЗатрат.НПНК_СВ_Товары);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);  
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  Строка.СхемаРеализации.СубконтоСебестоимости3);
			
			Проводка.СчетКт      = Строка.СчетУчетаБУ;
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС); 
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
			Проводка.Сумма  = лпСебестоимость;
			
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУДт = Проводка.Сумма;  			
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда 
				Если (лпСуммаРеальнойНаценки > 0) Тогда
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
					//	МестоХранения,ТМЦ,Партия,
					//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма торговой наценки';uk='Розд.продаж: списана торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					//Проводка.Сумма  = лпСуммаРознРеализацииСНДС;
					Проводка.Сумма  = лпСуммаРеальнойНаценки;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Проводка.СуммаНУКт = Проводка.Сумма;
					
					// 285 - 282 скидка
					Если лпСуммаРознРеализацииСкидка > 0 Тогда 
						//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма скидки" + "   (стр. №" + НомерСтроки + ")",, 
						//МестоХранения,ТМЦ,Партия,
						//МестоХранения,ТМЦ,Партия, ,,"РЗ");
						
						Проводка = прДвижения.Хозрасчетный.Добавить();
						Проводка.Период      = прСтруктураШапкиДокумента.Дата;
						Проводка.Организация = прСтруктураШапкиДокумента.Организация;
						Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
						
						Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
						
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
						//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Проводка.Сумма = лпСуммаРознРеализацииСкидка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
						Проводка.СуммаНУДт = Проводка.Сумма;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Проводка.СуммаНУКт = Проводка.Сумма;
						
					ИначеЕсли лпСуммаРознРеализацииСкидка < 0 Тогда
						// оформим сторно
						//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма дооценки (сторно)" + "   (стр. №" + НомерСтроки + ")",, 
						//МестоХранения,ТМЦ,Партия,
						//МестоХранения,ТМЦ,Партия, ,,"РЗ");
						
						Проводка = прДвижения.Хозрасчетный.Добавить();
						Проводка.Период      = прСтруктураШапкиДокумента.Дата;
						Проводка.Организация = прСтруктураШапкиДокумента.Организация;
						Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма дооценки (сторно)';uk='Розд.продаж: списана сума дооцінки (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
						
						Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
						
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
						//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Проводка.Сумма = лпСуммаРознРеализацииСкидка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
						Проводка.СуммаНУДт = Проводка.Сумма;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Проводка.СуммаНУКт = Проводка.Сумма;
						
					КонецЕсли;
				Иначе
					Сообщить("Продажа ниже себестоимости - " + лпДокСсылка);
					// продажа ниже себестоимости
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма + СуммаДельта) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
					//	МестоХранения,ТМЦ,Партия,
					//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Проводка.СуммаНУКт = Проводка.Сумма;
					
				КонецЕсли;
			КонецЕсли;
			
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда 
				Если (лпСуммаРеальнойНаценки > 0) Тогда
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
					//	МестоХранения,ТМЦ,Партия,
					//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма торговой наценки';uk='Розд.продаж: списана торгова націнка'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС); 					
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					//Проводка.Сумма  = лпСуммаРознРеализацииСНДС;
					Проводка.Сумма  = лпСуммаРеальнойНаценки;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма; 					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
					// 285 - 282 скидка
					Если лпСуммаРознРеализацииСкидка > 0 Тогда 
						//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма скидки" + "   (стр. №" + НомерСтроки + ")",, 
						//МестоХранения,ТМЦ,Партия,
						//МестоХранения,ТМЦ,Партия, ,,"РЗ");
						
						Проводка = прДвижения.Хозрасчетный.Добавить();
						Проводка.Период      = прСтруктураШапкиДокумента.Дата;
						Проводка.Организация = прСтруктураШапкиДокумента.Организация;
						Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
						
						Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
						
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);  
						//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
						//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Проводка.Сумма = лпСуммаРознРеализацииСкидка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
							Проводка.СуммаНУДт = Проводка.Сумма;						
							Проводка.СуммаНУКт = Проводка.Сумма;
						КонецЕсли;
						
					ИначеЕсли лпСуммаРознРеализацииСкидка < 0 Тогда
						// оформим сторно
						//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения), СуммаДельта,"Розн.продажа: списана сумма дооценки (сторно)" + "   (стр. №" + НомерСтроки + ")",, 
						//МестоХранения,ТМЦ,Партия,
						//МестоХранения,ТМЦ,Партия, ,,"РЗ");
						
						Проводка = прДвижения.Хозрасчетный.Добавить();
						Проводка.Период      = прСтруктураШапкиДокумента.Дата;
						Проводка.Организация = прСтруктураШапкиДокумента.Организация;
						Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма дооценки (сторно)';uk='Розд.продаж: списана сума дооцінки (сторно)'",Локализация.КодЯзыкаИнформационнойБазы());
						
						Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
						Проводка.СчетКт      = Строка.СчетУчетаБУ;
						
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
						УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);   
						//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
						//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
						Проводка.Сумма = лпСуммаРознРеализацииСкидка;
						
						Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
						Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
							Проводка.СуммаНУДт = Проводка.Сумма;  						
							Проводка.СуммаНУКт = Проводка.Сумма;
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					//Сообщить("Продажа ниже себестоимости - " + лпДокСсылка);
					// продажа ниже себестоимости
					//глПроводка(Контекст,"28.5",ТО_ДатьСчетСклада(МестоХранения),(СуммаВозв + Сумма + СуммаДельта) - СуммаЗакБезНДС,"Розн.продажа: списана сумма торговой наценки" + "   (стр. №" + НомерСтроки + ")",, 
					//	МестоХранения,ТМЦ,Партия,
					//	МестоХранения,ТМЦ,Партия, ,,"РЗ");
					
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Розн.продажа: списана сумма скидки';uk='Розд.продаж: списана сума знижки'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт      = Строка.СчетУчетаБУ;
					
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);  
					//УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Партии",  Партия.Партия);
					//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма; 					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах
				НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
				НовоеДвижение.Активность  = Истина;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
				НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
				НовоеДвижение.Регистратор = лпДокСсылка;  			
				НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.Склад;  			
				НовоеДвижение.СтавкаНДС= Строка.СтавкаНДС;
				НовоеДвижение.Сумма 		 = АБС(лпСуммаРознУчетСНДС);
				Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
					лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость); 
				Иначе
					лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС);
				КонецЕсли;
				НовоеДвижение.СуммаНаценки  = лпСуммаНаценки;  			
				НовоеДвижение.Номенклатура  = Строка.Номенклатура;
				НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
				НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Реализация;    
				
			КонецЕсли;
			
		КонецЦикла; // Для каждого Строка Из прТаблицаПоТоварам Цикл
		
	КонецЕсли;
	
	// итоговые проводки по документу
	Если "СформироватьПроводкиИтог" = "СформироватьПроводкиИтог" Тогда   	    		
		
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_СписаниеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		 прДвижения.ТоварыВНТТВПродажныхЦенах.Очистить();
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// удаляем 
			// схема розничный
			// удаляем 
			лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			// проводка по строке
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		
		//	//***** Регистр накопления "Партии товаров на складах (налоговый учет)"
		//	лпДвижения_ПартииНУ =  прДвижения.ПартииТоваровНаСкладахНалоговыйУчет;
		//	лпНомерПров = лпДвижения_ПартииНУ.Количество();
		//	Пока лпНомерПров > 0 Цикл
		//		лпПроводка = лпДвижения_ПартииНУ.Получить(лпНомерПров - 1);
		//		// схема розничный
		//		// удаляем все
		//		// движение по строке
		//		Если (Лев(лпПроводка.СчетУчета.Код, 2) = "ЗА") Тогда
		//			лпДвижения_ПартииНУ.Удалить(лпНомерПров - 1);
		//		КонецЕсли;
		//		лпНомерПров = лпНомерПров - 1;
		//	КонецЦикла;
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			лпСебестоимость     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "Себестоимость");
			лпСуммаЗакБезНДС     = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			//// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			//
			////***** Налоговый - проводки
			//Проводка = прДвижения.Налоговый.Добавить();
			//Проводка.Период          = лпДокСсылка.Дата;
			//Проводка.Организация = лпДокСсылка.Организация;
			//Проводка.Содержание = "";
			//Проводка.СчетКт = ПланыСчетов.Налоговый.Запасы;
			//ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			//Проводка.Сумма = лпСебестоимость;
			//Если Проводка.СчетДт.Количественный Тогда
			//	Проводка.КоличествоДт = Строка.Количество;
			//КонецЕсли;
			//Если Проводка.СчетКт.Количественный Тогда
			//	Проводка.КоличествоКт = Строка.Количество;
			//КонецЕсли;
			
			//***** Хозрасчетный - проводки
			//Списание себестоимости товара
			// 902(808) - 282
			Проводка = прДвижения.Хозрасчетный.Добавить();
			Проводка.Период      = прСтруктураШапкиДокумента.Дата;
			Проводка.Организация = прСтруктураШапкиДокумента.Организация;
			Проводка.Содержание  = НСтр("ru='Списание товаров: себестоимость';uk='Списання товарів: собівартість'",Локализация.КодЯзыкаИнформационнойБазы());
			Проводка.СчетДт      = прСтруктураШапкиДокумента.СчетДт;
			Проводка.СчетКт      = Строка.СчетУчетаБУ;
			
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, лпДокСсылка.СубконтоДт1);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, лпДокСсылка.СубконтоДт2);
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, лпДокСсылка.СубконтоДт3);
			
			УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа);
			
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
			УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.Номенклатура.СтавкаНДС);
			
			//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
			//!!!
			Проводка.Сумма  = лпСебестоимость;
			
			Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
			Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
				Проводка.НалоговоеНазначениеДт = прСтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУДт = Проводка.Сумма;  			
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
			Если лпСуммаСписываемойНаценки <> 0 Тогда
				//Списание наценки товара
				// 285 - 282
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Списание товаров: наценка';uk='Списання товарів: націнка'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ; // 2852
				Проводка.СчетКт      = Строка.СчетУчетаБУ;   // 2822
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);   				
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
				
				//УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Партии",  Партия.Партия);
				Проводка.Сумма  = лпСуммаСписываемойНаценки;
				
				Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.СуммаНУДт = Проводка.Сумма;   				
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			
			// ***** регистр ТоварыВНТТВПродажныхЦенах
			НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
			НовоеДвижение.Активность  = Истина;
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
			НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
			НовоеДвижение.Регистратор = лпДокСсылка;  			
			НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.Склад;  			
			НовоеДвижение.СтавкаНДС= Строка.СтавкаНДСВРознице;
			НовоеДвижение.Сумма 		 = АБС(лпСуммаРознУчетСНДС);
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость); 
			Иначе
				лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС);
			КонецЕсли;
			НовоеДвижение.СуммаНаценки  = лпСуммаНаценки;  			
			НовоеДвижение.Номенклатура  = Строка.Номенклатура;
			НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
			НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат;    
			
		КонецЦикла; // Для каждого Строка Из прТаблицаПоТоварам Цикл
	КонецЕсли;
	
	// итоговые проводки по документу
	Если "СформироватьПроводкиИтог" = "СформироватьПроводкиИтог" Тогда
		
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры


Процедура ДвиженияПоРегистрам_УТП_ВозвратТоваровОтПокупателя(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		КНТ_ЮрЛицо = Истина;
		Если лпДокСсылка.Контрагент.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			КНТ_ЮрЛицо = Ложь;
		КонецЕсли;
		
		прДвижения.ПартииТоваровНаСкладах.Очистить();
		прДвижения.ПродажиСебестоимость.Очистить();
		прДвижения.ТоварыОрганизаций.Очистить();
		
		Если КНТ_ЮрЛицо = Ложь Тогда
			прДвижения.ПродажиНалоговыйУчет.Очистить();
			прДвижения.РасчетыСКонтрагентами.Очистить();
			прДвижения.ВзаиморасчетыСКонтрагентами.Очистить();
		КонецЕсли;   		
		
		//***** Хозрасчетный
		Если КНТ_ЮрЛицо = Ложь Тогда
			прДвижения.Хозрасчетный.Очистить();
		Иначе
			// удалим все проводки кроме НДС и 361(6811) 
			лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
			лпНомерПров = лпДвижения_Хозрасчетный.Количество();
			Пока лпНомерПров > 0 Цикл
				лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
				// схема розничный и НТТ 
				Если (прСтруктураШапкиДокумента.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Розничный)
					ИЛИ (прСтруктураШапкиДокумента.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.НТТ)  Тогда
					// движение по документу
					Если (лпПроводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом) ИЛИ
						(лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом)  ИЛИ
						(лпПроводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовПоАвансам) ИЛИ
						(лпПроводка.СчетДт = прСтруктураШапкиДокумента.СчетУчетаРасчетовПоАвансам) ИЛИ
						(лпПроводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаНДС) ИЛИ
						(лпПроводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаНДСПодтвержденный)						
						Тогда
						// оставляем проводку
					Иначе
						лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);   
					КонецЕсли;		
				КонецЕсли;
				лпНомерПров = лпНомерПров - 1;
			КонецЦикла;   			
		КонецЕсли;  
	КонецЕсли;
	
	лпДвижения_Продажи = прДвижения.Продажи;
	лпНомерПров = лпДвижения_Продажи.Количество();
	Пока лпНомерПров > 0 Цикл
		лпПроводка = лпДвижения_Продажи.Получить(лпНомерПров - 1);
		лпПроводка.Количество = "";
		лпНомерПров = лпНомерПров - 1; 
	КонецЦикла; 
	
	
	//
	// проводки по итогу ТЧ
	Если "СформироватьПроводкиИтогТЧ" = "СформироватьПроводкиИтогТЧ" Тогда  		
		лпСуммаПродажПоКартам = 0;
		Если КНТ_ЮрЛицо = Ложь Тогда
			лпСуммаПродажПоКартам = АБС(ПолучитьДопРеквизитШапкиСумма(лпДопДанныеДокумента, "СуммаЭквайринг"));
			лпСуммаПродажНаличние = лпДокСсылка.Товары.Итог("Сумма") - лпСуммаПродажПоКартам;
			
			Если лпСуммаПродажПоКартам <> 0 Тогда 										
				// терминал 333 - 36Р
				лпПараметрыСкладов = ПолучитьТО_ПараметрыСкладов(прСтруктураШапкиДокумента.СкладОрдер);
				КНТ = лпПараметрыСкладов.ДоговорЭквайринга.Эквайрер;
				//лпНужнСтатья = Справочники.СтатьиДоходов.НайтиПоКоду("000001001");   			
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("Возврат от покупателя: оплата платежными картами",Локализация.КодЯзыкаИнформационнойБазы());
				//333
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
				ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КНТ);
				
				//36Р
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
				ТоварныйОтчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады", прСтруктураШапкиДокумента.СкладОрдер);
				
				Проводка.Сумма = -лпСуммаПродажПоКартам;
			КонецЕсли;  			
			
			Если лпСуммаПродажНаличние > 0 Тогда
				// наличные  3331 - 36Р
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Возврат от покупателя: оплата наличными';uk='Повернення від покупця: оплата готівкою'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("3331");   // 3331
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
				
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады", прСтруктураШапкиДокумента.СкладОрдер);
				
				Проводка.Сумма = -лпСуммаПродажНаличние;  						
			КонецЕсли;  		
		КонецЕсли;
	КонецЕсли;

	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			// суммы отрицательные
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
				лпСебестоимость = лпСуммаЗакСНДС;
			Иначе
				лпСебестоимость = лпСуммаЗакБезНДС;
			КонецЕсли;
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			
			//***** Хозрасчетный - проводки
						
			// схема НТТ
			Если (прСтруктураШапкиДокумента.СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				// 902 - 282
				Проводка = прДвижения.Хозрасчетный.Добавить();
				Проводка.Период      = прСтруктураШапкиДокумента.Дата;
				Проводка.Организация = прСтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = НСтр("ru='Возврат товаров от покупателя';uk='Повернення товарів від покупця'",Локализация.КодЯзыкаИнформационнойБазы());
				
				Проводка.СчетДт      = Строка.СхемаРеализации.СчетСебестоимости;
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  Справочники.СтатьиЗатрат.НПНК_СВ_Товары);
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа); 
				УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3,  Строка.СхемаРеализации.СубконтоСебестоимости3); 
								
				Проводка.СчетКт      = Строка.СчетУчетаБУ;
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
				УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);
				
				Проводка.Сумма  = -лпСебестоимость;
				
				Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
				Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
					Проводка.СуммаНУДт = Проводка.Сумма;  				
					Проводка.СуммаНУКт = Проводка.Сумма; 
				КонецЕсли;
				
				Если (лпСуммаРеальнойНаценки <> 0) Тогда
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Возврат от покупателя: торговая надбавка сторно";
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт = Строка.СчетУчетаБУ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);  
					
					Проводка.Сумма = -лпСуммаРеальнойНаценки;
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоДт = -Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = -Строка.Количество;
					КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;  					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
				
				Если (лпСуммаРеальнойНаценки <> лпСуммаСписываемойНаценки) Тогда
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Переоц при возвр.:Сторнирована сумма торговой наценки.";
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					Проводка.СчетКт = Строка.СчетУчетаБУ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.СкладОрдер);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДС);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДС);  
					Проводка.Сумма = -(лпСуммаСписываемойНаценки - лпСуммаРеальнойНаценки);
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоДт = -Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = -Строка.Количество;
					КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;  					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				КонецЕсли;
				
				Если КНТ_ЮрЛицо = Ложь Тогда
					// 36Р - 7091
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период      = прСтруктураШапкиДокумента.Дата;
					Проводка.Организация = прСтруктураШапкиДокумента.Организация;
					Проводка.Содержание  = НСтр("ru='Возврат от покупателя';uk='Повернення від покупця'",Локализация.КодЯзыкаИнформационнойБазы());
					
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("36Р");
					ТоварныйОтчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады", прСтруктураШапкиДокумента.СкладОрдер);

					Проводка.СчетКт =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091   			
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДоходов",  Строка.СхемаРеализации.СубконтоДоходов1);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа); 
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Строка.СхемаРеализации.СубконтоДоходов3); 
					
					Проводка.Сумма = -АБС(лпСуммаРознРеализацииСНДС);;
					
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначениеДоходовИЗатрат;
						Проводка.СуммаНУКт = Проводка.Сумма;  
					КонецЕсли;
										
					лпСуммаНДС = Строка.СуммаНДС;
					Если лпСуммаНДС<>0 Тогда
						// 7091 - 6434
						Проводка = прДвижения.Хозрасчетный.Добавить();
						Проводка.Период      = прСтруктураШапкиДокумента.Дата;
						Проводка.Организация = прСтруктураШапкиДокумента.Организация;
						Проводка.Содержание  = НСтр("ru='НДС розничной выручки (возврат)';uk='НДС розничной выручки (возврат)'",Локализация.КодЯзыкаИнформационнойБазы());
						
						Проводка.СчетДт =  ПланыСчетов.Хозрасчетный.ДоходОтРозницы; // 7091   			
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДоходов",  Строка.СхемаРеализации.СубконтоДоходов1);
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы",  Строка.Номенклатура.НоменклатурнаяГруппа); 
						УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоДоходов3); 
					
						Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваРозница;
						
						Проводка.Сумма  = - лпСуммаНДС;
						
						Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
							Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначениеДоходовИЗатрат; 
							Проводка.СуммаНУДт = Проводка.Сумма;  
						КонецЕсли;
					КонецЕсли;		
					
				КонецЕсли;
				
				// ***** регистр ТоварыВНТТВПродажныхЦенах
				НовоеДвижение = прДвижения.ТоварыВНТТВПродажныхЦенах.Добавить();   			
				НовоеДвижение.Активность  = Истина;
				НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;  
				НовоеДвижение.Период 	   = лпДокСсылка.Дата;  
				НовоеДвижение.Регистратор = лпДокСсылка;  			
				НовоеДвижение.Склад 	   = прСтруктураШапкиДокумента.СкладОрдер;  			
				НовоеДвижение.СтавкаНДС= Строка.СтавкаНДС;
				НовоеДвижение.Сумма 		 = -АБС(лпСуммаРознУчетСНДС);
				Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(лпДокСсылка.Дата,лпДокСсылка.Организация).НДС = Ложь Тогда
					лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость); 
				Иначе
					лпСуммаНаценки = АБС(лпСуммаРознУчетСНДС - лпСебестоимость - лпСуммаЗакНДС);
				КонецЕсли;
				НовоеДвижение.СуммаНаценки  = -лпСуммаНаценки;  			
				НовоеДвижение.Номенклатура  = Строка.Номенклатура;
				НовоеДвижение.ХарактеристикаНоменклатуры  = Строка.ХарактеристикаНоменклатуры; 			
				НовоеДвижение.КодОперации   = Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Возврат;    	
				
			КонецЕсли;  			
		КонецЦикла;   				
	КонецЕсли; // СформироватьПроводкиСтрока
	
	Если КНТ_ЮрЛицо = Ложь Тогда
		// чтобы не формировать приложение2
		Движение_ОжидаемыйИПодтвержденныйНДСПродаж = прДвижения.ОжидаемыйИПодтвержденныйНДСПродаж;  
		лпНомерПров = Движение_ОжидаемыйИПодтвержденныйНДСПродаж.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = Движение_ОжидаемыйИПодтвержденныйНДСПродаж.Получить(лпНомерПров - 1);  						
			лпПроводка.ДоговорКонтрагента = "";
			лпПроводка.СобытиеНДС = Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПродаж.РеализацияРозница;
			лпПроводка.БазаНДС = -лпПроводка.БазаНДС;
			лпПроводка.СуммаНДС = -лпПроводка.СуммаНДС;
			лпНомерПров = лпНомерПров - 1; 
		КонецЦикла; 	
	КонецЕсли;	 // Если КНТ_ЮрЛицо = Ложь 
	
	лпДокОбъект = 0;
КонецПроцедуры

Процедура ДвиженияПоРегистрам_БП_ВозвратТоваровОтПокупателя(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			// схема розничный
			
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				// движение по документу
				Если (лпПроводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
				Если (лпПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ) Тогда
					лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
				КонецЕсли;
			КонецЕсли;
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		
	КонецЕсли;
	//
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			// суммы отрицательные
			лпСуммаЗакБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакБезНДС");
			лпСуммаЗакНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакНДС");
			лпСуммаЗакСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаЗакСНДС");
			// !!!
			лпСебестоимость = лпСуммаЗакБезНДС;
			
			лпСуммаРознРеализацииБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииБезНДС");
			лпСуммаРознРеализацииНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииНДС");
			лпСуммаРознРеализацииСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСНДС");
			
			лпСуммаВозвратаБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаБезНДС");
			лпСуммаВозвратаНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаНДС");
			лпСуммаВозвратаСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаВозвратаСНДС");
			
			лпСуммаРознРеализацииСкидка = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознРеализацииСкидка");
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаРеальнойНаценки = (лпСуммаРознРеализацииСНДС + лпСуммаВозвратаСНДС) - лпСебестоимость;
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС - лпСебестоимость;
			
			
			//***** Хозрасчетный - проводки
			//Проводка = прДвижения.Хозрасчетный.Добавить();
			//Проводка.Период          = лпДокСсылка.Дата;
			//Проводка.Организация = лпДокСсылка.Организация;
			//Проводка.Содержание = "Возврат ТМЦ: себестоимость сторно";
			//Проводка.СчетДт = Строка.СчетУчетаБУ;
			//Проводка.СчетКт = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			//ЗаполнитьСубконто(Проводка, прСтруктураШапкиДокумента, Строка,,,,,Строка.СтатьяПриростаУбылиЗапасов);
			//Если Строка.НДСВключенВСтоимость Тогда
			//	Проводка.Сумма = - (Строка.Сумма - Строка.СуммаНДС);
			//Иначе
			//	Проводка.Сумма = - Строка.Сумма;
			//КонецЕсли;
			//Если Проводка.СчетКт.Количественный Тогда
			//	Проводка.КоличествоКт = - Строка.Количество;
			//КонецЕсли;
			
			// схема розничный
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				Если (лпСуммаРеальнойНаценки <> 0) Тогда
					// 285 - 282 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Возврат от покупателя: торговая надбавка сторно";
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					Проводка.СчетКт = Строка.СчетУчетаБУ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					Проводка.Сумма = -лпСуммаРеальнойНаценки;
					Если Проводка.СчетДт.Количественный Тогда
						Проводка.КоличествоДт = -Строка.Количество;
					КонецЕсли;
					Если Проводка.СчетКт.Количественный Тогда
						Проводка.КоличествоКт = -Строка.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры

Процедура ДвиженияПоРегистрам_УТП_ПереоценкаТоваровВРознице(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//определим наш ли это документ
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпСоответствиеДок = Справочники.ТО_СоответствияДокументов;
	лпНайденнаяСсылка = лпСоответствиеДок.НайтиПоРеквизиту("Документ", лпДокСсылка);
	Если лпНайденнаяСсылка <> Справочники.ТО_СоответствияДокументов.ПустаяСсылка() Тогда
		лпДопДанныеДокументаСсылка = лпНайденнаяСсылка.ДопДанныеДокумента;
	Иначе
		лпДопДанныеДокументаСсылка = Справочники.ТО_ДополнительныеДанныеДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если лпДопДанныеДокументаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	лпДопДанныеДокумента = лпДопДанныеДокументаСсылка.ПолучитьОбъект();
	
	//удалим неподходящие стандартные проводки
	Если "УдалитьПроводки" = "УдалитьПроводки" Тогда
		
		//***** Хозрасчетный
		лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
		лпНомерПров = лпДвижения_Хозрасчетный.Количество();
		Пока лпНомерПров > 0 Цикл
			лпПроводка = лпДвижения_Хозрасчетный.Получить(лпНомерПров - 1);
			// схема оптовый
			
			// схема розничный
			лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
			лпНомерПров = лпНомерПров - 1;
		КонецЦикла;
		
		
	КонецЕсли;
	//
	// проводки по итогу ТЧ
	Если "СформироватьПроводкиИтогТЧ" = "СформироватьПроводкиИтогТЧ" Тогда
	КонецЕсли;
	
	// проводки по строке
	Если "СформироватьПроводкиСтрока" = "СформироватьПроводкиСтрока" Тогда
		Для каждого Строка Из лпДокСсылка.Товары Цикл
			// суммы отрицательные
			
			лпСуммаРознУчетБезНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетБезНДС");
			лпСуммаРознУчетНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетНДС");
			лпСуммаРознУчетСНДС = ПолучитьДопРеквизитТабличнойЧастиСумма(лпДопДанныеДокумента, "Товары", Строка.Номенклатура, "СуммаРознУчетСНДС");
			
			лпСуммаСписываемойНаценки = лпСуммаРознУчетСНДС;
			
			//Если Тип = 1 Тогда //приход
			//	глПроводка(Контекст,ТО_ДатьСчетСклада(ДатьМестоХранения()),"28.5",СуммаРознСНДС - СуммаЗакБезНДС,"Переоц: сумма торговой наценки",, 
			//		ДатьМестоХранения(),Товар,Партия,
			//		ДатьМестоХранения(),Товар,Партия, ,,"ПХ");
			//Иначе //расход
			//	глПроводка(Контекст,ТО_ДатьСчетСклада(ДатьМестоХранения()),"28.5",-(СуммаРознСНДС - СуммаЗакБезНДС),"Переоц:Сторнирована сумма торговой наценки",, 
			//		ДатьМестоХранения(),Товар,Партия,
			//		ДатьМестоХранения(),Товар,Партия, ,,"ПХ");
			//КонецЕсли;
			
			// схема розничный
			лпСтруктураУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(лпДокСсылка.Организация, Строка.Номенклатура, лпДокСсылка.Склад);
			лпСчетУчетаБУ  = лпСтруктураУчета.СчетУчетаБУ;
			
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
				Если (лпСуммаСписываемойНаценки < 0) Тогда
					// 282 - 285 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Переоценка товаров в рознице: торговая наценка";
					Проводка.СчетДт = лпСчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					//Если Проводка.СчетДт.Количественный Тогда
					//	Проводка.КоличествоДт = -Строка.Количество;
					//КонецЕсли;
					//Если Проводка.СчетКт.Количественный Тогда
					//	Проводка.КоличествоКт = -Строка.Количество;
					//КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Проводка.СуммаНУКт = Проводка.Сумма;
					
				ИначеЕсли (лпСуммаСписываемойНаценки > 0) Тогда
					// 282 - 285 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Переоценка товаров в рознице: торговая наценка сторно";
					Проводка.СчетДт = лпСчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					Проводка.Сумма = -лпСуммаСписываемойНаценки;
					//Если Проводка.СчетДт.Количественный Тогда
					//	Проводка.КоличествоДт = -Строка.Количество;
					//КонецЕсли;
					//Если Проводка.СчетКт.Количественный Тогда
					//	Проводка.КоличествоКт = -Строка.Количество;
					//КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.СуммаНУДт = Проводка.Сумма;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Проводка.СуммаНУКт = Проводка.Сумма;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//НТТ
			Если (прСтруктураШапкиДокумента.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ) Тогда
				Если (лпСуммаСписываемойНаценки < 0) Тогда
					// 282 - 285 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Переоценка товаров в рознице: торговая наценка";
					Проводка.СчетДт = лпСчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);   				
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					//Если Проводка.СчетДт.Количественный Тогда
					//	Проводка.КоличествоДт = -Строка.Количество;
					//КонецЕсли;
					//Если Проводка.СчетКт.Количественный Тогда
					//	Проводка.КоличествоКт = -Строка.Количество;
					//КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение;
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма;					
						Проводка.СуммаНУКт = Проводка.Сумма;
					КонецЕсли;
					
				ИначеЕсли (лпСуммаСписываемойНаценки > 0) Тогда
					// 282 - 285 торговая наценка
					Проводка = прДвижения.Хозрасчетный.Добавить();
					Проводка.Период          = лпДокСсылка.Дата;
					Проводка.Организация = лпДокСсылка.Организация;
					Проводка.Содержание = "Переоценка товаров в рознице: торговая наценка сторно";
					Проводка.СчетДт = лпСчетУчетаБУ;
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  прСтруктураШапкиДокумента.Склад);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура",  Строка.Номенклатура);
					УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  Строка.СтавкаНДСВРознице);
					Проводка.Сумма = лпСуммаСписываемойНаценки;
					//Если Проводка.СчетДт.Количественный Тогда
					//	Проводка.КоличествоДт = -Строка.Количество;
					//КонецЕсли;
					//Если Проводка.СчетКт.Количественный Тогда
					//	Проводка.КоличествоКт = -Строка.Количество;
					//КонецЕсли;
					
					Проводка.НалоговоеНазначениеДт = Строка.НалоговоеНазначение; 
					Проводка.НалоговоеНазначениеКт = Строка.НалоговоеНазначение;
					Если лпДокОбъект.Дата < Дата(2015,01,01,0,0,0) Тогда
						Проводка.СуммаНУДт = Проводка.Сумма; 					
						Проводка.СуммаНУКт = Проводка.Сумма; 
					КонецЕсли;
				КонецЕсли; 				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	лпДокОбъект = 0;
КонецПроцедуры

Процедура ДвиженияПоРегистрамПлатежноеПоручениеВход_VAV(прОтказ, прДвижения,прЗаголовок, прСтруктураШапкиДокумента) Экспорт
	лпДокСсылка = прСтруктураШапкиДокумента.Ссылка;
	лпДокОбъект = лпДокСсылка.ПолучитьОбъект();
	
	//***** Хозрасчетный
	лпДвижения_Хозрасчетный = прДвижения.Хозрасчетный;
	лпНомерПров = лпДвижения_Хозрасчетный.Количество();
	Пока лпНомерПров > 0 Цикл
		лпДвижения_Хозрасчетный.Удалить(лпНомерПров - 1);
		лпНомерПров = лпНомерПров - 1; 
	КонецЦикла;
	
	Проводка = прДвижения.Хозрасчетный.Добавить();
	Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	Проводка.Содержание  = "Расчеты по платежным картам и банковским кредитам";
	
	Проводка.СчетДт      = прСтруктураШапкиДокумента.СчетБанк;
	Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
	
	УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "БанковскиеСчета",  прСтруктураШапкиДокумента.СчетОрганизации);
	УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", прСтруктураШапкиДокумента.СтатьяДвиженияДенежныхСредств);  
	
	УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты",  прСтруктураШапкиДокумента.Контрагент); 	
	Проводка.Сумма = прСтруктураШапкиДокумента.СуммаДокумента;
	
	Проводка = прДвижения.Хозрасчетный.Добавить();
	Проводка.Период      = прСтруктураШапкиДокумента.Дата;
	Проводка.Организация = прСтруктураШапкиДокумента.Организация;
	Проводка.Содержание  = "Расчеты по платежным картам и банковским кредитам";
	
	Проводка.СчетДт      = прСтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
	Проводка.СчетКт      = прСтруктураШапкиДокумента.СчетБанк;
	
	УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",  прСтруктураШапкиДокумента.СубконтоКт1);
	 УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",  прСтруктураШапкиДокумента.Подразделение);
	
	УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "БанковскиеСчета",  прСтруктураШапкиДокумента.СчетОрганизации); 
	УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,"СтатьиДвиженияДенежныхСредств", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("00024"));  
	Проводка.Сумма = прСтруктураШапкиДокумента.СуммаУслуг;
	
КонецПроцедуры

// ПеремещениеТоваров, РеализацияТоваровУслуг, ОтчетОРозничныхПродажах, СписаниеТоваров, ПереоценкаТоваровВРознице
Процедура ДвиженияПоРегистрам(прОтказ, прДвижения,прРежимПроведения, прСтруктураШапкиДокумента) Экспорт
	Если прОтказ Тогда
		Возврат;
	КонецЕсли;
	// заглушка
	Если Найти(прСтруктураШапкиДокумента.Ссылка.Комментарий, "*****") <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	//***** ПоступлениеТоваровУслуг *****
	Если прСтруктураШапкиДокумента.ВидДокумента = "ПоступлениеТоваровУслуг" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_ПоступлениеТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ПоступлениеТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
		//***** ВозвратТоваровПоставщику *****
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровПоставщикуИзНТТ" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_ВозвратТоваровПоставщику(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ВозвратТоваровПоставщикуИзНТТ(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "ПеремещениеТоваров" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_ПеремещениеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ПеремещениеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "ОтчетОРозничныхПродажах" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_ОтчетОРозничныхПродажах(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ОтчетОРозничныхПродажах(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "РеализацияТоваровУслуг" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_РеализацияТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_РеализацияТоваровУслуг(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровОтПокупателя" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			ДвиженияПоРегистрам_БП_ВозвратТоваровОтПокупателя(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ВозвратТоваровОтПокупателя(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "СписаниеТоваров" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			//ДвиженияПоРегистрам_БП_СписаниеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_СписаниеТоваров(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;
	ИначеЕсли прСтруктураШапкиДокумента.ВидДокумента = "ПереоценкаТоваровВРознице" Тогда
		Если ИДКонфигурации() = "БП" Тогда
			//ДвиженияПоРегистрам_БП_ПереоценкаТоваровВРознице(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ПереоценкаТоваровВРознице(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли; 
	ИначеЕсли
		прСтруктураШапкиДокумента.ВидДокумента = "ПоступлениеТоваровУслугВНТТ" Тогда
		Если ИДКонфигурации() = "БП" Тогда  			
		ИначеЕсли ИДКонфигурации() = "УТП" Тогда
			ДвиженияПоРегистрам_УТП_ПоступлениеТоваровУслугВНТТ(прДвижения,прРежимПроведения, прСтруктураШапкиДокумента);
		КонецЕсли;   	
	КонецЕсли;
	          	
КонецПроцедуры 

